CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
    /* DCU */
    INT_DCU1                = 55u,
    INT_DCU2                = 56u,
    INT_DCU3                = 57u,
    INT_DCU4                = 58u,
    
    /* TIMER 0 */
    INT_TMR01_GCMA          = 64u,
    INT_TMR01_GCMB          = 65u,
    INT_TMR02_GCMA          = 66u,
    INT_TMR02_GCMB          = 67u,
    
    /* RTC */
    INT_RTC_ALM             = 81u,
    INT_RTC_PRD             = 82u,
    
    /* XTAL32 stop */
    INT_XTAL32_STOP         = 84u,
    
    /* XTAL stop */
    INT_XTAL_STOP           = 85u,
    
    /* wake-up timer */
    INT_WKTM_PRD            = 86u,
    
    /* SWDT */
    INT_SWDT_REFUDF         = 87u,
    
    /* TIMER 6 */
    INT_TMR61_GCMA          = 96u,
    INT_TMR61_GCMB          = 97u,
    INT_TMR61_GCMC          = 98u,
    INT_TMR61_GCMD          = 99u,
    INT_TMR61_GCME          = 100u,
    INT_TMR61_GCMF          = 101u,
    INT_TMR61_GOVF          = 102u,
    INT_TMR61_GUDF          = 103u,
    INT_TMR61_GDTE          = 104u,
    INT_TMR61_SCMA          = 107u,
    INT_TMR61_SCMB          = 108u,
    INT_TMR62_GCMA          = 112u,
    INT_TMR62_GCMB          = 113u,
    INT_TMR62_GCMC          = 114u,
    INT_TMR62_GCMD          = 115u,
    INT_TMR62_GCME          = 116u,
    INT_TMR62_GCMF          = 117u,
    INT_TMR62_GOVF          = 118u,
    INT_TMR62_GUDF          = 119u,
    INT_TMR62_GDTE          = 120u,
    INT_TMR62_SCMA          = 123u,
    INT_TMR62_SCMB          = 124u,
    INT_TMR63_GCMA          = 128u,
    INT_TMR63_GCMB          = 129u,
    INT_TMR63_GCMC          = 130u,
    INT_TMR63_GCMD          = 131u,
    INT_TMR63_GCME          = 132u,
    INT_TMR63_GCMF          = 133u,
    INT_TMR63_GOVF          = 134u,
    INT_TMR63_GUDF          = 135u,
    INT_TMR63_GDTE          = 136u,
    INT_TMR63_SCMA          = 139u,
    INT_TMR63_SCMB          = 140u,
    
    /* TIMER A */
    INT_TMRA1_OVF           = 256u,
    INT_TMRA1_UDF           = 257u,
    INT_TMRA1_CMP           = 258u,
    INT_TMRA2_OVF           = 259u,
    INT_TMRA2_UDF           = 260u,
    INT_TMRA2_CMP           = 261u,
    INT_TMRA3_OVF           = 262u,
    INT_TMRA3_UDF           = 263u,
    INT_TMRA3_CMP           = 264u,
    INT_TMRA4_OVF           = 265u,
    INT_TMRA4_UDF           = 266u,
    INT_TMRA4_CMP           = 267u,
    INT_TMRA5_OVF           = 268u,
    INT_TMRA5_UDF           = 269u,
    INT_TMRA5_CMP           = 270u,
    INT_TMRA6_OVF           = 272u,
    INT_TMRA6_UDF           = 273u,
    INT_TMRA6_CMP           = 274u,
    
    /* USB FS */
    INT_USBFS_GLB           = 275u,
    
    /* USRAT */
    INT_USART1_EI           = 278u,
    INT_USART1_RI           = 279u,
    INT_USART1_TI           = 280u,
    INT_USART1_TCI          = 281u,
    INT_USART1_RTO          = 282u,
    INT_USART1_WUPI         = 432u,
    INT_USART2_EI           = 283u,
    INT_USART2_RI           = 284u,
    INT_USART2_TI           = 285u,
    INT_USART2_TCI          = 286u,
    INT_USART2_RTO          = 287u,
    INT_USART3_EI           = 288u,
    INT_USART3_RI           = 289u,
    INT_USART3_TI           = 290u,
    INT_USART3_TCI          = 291u,
    INT_USART3_RTO          = 292u,
    INT_USART4_EI           = 293u,
    INT_USART4_RI           = 294u,
    INT_USART4_TI           = 295u,
    INT_USART4_TCI          = 296u,
    INT_USART4_RTO          = 297u,
    
    /* SPI */
    INT_SPI1_SRRI           = 299u,
    INT_SPI1_SRTI           = 300u,
    INT_SPI1_SPII           = 301u,
    INT_SPI1_SPEI           = 302u,
    INT_SPI2_SRRI           = 304u,
    INT_SPI2_SRTI           = 305u,
    INT_SPI2_SPII           = 306u,
    INT_SPI2_SPEI           = 307u,
    INT_SPI3_SRRI           = 309u,
    INT_SPI3_SRTI           = 310u,
    INT_SPI3_SPII           = 311u,
    INT_SPI3_SPEI           = 312u,
    INT_SPI4_SRRI           = 314u,
    INT_SPI4_SRTI           = 315u,
    INT_SPI4_SPII           = 316u,
    INT_SPI4_SPEI           = 317u,
    
    /* TIMER 4 */
    INT_TMR41_GCMUH         = 320u,
    INT_TMR41_GCMUL         = 321u,
    INT_TMR41_GCMVH         = 322u,
    INT_TMR41_GCMVL         = 323u,
    INT_TMR41_GCMWH         = 324u,
    INT_TMR41_GCMWL         = 325u,
    INT_TMR41_GOVF          = 326u,
    INT_TMR41_GUDF          = 327u,
    INT_TMR41_RLOU          = 328u,
    INT_TMR41_RLOV          = 329u,
    INT_TMR41_RLOW          = 330u,
    INT_TMR42_GCMUH         = 336u,
    INT_TMR42_GCMUL         = 337u,
    INT_TMR42_GCMVH         = 338u,
    INT_TMR42_GCMVL         = 339u,
    INT_TMR42_GCMWH         = 340u,
    INT_TMR42_GCMWL         = 341u,
    INT_TMR42_GOVF          = 342u,
    INT_TMR42_GUDF          = 343u,
    INT_TMR42_RLOU          = 344u,
    INT_TMR42_RLOV          = 345u,
    INT_TMR42_RLOW          = 346u,
    INT_TMR43_GCMUH         = 352u,
    INT_TMR43_GCMUL         = 353u,
    INT_TMR43_GCMVH         = 354u,
    INT_TMR43_GCMVL         = 355u,
    INT_TMR43_GCMWH         = 356u,
    INT_TMR43_GCMWL         = 357u,
    INT_TMR43_GOVF          = 358u,
    INT_TMR43_GUDF          = 359u,
    INT_TMR43_RLOU          = 360u,
    INT_TMR43_RLOV          = 361u,
    INT_TMR43_RLOW          = 362u,
    
    /* EMB */
    INT_EMB_GR0             = 390u,
    INT_EMB_GR1             = 391u,
    INT_EMB_GR2             = 392u,
    INT_EMB_GR3             = 393u,
    
    /* EVENT PORT */
    INT_EVENT_PORT1         = 394u,
    INT_EVENT_PORT2         = 395u,
    INT_EVENT_PORT3         = 396u,
    INT_EVENT_PORT4         = 397u,
    
    /* I2S */
    INT_I2S1_TXIRQOUT       = 400u,
    INT_I2S1_RXIRQOUT       = 401u,
    INT_I2S1_ERRIRQOUT      = 402u,
    INT_I2S2_TXIRQOUT       = 403u,
    INT_I2S2_RXIRQOUT       = 404u,
    INT_I2S2_ERRIRQOUT      = 405u,
    INT_I2S3_TXIRQOUT       = 406u,
    INT_I2S3_RXIRQOUT       = 407u,
    INT_I2S3_ERRIRQOUT      = 408u,
    INT_I2S4_TXIRQOUT       = 409u,
    INT_I2S4_RXIRQOUT       = 410u,
    INT_I2S4_ERRIRQOUT      = 411u,
    
    /* COMPARATOR */
    INT_ACMP1               = 416u,
    INT_ACMP2               = 417u,
    INT_ACMP3               = 418u,
    
    /* I2C */
    INT_I2C1_RXI            = 420u,
    INT_I2C1_TXI            = 421u,
    INT_I2C1_TEI            = 422u,
    INT_I2C1_EE1            = 423u,
    INT_I2C2_RXI            = 424u,
    INT_I2C2_TXI            = 425u,
    INT_I2C2_TEI            = 426u,
    INT_I2C2_EE1            = 427u,
    INT_I2C3_RXI            = 428u,
    INT_I2C3_TXI            = 429u,
    INT_I2C3_TEI            = 430u,
    INT_I2C3_EE1            = 431u,
    
    /* PVD */
    INT_PVD_PVD1            = 433u,
    INT_PVD_PVD2            = 434u,
    
    /* Temp. sensor */
    INT_OTS                 = 435u,
    
    /* FCM */
    INT_FCMFERRI            = 436u,
    INT_FCMMENDI            = 437u,
    INT_FCMCOVFI            = 438u,
    
