CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
typedef struct
{
    __IO uint32_t MODE                      : 3;
    __IO uint32_t DATASIZE                  : 2;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t COMP_TRG                  : 1;
    uint32_t RESERVED9                      :22;
    __IO uint32_t INTEN                     : 1;
} stc_dcu_ctl_field_t;

typedef struct
{
    __IO uint32_t FLAG_OP                   : 1;
    __IO uint32_t FLAG_LS2                  : 1;
    __IO uint32_t FLAG_EQ2                  : 1;
    __IO uint32_t FLAG_GT2                  : 1;
    __IO uint32_t FLAG_LS1                  : 1;
    __IO uint32_t FLAG_EQ1                  : 1;
    __IO uint32_t FLAG_GT1                  : 1;
} stc_dcu_flag_field_t;

typedef struct
{
    __IO uint32_t CLR_OP                    : 1;
    __IO uint32_t CLR_LS2                   : 1;
    __IO uint32_t CLR_EQ2                   : 1;
    __IO uint32_t CLR_GT2                   : 1;
    __IO uint32_t CLR_LS1                   : 1;
    __IO uint32_t CLR_EQ1                   : 1;
    __IO uint32_t CLR_GT1                   : 1;
} stc_dcu_flagclr_field_t;

typedef struct
{
    __IO uint32_t INT_OP                    : 1;
    __IO uint32_t INT_LS2                   : 1;
    __IO uint32_t INT_EQ2                   : 1;
    __IO uint32_t INT_GT2                   : 1;
    __IO uint32_t INT_LS1                   : 1;
    __IO uint32_t INT_EQ1                   : 1;
    __IO uint32_t INT_GT1                   : 1;
    __IO uint32_t INT_WIN                   : 2;
} stc_dcu_intsel_field_t;

typedef struct
{
    __IO uint32_t EN                        : 1;
} stc_dma_en_field_t;

typedef struct
{
    __IO uint32_t TRNERR                    : 4;
    uint32_t RESERVED4                      :12;
    __IO uint32_t REQERR                    : 4;
} stc_dma_intstat0_field_t;

typedef struct
{
    __IO uint32_t TC                        : 4;
    uint32_t RESERVED4                      :12;
    __IO uint32_t BTC                       : 4;
} stc_dma_intstat1_field_t;

typedef struct
{
    __IO uint32_t MSKTRNERR                 : 4;
    uint32_t RESERVED4                      :12;
    __IO uint32_t MSKREQERR                 : 4;
} stc_dma_intmask0_field_t;

typedef struct
{
    __IO uint32_t MSKTC                     : 4;
    uint32_t RESERVED4                      :12;
    __IO uint32_t MSKBTC                    : 4;
} stc_dma_intmask1_field_t;

typedef struct
{
    __IO uint32_t CLRTRNERR                 : 4;
    uint32_t RESERVED4                      :12;
    __IO uint32_t CLRREQERR                 : 4;
} stc_dma_intclr0_field_t;

typedef struct
{
    __IO uint32_t CLRTC                     : 4;
    uint32_t RESERVED4                      :12;
    __IO uint32_t CLRBTC                    : 4;
} stc_dma_intclr1_field_t;

typedef struct
{
    __IO uint32_t CHEN                      : 4;
} stc_dma_chen_field_t;

typedef struct
{
    __IO uint32_t DMAACT                    : 1;
    __IO uint32_t RCFGACT                   : 1;
    uint32_t RESERVED2                      :14;
    __IO uint32_t CHACT                     : 4;
} stc_dma_chstat_field_t;

typedef struct
{
    __IO uint32_t RCFGEN                    : 1;
    __IO uint32_t RCFGLLP                   : 1;
    uint32_t RESERVED2                      : 6;
    __IO uint32_t RCFGCHS                   : 4;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t SARMD                     : 2;
    __IO uint32_t DARMD                     : 2;
    __IO uint32_t CNTMD                     : 2;
} stc_dma_rcfgctl_field_t;

typedef struct
{
    __IO uint32_t BLKSIZE                   :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t CNT                       :16;
} stc_dma_dtctl_field_t;

typedef struct
{
    __IO uint32_t SRPT                      :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t DRPT                      :10;
} stc_dma_rpt_field_t;

typedef struct
{
    __IO uint32_t SRPTB                     :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t DRPTB                     :10;
} stc_dma_rptb_field_t;

typedef struct
{
    __IO uint32_t SOFFSET                   :20;
    __IO uint32_t SNSCNT                    :12;
} stc_dma_snseqctl_field_t;

typedef struct
{
    __IO uint32_t SNSDIST                   :20;
    __IO uint32_t SNSCNTB                   :12;
} stc_dma_snseqctlb_field_t;

typedef struct
{
    __IO uint32_t DOFFSET                   :20;
    __IO uint32_t DNSCNT                    :12;
} stc_dma_dnseqctl_field_t;

typedef struct
{
    __IO uint32_t DNSDIST                   :20;
    __IO uint32_t DNSCNTB                   :12;
} stc_dma_dnseqctlb_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t LLP                       :30;
} stc_dma_llp_field_t;

typedef struct
{
    __IO uint32_t SINC                      : 2;
    __IO uint32_t DINC                      : 2;
    __IO uint32_t SRTPEN                    : 1;
    __IO uint32_t DRPTEN                    : 1;
    __IO uint32_t SNSEQEN                   : 1;
    __IO uint32_t DNSEQEN                   : 1;
    __IO uint32_t HSIZE                     : 2;
    __IO uint32_t LLPEN                     : 1;
    __IO uint32_t LLPRUN                    : 1;
    __IO uint32_t IE                        : 1;
} stc_dma_ch0ctl_field_t;

typedef struct
{
    __IO uint32_t BLKSIZE                   :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t CNT                       :16;
} stc_dma_mondtctl_field_t;

typedef struct
{
    __IO uint32_t SRPT                      :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t DRPT                      :10;
} stc_dma_monrpt_field_t;

typedef struct
{
    __IO uint32_t SOFFSET                   :20;
    __IO uint32_t SNSCNT                    :12;
} stc_dma_monsnseqctl_field_t;

typedef struct
{
    __IO uint32_t DOFFSET                   :20;
    __IO uint32_t DNSCNT                    :12;
} stc_dma_mondnseqctl_field_t;

typedef struct
{
    __IO uint32_t SINC                      : 2;
    __IO uint32_t DINC                      : 2;
    __IO uint32_t SRTPEN                    : 1;
    __IO uint32_t DRPTEN                    : 1;
    __IO uint32_t SNSEQEN                   : 1;
    __IO uint32_t DNSEQEN                   : 1;
    __IO uint32_t HSIZE                     : 2;
    __IO uint32_t LLPEN                     : 1;
    __IO uint32_t LLPRUN                    : 1;
    __IO uint32_t IE                        : 1;
} stc_dma_ch1ctl_field_t;

typedef struct
{
    __IO uint32_t SINC                      : 2;
    __IO uint32_t DINC                      : 2;
    __IO uint32_t SRTPEN                    : 1;
    __IO uint32_t DRPTEN                    : 1;
    __IO uint32_t SNSEQEN                   : 1;
    __IO uint32_t DNSEQEN                   : 1;
    __IO uint32_t HSIZE                     : 2;
    __IO uint32_t LLPEN                     : 1;
    __IO uint32_t LLPRUN                    : 1;
    __IO uint32_t IE                        : 1;
} stc_dma_ch2ctl_field_t;

typedef struct
{
    __IO uint32_t SINC                      : 2;
    __IO uint32_t DINC                      : 2;
    __IO uint32_t SRTPEN                    : 1;
    __IO uint32_t DRPTEN                    : 1;
    __IO uint32_t SNSEQEN                   : 1;
    __IO uint32_t DNSEQEN                   : 1;
    __IO uint32_t HSIZE                     : 2;
    __IO uint32_t LLPEN                     : 1;
    __IO uint32_t LLPRUN                    : 1;
    __IO uint32_t IE                        : 1;
} stc_dma_ch3ctl_field_t;

typedef struct
{
    __IO uint32_t FAPRT                     :16;
} stc_efm_faprt_field_t;

typedef struct
{
    __IO uint32_t FSTP                      : 1;
} stc_efm_fstp_field_t;

typedef struct
{
    __IO uint32_t SLPMD                     : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t FLWT                      : 4;
    __IO uint32_t LVM                       : 1;
    uint32_t RESERVED9                      : 7;
    __IO uint32_t CACHE                     : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t CRST                      : 1;
} stc_efm_frmc_field_t;

typedef struct
{
    __IO uint32_t PEMODE                    : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t PEMOD                     : 3;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t BUSHLDCTL                 : 1;
} stc_efm_fwmc_field_t;

typedef struct
{
    __IO uint32_t PEWERR                    : 1;
    __IO uint32_t PEPRTERR                  : 1;
    __IO uint32_t PGSZERR                   : 1;
    __IO uint32_t PGMISMTCH                 : 1;
    __IO uint32_t OPTEND                    : 1;
    __IO uint32_t RDCOLERR                  : 1;
    uint32_t RESERVED6                      : 2;
    __IO uint32_t RDY                       : 1;
} stc_efm_fsr_field_t;

typedef struct
{
    __IO uint32_t PEWERRCLR                 : 1;
    __IO uint32_t PEPRTERRCLR               : 1;
    __IO uint32_t PGSZERRCLR                : 1;
    __IO uint32_t PGMISMTCHCLR              : 1;
    __IO uint32_t OPTENDCLR                 : 1;
    __IO uint32_t RDCOLERRCLR               : 1;
} stc_efm_fsclr_field_t;

typedef struct
{
    __IO uint32_t PEERRITE                  : 1;
    __IO uint32_t OPTENDITE                 : 1;
    __IO uint32_t RDCOLERRITE               : 1;
} stc_efm_fite_field_t;

typedef struct
{
    __IO uint32_t FSWP                      : 1;
} stc_efm_fswp_field_t;

typedef struct
{
    __IO uint32_t FPMTSW                    :20;
} stc_efm_fpmtsw_field_t;

typedef struct
{
    __IO uint32_t FPMTEW                    :20;
} stc_efm_fpmtew_field_t;

typedef struct
{
    __IO uint32_t REMPRT                    :16;
} stc_efm_mmf_remprt_field_t;

typedef struct
{
    __IO uint32_t RM0SIZE                   : 5;
    uint32_t RESERVED5                      : 7;
    __IO uint32_t RM0TADDR                  :17;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t EN0                       : 1;
} stc_efm_mmf_remcr0_field_t;

typedef struct
{
    __IO uint32_t RM1SIZE                   : 5;
    uint32_t RESERVED5                      : 7;
    __IO uint32_t RM1TADDR                  :17;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t EN1                       : 1;
} stc_efm_mmf_remcr1_field_t;

typedef struct
{
    __IO uint32_t PORTINEN                  : 1;
    __IO uint32_t CMPEN                     : 3;
    uint32_t RESERVED4                      : 1;
    __IO uint32_t OSCSTPEN                  : 1;
    __IO uint32_t PWMSEL                    : 3;
    uint32_t RESERVED9                      :19;
    __IO uint32_t NFSEL                     : 2;
    __IO uint32_t NFEN                      : 1;
    __IO uint32_t INVSEL                    : 1;
} stc_emb_ctl_field_t;

typedef struct
{
    __IO uint32_t PWMLV                     : 3;
} stc_emb_pwmlv_field_t;

typedef struct
{
    __IO uint32_t SOE                       : 1;
} stc_emb_soe_field_t;

typedef struct
{
    __IO uint32_t PORTINF                   : 1;
    __IO uint32_t PWMSF                     : 1;
    __IO uint32_t CMPF                      : 1;
    __IO uint32_t OSF                       : 1;
    __IO uint32_t PORTINST                  : 1;
    __IO uint32_t PWMST                     : 1;
} stc_emb_stat_field_t;

typedef struct
{
    __IO uint32_t PORTINFCLR                : 1;
    __IO uint32_t PWMSFCLR                  : 1;
    __IO uint32_t CMPFCLR                   : 1;
    __IO uint32_t OSFCLR                    : 1;
} stc_emb_statclr_field_t;

typedef struct
{
    __IO uint32_t PORTINTEN                 : 1;
    __IO uint32_t PWMINTEN                  : 1;
    __IO uint32_t CMPINTEN                  : 1;
    __IO uint32_t OSINTEN                   : 1;
} stc_emb_inten_field_t;

typedef struct
{
    __IO uint32_t LVR                       :16;
} stc_fcm_lvr_field_t;

typedef struct
{
    __IO uint32_t UVR                       :16;
} stc_fcm_uvr_field_t;

typedef struct
{
    __IO uint32_t CNTR                      :16;
} stc_fcm_cntr_field_t;

typedef struct
{
    __IO uint32_t START                     : 1;
} stc_fcm_str_field_t;

typedef struct
{
    __IO uint32_t MDIVS                     : 2;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t MCKS                      : 4;
} stc_fcm_mccr_field_t;

typedef struct
{
    __IO uint32_t RDIVS                     : 2;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t RCKS                      : 4;
    __IO uint32_t INEXS                     : 1;
    __IO uint32_t DNFS                      : 2;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t EDGES                     : 2;
    uint32_t RESERVED14                     : 1;
    __IO uint32_t EXREFE                    : 1;
} stc_fcm_rccr_field_t;

typedef struct
{
    __IO uint32_t ERRIE                     : 1;
    __IO uint32_t MENDIE                    : 1;
    __IO uint32_t OVFIE                     : 1;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t ERRINTRS                  : 1;
    uint32_t RESERVED5                      : 2;
    __IO uint32_t ERRE                      : 1;
} stc_fcm_rier_field_t;

typedef struct
{
    __IO uint32_t ERRF                      : 1;
    __IO uint32_t MENDF                     : 1;
    __IO uint32_t OVF                       : 1;
} stc_fcm_sr_field_t;

typedef struct
{
    __IO uint32_t ERRFCLR                   : 1;
    __IO uint32_t MENDFCLR                  : 1;
    __IO uint32_t OVFCLR                    : 1;
} stc_fcm_clr_field_t;

typedef struct
{
    __IO uint32_t START                     : 1;
    __IO uint32_t FST_GRP                   : 1;
} stc_hash_cr_field_t;

typedef struct
{
    __IO uint32_t PE                        : 1;
    __IO uint32_t SMBUS                     : 1;
    __IO uint32_t SMBALRTEN                 : 1;
    __IO uint32_t SMBDEFAULTEN              : 1;
    __IO uint32_t SMBHOSTEN                 : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t ENGC                      : 1;
    __IO uint32_t RESTART                   : 1;
    __IO uint32_t START                     : 1;
    __IO uint32_t STOP                      : 1;
    __IO uint32_t ACK                       : 1;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t SWRST                     : 1;
} stc_i2c_cr1_field_t;

typedef struct
{
    __IO uint32_t STARTIE                   : 1;
    __IO uint32_t SLADDR0IE                 : 1;
    __IO uint32_t SLADDR1IE                 : 1;
    __IO uint32_t TENDIE                    : 1;
    __IO uint32_t STOPIE                    : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t RFULLIE                   : 1;
    __IO uint32_t TEMPTYIE                  : 1;
    uint32_t RESERVED8                      : 1;
    __IO uint32_t ARLOIE                    : 1;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t NACKIE                    : 1;
    uint32_t RESERVED13                     : 1;
    __IO uint32_t TMOUTIE                   : 1;
    uint32_t RESERVED15                     : 5;
    __IO uint32_t GENCALLIE                 : 1;
    __IO uint32_t SMBDEFAULTIE              : 1;
    __IO uint32_t SMHOSTIE                  : 1;
    __IO uint32_t SMBALRTIE                 : 1;
} stc_i2c_cr2_field_t;

typedef struct
{
    __IO uint32_t TMOUTEN                   : 1;
    __IO uint32_t LTMOUT                    : 1;
    __IO uint32_t HTMOUT                    : 1;
    uint32_t RESERVED3                      : 4;
    __IO uint32_t FACKEN                    : 1;
} stc_i2c_cr3_field_t;

typedef struct
{
    __IO uint32_t SLADDR0                   :10;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t SLADDR0EN                 : 1;
    uint32_t RESERVED13                     : 2;
    __IO uint32_t ADDRMOD0                  : 1;
} stc_i2c_slr0_field_t;

typedef struct
{
    __IO uint32_t SLADDR1                   :10;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t SLADDR1EN                 : 1;
    uint32_t RESERVED13                     : 2;
    __IO uint32_t ADDRMOD1                  : 1;
} stc_i2c_slr1_field_t;

typedef struct
{
    __IO uint32_t TOUTLOW                   :16;
    __IO uint32_t TOUTHIGH                  :16;
} stc_i2c_sltr_field_t;

typedef struct
{
    __IO uint32_t STARTF                    : 1;
    __IO uint32_t SLADDR0F                  : 1;
    __IO uint32_t SLADDR1F                  : 1;
    __IO uint32_t TENDF                     : 1;
    __IO uint32_t STOPF                     : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t RFULLF                    : 1;
    __IO uint32_t TEMPTYF                   : 1;
    uint32_t RESERVED8                      : 1;
    __IO uint32_t ARLOF                     : 1;
    __IO uint32_t ACKRF                     : 1;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t NACKF                     : 1;
    uint32_t RESERVED13                     : 1;
    __IO uint32_t TMOUTF                    : 1;
    uint32_t RESERVED15                     : 1;
    __IO uint32_t MSL                       : 1;
    __IO uint32_t BUSY                      : 1;
    __IO uint32_t TRA                       : 1;
    uint32_t RESERVED19                     : 1;
    __IO uint32_t GENCALLF                  : 1;
    __IO uint32_t SMBDEFAULTF               : 1;
    __IO uint32_t SMBHOSTF                  : 1;
    __IO uint32_t SMBALRTF                  : 1;
} stc_i2c_sr_field_t;

typedef struct
{
    __IO uint32_t STARTFCLR                 : 1;
    __IO uint32_t SLADDR0FCLR               : 1;
    __IO uint32_t SLADDR1FCLR               : 1;
    __IO uint32_t TENDFCLR                  : 1;
    __IO uint32_t STOPFCLR                  : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t RFULLFCLR                 : 1;
    __IO uint32_t TEMPTYFCLR                : 1;
    uint32_t RESERVED8                      : 1;
    __IO uint32_t ARLOFCLR                  : 1;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t NACKFCLR                  : 1;
    uint32_t RESERVED13                     : 1;
    __IO uint32_t TMOUTFCLR                 : 1;
    uint32_t RESERVED15                     : 5;
    __IO uint32_t GENCALLFCLR               : 1;
    __IO uint32_t SMBDEFAULTFCLR            : 1;
    __IO uint32_t SMBHOSTFCLR               : 1;
    __IO uint32_t SMBALRTFCLR               : 1;
} stc_i2c_clr_field_t;

typedef struct
{
    __IO uint32_t DT                        : 8;
} stc_i2c_dtr_field_t;

typedef struct
{
    __IO uint32_t DR                        : 8;
} stc_i2c_drr_field_t;

typedef struct
{
    __IO uint32_t SLOWW                     : 5;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t SHIGHW                    : 5;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t FREQ                      : 3;
} stc_i2c_ccr_field_t;

typedef struct
{
    __IO uint32_t DNF                       : 2;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t DNFEN                     : 1;
    __IO uint32_t ANFEN                     : 1;
} stc_i2c_fltr_field_t;

typedef struct
{
    __IO uint32_t TXE                       : 1;
    __IO uint32_t TXIE                      : 1;
    __IO uint32_t RXE                       : 1;
    __IO uint32_t RXIE                      : 1;
    __IO uint32_t EIE                       : 1;
    __IO uint32_t WMS                       : 1;
    __IO uint32_t ODD                       : 1;
    __IO uint32_t MCKOE                     : 1;
    __IO uint32_t TXBIRQWL                  : 3;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t RXBIRQWL                  : 3;
    uint32_t RESERVED15                     : 1;
    __IO uint32_t FIFOR                     : 1;
    __IO uint32_t CODECRC                   : 1;
    __IO uint32_t I2SPLLSEL                 : 1;
    __IO uint32_t SDOE                      : 1;
    __IO uint32_t LRCKOE                    : 1;
    __IO uint32_t CKOE                      : 1;
    __IO uint32_t DUPLEX                    : 1;
    __IO uint32_t CLKSEL                    : 1;
} stc_i2s_ctrl_field_t;

typedef struct
{
    __IO uint32_t TXBA                      : 1;
    __IO uint32_t RXBA                      : 1;
    __IO uint32_t TXBE                      : 1;
    __IO uint32_t TXBUF                     : 1;
    __IO uint32_t RXBE                      : 1;
    __IO uint32_t RXBUF                     : 1;
} stc_i2s_sr_field_t;

typedef struct
{
    __IO uint32_t TXERR                     : 1;
    __IO uint32_t RXERR                     : 1;
} stc_i2s_er_field_t;

typedef struct
{
    __IO uint32_t I2SSTD                    : 2;
    __IO uint32_t DATLEN                    : 2;
    __IO uint32_t CHLEN                     : 1;
    __IO uint32_t PCMSYNC                   : 1;
} stc_i2s_cfgr_field_t;

typedef struct
{
    __IO uint32_t I2SDIV                    : 8;
} stc_i2s_pr_field_t;

typedef struct
{
    __IO uint32_t SWDTAUTS                  : 1;
    __IO uint32_t SWDTITS                   : 1;
    __IO uint32_t SWDTPERI                  : 2;
    __IO uint32_t SWDTCKS                   : 4;
    __IO uint32_t SWDTWDPT                  : 4;
    __IO uint32_t SWDTSLPOFF                : 1;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t WDTAUTS                   : 1;
    __IO uint32_t WDTITS                    : 1;
    __IO uint32_t WDTPERI                   : 2;
    __IO uint32_t WDTCKS                    : 4;
    __IO uint32_t WDTWDPT                   : 4;
    __IO uint32_t WDTSLPOFF                 : 1;
} stc_icg_icg0_field_t;

typedef struct
{
    __IO uint32_t HRCFREQSEL                : 1;
    uint32_t RESERVED1                      : 7;
    __IO uint32_t HRCSTOP                   : 1;
    uint32_t RESERVED9                      : 7;
    __IO uint32_t BOR_LEV                   : 2;
    __IO uint32_t BORDIS                    : 1;
    uint32_t RESERVED19                     : 7;
    __IO uint32_t SMPCLK                    : 2;
    __IO uint32_t NMITRG                    : 1;
    __IO uint32_t NMIENR                    : 1;
    __IO uint32_t NFEN                      : 1;
    __IO uint32_t NMIICGENA                 : 1;
} stc_icg_icg1_field_t;

typedef struct
{
    __IO uint32_t NMITRG                    : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t NSMPCLK                   : 2;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t NFEN                      : 1;
} stc_intc_nmicr_field_t;

typedef struct
{
    __IO uint32_t NMIENR                    : 1;
    __IO uint32_t SWDTENR                   : 1;
    __IO uint32_t PVD1ENR                   : 1;
    __IO uint32_t PVD2ENR                   : 1;
    __IO uint32_t XTAL32STPENR              : 1;
    __IO uint32_t XTALSTPENR                : 1;
    uint32_t RESERVED6                      : 2;
    __IO uint32_t REPENR                    : 1;
    __IO uint32_t RECCENR                   : 1;
    __IO uint32_t BUSMENR                   : 1;
    __IO uint32_t WDTENR                    : 1;
} stc_intc_nmienr_field_t;

