CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
typedef struct
{
    __IO uint32_t RAMHS                     : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t RAM0                      : 1;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t ECCRAM                    : 1;
    uint32_t RESERVED9                      : 1;
    __IO uint32_t RETRAM                    : 1;
    uint32_t RESERVED11                     : 3;
    __IO uint32_t DMA1                      : 1;
    __IO uint32_t DMA2                      : 1;
    __IO uint32_t FCM                       : 1;
    __IO uint32_t AOS                       : 1;
    uint32_t RESERVED18                     : 2;
    __IO uint32_t AES                       : 1;
    __IO uint32_t HASH                      : 1;
    __IO uint32_t TRNG                      : 1;
    __IO uint32_t CRC                       : 1;
    __IO uint32_t DCU1                      : 1;
    __IO uint32_t DCU2                      : 1;
    __IO uint32_t DCU3                      : 1;
    __IO uint32_t DCU4                      : 1;
    uint32_t RESERVED28                     : 3;
    __IO uint32_t KEY                       : 1;
} stc_mstp_fcg0_field_t;

typedef struct
{
    __IO uint32_t CAN                       : 1;
    uint32_t RESERVED1                      : 2;
    __IO uint32_t QSPI                      : 1;
    __IO uint32_t IIC1                      : 1;
    __IO uint32_t IIC2                      : 1;
    __IO uint32_t IIC3                      : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t USBFS                     : 1;
    uint32_t RESERVED9                      : 1;
    __IO uint32_t SDIOC1                    : 1;
    __IO uint32_t SDIOC2                    : 1;
    __IO uint32_t I2S1                      : 1;
    __IO uint32_t I2S2                      : 1;
    __IO uint32_t I2S3                      : 1;
    __IO uint32_t I2S4                      : 1;
    __IO uint32_t SPI1                      : 1;
    __IO uint32_t SPI2                      : 1;
    __IO uint32_t SPI3                      : 1;
    __IO uint32_t SPI4                      : 1;
    uint32_t RESERVED20                     : 4;
    __IO uint32_t USART1                    : 1;
    __IO uint32_t USART2                    : 1;
    __IO uint32_t USART3                    : 1;
    __IO uint32_t USART4                    : 1;
} stc_mstp_fcg1_field_t;

typedef struct
{
    __IO uint32_t TIMER0_1                  : 1;
    __IO uint32_t TIMER0_2                  : 1;
    __IO uint32_t TIMERA_1                  : 1;
    __IO uint32_t TIMERA_2                  : 1;
    __IO uint32_t TIMERA_3                  : 1;
    __IO uint32_t TIMERA_4                  : 1;
    __IO uint32_t TIMERA_5                  : 1;
    __IO uint32_t TIMERA_6                  : 1;
    __IO uint32_t TIMER4_1                  : 1;
    __IO uint32_t TIMER4_2                  : 1;
    __IO uint32_t TIMER4_3                  : 1;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t EMB                       : 1;
    __IO uint32_t TIMER6_1                  : 1;
    __IO uint32_t TIMER6_2                  : 1;
    __IO uint32_t TIMER6_3                  : 1;
} stc_mstp_fcg2_field_t;

typedef struct
{
    __IO uint32_t ADC1                      : 1;
    __IO uint32_t ADC2                      : 1;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t DAC                       : 1;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t CMP                       : 1;
    uint32_t RESERVED9                      : 3;
    __IO uint32_t OTS                       : 1;
} stc_mstp_fcg3_field_t;

typedef struct
{
    __IO uint32_t PRT0                      : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t FCG0PCWE                  :16;
} stc_mstp_fcg0pc_field_t;

typedef struct
{
    __IO uint16_t OTSST                     : 1;
    __IO uint16_t OTSCK                     : 1;
    __IO uint16_t OTSIE                     : 1;
    __IO uint16_t TSSTP                     : 1;
} stc_ots_ctl_field_t;

typedef struct
{
    __IO uint16_t TSDC0                     : 1;
    __IO uint16_t TSDC1                     : 1;
    __IO uint16_t TSDC2                     : 1;
    __IO uint16_t TSDC3                     : 1;
    __IO uint16_t TSDC4                     : 1;
    __IO uint16_t TSDC5                     : 1;
    __IO uint16_t TSDC6                     : 1;
    __IO uint16_t TSDC7                     : 1;
    __IO uint16_t TSDC8                     : 1;
    __IO uint16_t TSDC9                     : 1;
    __IO uint16_t TSDC10                    : 1;
    __IO uint16_t TSDC11                    : 1;
    __IO uint16_t TSDC12                    : 1;
    __IO uint16_t TSDC13                    : 1;
    __IO uint16_t TSDC14                    : 1;
    __IO uint16_t TSDC15                    : 1;
} stc_ots_dr1_field_t;

typedef struct
{
    __IO uint16_t TSDC0                     : 1;
    __IO uint16_t TSDC1                     : 1;
    __IO uint16_t TSDC2                     : 1;
    __IO uint16_t TSDC3                     : 1;
    __IO uint16_t TSDC4                     : 1;
    __IO uint16_t TSDC5                     : 1;
    __IO uint16_t TSDC6                     : 1;
    __IO uint16_t TSDC7                     : 1;
    __IO uint16_t TSDC8                     : 1;
    __IO uint16_t TSDC9                     : 1;
    __IO uint16_t TSDC10                    : 1;
    __IO uint16_t TSDC11                    : 1;
    __IO uint16_t TSDC12                    : 1;
    __IO uint16_t TSDC13                    : 1;
    __IO uint16_t TSDC14                    : 1;
    __IO uint16_t TSDC15                    : 1;
} stc_ots_dr2_field_t;

typedef struct
{
    __IO uint16_t TSEC0                     : 1;
    __IO uint16_t TSEC1                     : 1;
    __IO uint16_t TSEC2                     : 1;
    __IO uint16_t TSEC3                     : 1;
    __IO uint16_t TSEC4                     : 1;
    __IO uint16_t TSEC5                     : 1;
    __IO uint16_t TSEC6                     : 1;
    __IO uint16_t TSEC7                     : 1;
    __IO uint16_t TSEC8                     : 1;
    __IO uint16_t TSEC9                     : 1;
    __IO uint16_t TSEC10                    : 1;
    __IO uint16_t TSEC11                    : 1;
    __IO uint16_t TSEC12                    : 1;
    __IO uint16_t TSEC13                    : 1;
    __IO uint16_t TSEC14                    : 1;
    __IO uint16_t TSEC15                    : 1;
} stc_ots_ecr_field_t;

typedef struct
{
    __IO uint32_t TSOFS                     : 8;
    __IO uint32_t TSSLP                     :24;
} stc_ots_lpr_field_t;

typedef struct
{
    __IO uint32_t DFB                       : 1;
    __IO uint32_t SOFEN                     : 1;
} stc_peric_usbfs_syctlreg_field_t;

typedef struct
{
    __IO uint32_t ABINT1                    : 1;
    __IO uint32_t SELMMC1                   : 1;
    __IO uint32_t ABINT2                    : 1;
    __IO uint32_t SELMMC2                   : 1;
} stc_peric_sdioc_syctlreg_field_t;

typedef struct
{
    __IO uint16_t PIN00                     : 1;
    __IO uint16_t PIN01                     : 1;
    __IO uint16_t PIN02                     : 1;
    __IO uint16_t PIN03                     : 1;
    __IO uint16_t PIN04                     : 1;
    __IO uint16_t PIN05                     : 1;
    __IO uint16_t PIN06                     : 1;
    __IO uint16_t PIN07                     : 1;
    __IO uint16_t PIN08                     : 1;
    __IO uint16_t PIN09                     : 1;
    __IO uint16_t PIN10                     : 1;
    __IO uint16_t PIN11                     : 1;
    __IO uint16_t PIN12                     : 1;
    __IO uint16_t PIN13                     : 1;
    __IO uint16_t PIN14                     : 1;
    __IO uint16_t PIN15                     : 1;
} stc_port_pidr_field_t;

typedef struct
{
    __IO uint16_t POUT00                    : 1;
    __IO uint16_t POUT01                    : 1;
    __IO uint16_t POUT02                    : 1;
    __IO uint16_t POUT03                    : 1;
    __IO uint16_t POUT04                    : 1;
    __IO uint16_t POUT05                    : 1;
    __IO uint16_t POUT06                    : 1;
    __IO uint16_t POUT07                    : 1;
    __IO uint16_t POUT08                    : 1;
    __IO uint16_t POUT09                    : 1;
    __IO uint16_t POUT10                    : 1;
    __IO uint16_t POUT11                    : 1;
    __IO uint16_t POUT12                    : 1;
    __IO uint16_t POUT13                    : 1;
    __IO uint16_t POUT14                    : 1;
    __IO uint16_t POUT15                    : 1;
} stc_port_podr_field_t;

typedef struct
{
    __IO uint16_t POUTE00                   : 1;
    __IO uint16_t POUTE01                   : 1;
    __IO uint16_t POUTE02                   : 1;
    __IO uint16_t POUTE03                   : 1;
    __IO uint16_t POUTE04                   : 1;
    __IO uint16_t POUTE05                   : 1;
    __IO uint16_t POUTE06                   : 1;
    __IO uint16_t POUTE07                   : 1;
    __IO uint16_t POUTE08                   : 1;
    __IO uint16_t POUTE09                   : 1;
    __IO uint16_t POUTE10                   : 1;
    __IO uint16_t POUTE11                   : 1;
    __IO uint16_t POUTE12                   : 1;
    __IO uint16_t POUTE13                   : 1;
    __IO uint16_t POUTE14                   : 1;
    __IO uint16_t POUTE15                   : 1;
} stc_port_poer_field_t;

typedef struct
{
    __IO uint16_t POS00                     : 1;
    __IO uint16_t POS01                     : 1;
    __IO uint16_t POS02                     : 1;
    __IO uint16_t POS03                     : 1;
    __IO uint16_t POS04                     : 1;
    __IO uint16_t POS05                     : 1;
    __IO uint16_t POS06                     : 1;
    __IO uint16_t POS07                     : 1;
    __IO uint16_t POS08                     : 1;
    __IO uint16_t POS09                     : 1;
    __IO uint16_t POS10                     : 1;
    __IO uint16_t POS11                     : 1;
    __IO uint16_t POS12                     : 1;
    __IO uint16_t POS13                     : 1;
    __IO uint16_t POS14                     : 1;
    __IO uint16_t POS15                     : 1;
} stc_port_posr_field_t;

typedef struct
{
    __IO uint16_t POR00                     : 1;
    __IO uint16_t POR01                     : 1;
    __IO uint16_t POR02                     : 1;
    __IO uint16_t POR03                     : 1;
    __IO uint16_t POR04                     : 1;
    __IO uint16_t POR05                     : 1;
    __IO uint16_t POR06                     : 1;
    __IO uint16_t POR07                     : 1;
    __IO uint16_t POR08                     : 1;
    __IO uint16_t POR09                     : 1;
    __IO uint16_t POR10                     : 1;
    __IO uint16_t POR11                     : 1;
    __IO uint16_t POR12                     : 1;
    __IO uint16_t POR13                     : 1;
    __IO uint16_t POR14                     : 1;
    __IO uint16_t POR15                     : 1;
} stc_port_porr_field_t;

typedef struct
{
    __IO uint16_t POT00                     : 1;
    __IO uint16_t POT01                     : 1;
    __IO uint16_t POT02                     : 1;
    __IO uint16_t POT03                     : 1;
    __IO uint16_t POT04                     : 1;
    __IO uint16_t POT05                     : 1;
    __IO uint16_t POT06                     : 1;
    __IO uint16_t POT07                     : 1;
    __IO uint16_t POT08                     : 1;
    __IO uint16_t POT09                     : 1;
    __IO uint16_t POT10                     : 1;
    __IO uint16_t POT11                     : 1;
    __IO uint16_t POT12                     : 1;
    __IO uint16_t POT13                     : 1;
    __IO uint16_t POT14                     : 1;
    __IO uint16_t POT15                     : 1;
} stc_port_potr_field_t;

typedef struct
{
    __IO uint16_t PIN00                     : 1;
    __IO uint16_t PIN01                     : 1;
    __IO uint16_t PIN02                     : 1;
} stc_port_pidrh_field_t;

typedef struct
{
    __IO uint16_t POUT00                    : 1;
    __IO uint16_t POUT01                    : 1;
    __IO uint16_t POUT02                    : 1;
} stc_port_podrh_field_t;

typedef struct
{
    __IO uint16_t POUTE00                   : 1;
    __IO uint16_t POUTE01                   : 1;
    __IO uint16_t POUTE02                   : 1;
} stc_port_poerh_field_t;

typedef struct
{
    __IO uint16_t POS00                     : 1;
    __IO uint16_t POS01                     : 1;
    __IO uint16_t POS02                     : 1;
} stc_port_posrh_field_t;

typedef struct
{
    __IO uint16_t POR00                     : 1;
    __IO uint16_t POR01                     : 1;
    __IO uint16_t POR02                     : 1;
} stc_port_porrh_field_t;

typedef struct
{
    __IO uint16_t POT00                     : 1;
    __IO uint16_t POT01                     : 1;
    __IO uint16_t POT02                     : 1;
} stc_port_potrh_field_t;

typedef struct
{
    __IO uint16_t SPFE                      : 5;
} stc_port_pspcr_field_t;

typedef struct
{
    __IO uint16_t BFSEL                     : 4;
    uint16_t RESERVED4                      :10;
    __IO uint16_t RDWT                      : 2;
} stc_port_pccr_field_t;

typedef struct
{
    __IO uint16_t PINAE                     : 6;
} stc_port_pinaer_field_t;

typedef struct
{
    __IO uint16_t WE                        : 1;
    uint16_t RESERVED1                      : 7;
    __IO uint16_t WP                        : 8;
} stc_port_pwpr_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 1;
    __IO uint16_t LTE                       : 1;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 6;
    uint16_t RESERVED6                      : 2;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr_field_t;

typedef struct
{
    __IO uint32_t MDSEL                     : 3;
    __IO uint32_t PFE                       : 1;
    __IO uint32_t PFSAE                     : 1;
    __IO uint32_t DCOME                     : 1;
    __IO uint32_t XIPE                      : 1;
    __IO uint32_t SPIMD3                    : 1;
    __IO uint32_t IPRSL                     : 2;
    __IO uint32_t APRSL                     : 2;
    __IO uint32_t DPRSL                     : 2;
    uint32_t RESERVED14                     : 2;
    __IO uint32_t DIV                       : 6;
} stc_qspi_cr_field_t;

typedef struct
{
    __IO uint32_t SSHW                      : 4;
    __IO uint32_t SSNW                      : 2;
} stc_qspi_cscr_field_t;

typedef struct
{
    __IO uint32_t AWSL                      : 2;
    __IO uint32_t FOUR_BIC                  : 1;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t SSNHD                     : 1;
    __IO uint32_t SSNLD                     : 1;
    __IO uint32_t WPOL                      : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t DMCYCN                    : 4;
    uint32_t RESERVED12                     : 3;
    __IO uint32_t DUTY                      : 1;
} stc_qspi_fcr_field_t;

typedef struct
{
    __IO uint32_t BUSY                      : 1;
    uint32_t RESERVED1                      : 5;
    __IO uint32_t XIPF                      : 1;
    __IO uint32_t RAER                      : 1;
    __IO uint32_t PFNUM                     : 5;
    uint32_t RESERVED13                     : 1;
    __IO uint32_t PFFUL                     : 1;
    __IO uint32_t PFAN                      : 1;
} stc_qspi_sr_field_t;

typedef struct
{
    __IO uint32_t DCOM                      : 8;
} stc_qspi_dcom_field_t;

typedef struct
{
    __IO uint32_t RIC                       : 8;
} stc_qspi_ccmd_field_t;

typedef struct
{
    __IO uint32_t XIPMC                     : 8;
} stc_qspi_xcmd_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 7;
    __IO uint32_t RAERCLR                   : 1;
} stc_qspi_sr2_field_t;

typedef struct
{
    uint32_t RESERVED0                      :26;
    __IO uint32_t EXADR                     : 6;
} stc_qspi_exar_field_t;

typedef struct
{
    __IO uint32_t RESET                     : 1;
} stc_rtc_cr0_field_t;

typedef struct
{
    __IO uint32_t PRDS                      : 3;
    __IO uint32_t AMPM                      : 1;
    __IO uint32_t ALMFCLR                   : 1;
    __IO uint32_t ONEHZOE                   : 1;
    __IO uint32_t ONEHZSEL                  : 1;
    __IO uint32_t START                     : 1;
} stc_rtc_cr1_field_t;

typedef struct
{
    __IO uint32_t WAIT                      : 1;
    __IO uint32_t WAITF                     : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t ALMF                      : 1;
    uint32_t RESERVED4                      : 1;
    __IO uint32_t PRDIE                     : 1;
    __IO uint32_t ALMIE                     : 1;
    __IO uint32_t ALME                      : 1;
} stc_rtc_cr2_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 4;
    __IO uint32_t LRCEN                     : 1;
    uint32_t RESERVED5                      : 2;
    __IO uint32_t RCKSEL                    : 1;
} stc_rtc_cr3_field_t;

typedef struct
{
    __IO uint32_t SECU                      : 4;
    __IO uint32_t SECD                      : 3;
} stc_rtc_sec_field_t;

typedef struct
{
    __IO uint32_t MINU                      : 4;
    __IO uint32_t MIND                      : 3;
} stc_rtc_min_field_t;

typedef struct
{
    __IO uint32_t HOURU                     : 4;
    __IO uint32_t HOURD                     : 2;
} stc_rtc_hour_field_t;

typedef struct
{
    __IO uint32_t WEEK                      : 3;
} stc_rtc_week_field_t;

typedef struct
{
    __IO uint32_t DAYU                      : 4;
    __IO uint32_t DAYD                      : 2;
} stc_rtc_day_field_t;

typedef struct
{
    __IO uint32_t MON                       : 5;
} stc_rtc_mon_field_t;

typedef struct
{
    __IO uint32_t YEARU                     : 4;
    __IO uint32_t YEARD                     : 4;
} stc_rtc_year_field_t;

typedef struct
{
    __IO uint32_t ALMMINU                   : 4;
    __IO uint32_t ALMMIND                   : 3;
} stc_rtc_almmin_field_t;

typedef struct
{
    __IO uint32_t ALMHOURU                  : 4;
    __IO uint32_t ALMHOURD                  : 2;
} stc_rtc_almhour_field_t;

typedef struct
{
    __IO uint32_t ALMWEEK                   : 7;
} stc_rtc_almweek_field_t;

typedef struct
{
    __IO uint32_t COMP8                     : 1;
    uint32_t RESERVED1                      : 6;
    __IO uint32_t COMPEN                    : 1;
} stc_rtc_errcrh_field_t;

typedef struct
{
    __IO uint32_t COMP                      : 8;
} stc_rtc_errcrl_field_t;

typedef struct
{
    __IO uint16_t TBS                       :12;
} stc_sdioc_blksize_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 1;
    __IO uint16_t BCE                       : 1;
    __IO uint16_t ATCEN                     : 2;
    __IO uint16_t DDIR                      : 1;
    __IO uint16_t MULB                      : 1;
} stc_sdioc_transmode_field_t;

typedef struct
{
    __IO uint16_t RESTYP                    : 2;
    uint16_t RESERVED2                      : 1;
    __IO uint16_t CCE                       : 1;
    __IO uint16_t ICE                       : 1;
    __IO uint16_t DAT                       : 1;
    __IO uint16_t TYP                       : 2;
    __IO uint16_t IDX                       : 6;
} stc_sdioc_cmd_field_t;

typedef struct
{
    __IO uint32_t CIC                       : 1;
    __IO uint32_t CID                       : 1;
    __IO uint32_t DA                        : 1;
    uint32_t RESERVED3                      : 5;
    __IO uint32_t WTA                       : 1;
    __IO uint32_t RTA                       : 1;
    __IO uint32_t BWE                       : 1;
    __IO uint32_t BRE                       : 1;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t CIN                       : 1;
    __IO uint32_t CSS                       : 1;
    __IO uint32_t CDL                       : 1;
    __IO uint32_t WPL                       : 1;
    __IO uint32_t DATL                      : 4;
    __IO uint32_t CMDL                      : 1;
} stc_sdioc_pstat_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 1;
    __IO uint8_t DW                         : 1;
    __IO uint8_t HSEN                       : 1;
    uint8_t RESERVED3                       : 2;
    __IO uint8_t EXDW                       : 1;
    __IO uint8_t CDTL                       : 1;
    __IO uint8_t CDSS                       : 1;
} stc_sdioc_hostcon_field_t;

typedef struct
{
    __IO uint8_t PWON                       : 1;
} stc_sdioc_pwrcon_field_t;

typedef struct
{
    __IO uint8_t SABGR                      : 1;
    __IO uint8_t CR                         : 1;
    __IO uint8_t RWC                        : 1;
    __IO uint8_t IABG                       : 1;
} stc_sdioc_blkgpcon_field_t;

typedef struct
{
    __IO uint16_t ICE                       : 1;
    uint16_t RESERVED1                      : 1;
    __IO uint16_t CE                        : 1;
    uint16_t RESERVED3                      : 5;
    __IO uint16_t FS                        : 8;
} stc_sdioc_clkcon_field_t;

typedef struct
{
    __IO uint8_t DTO                        : 4;
} stc_sdioc_toutcon_field_t;

typedef struct
{
    __IO uint8_t RSTA                       : 1;
    __IO uint8_t RSTC                       : 1;
    __IO uint8_t RSTD                       : 1;
} stc_sdioc_sftrst_field_t;

typedef struct
{
    __IO uint16_t CC                        : 1;
    __IO uint16_t TC                        : 1;
    __IO uint16_t BGE                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t BWR                       : 1;
    __IO uint16_t BRR                       : 1;
    __IO uint16_t CIST                      : 1;
    __IO uint16_t CRM                       : 1;
    __IO uint16_t CINT                      : 1;
    uint16_t RESERVED9                      : 6;
    __IO uint16_t EI                        : 1;
} stc_sdioc_norintst_field_t;

typedef struct
{
    __IO uint16_t CTOE                      : 1;
    __IO uint16_t CCE                       : 1;
    __IO uint16_t CEBE                      : 1;
    __IO uint16_t CIE                       : 1;
    __IO uint16_t DTOE                      : 1;
    __IO uint16_t DCE                       : 1;
    __IO uint16_t DEBE                      : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t ACE                       : 1;
} stc_sdioc_errintst_field_t;

typedef struct
{
    __IO uint16_t CCEN                      : 1;
    __IO uint16_t TCEN                      : 1;
    __IO uint16_t BGEEN                     : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t BWREN                     : 1;
    __IO uint16_t BRREN                     : 1;
    __IO uint16_t CISTEN                    : 1;
    __IO uint16_t CRMEN                     : 1;
    __IO uint16_t CINTEN                    : 1;
} stc_sdioc_norintsten_field_t;

