CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
typedef struct
{
    __IO uint16_t CTOEEN                    : 1;
    __IO uint16_t CCEEN                     : 1;
    __IO uint16_t CEBEEN                    : 1;
    __IO uint16_t CIEEN                     : 1;
    __IO uint16_t DTOEEN                    : 1;
    __IO uint16_t DCEEN                     : 1;
    __IO uint16_t DEBEEN                    : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t ACEEN                     : 1;
} stc_sdioc_errintsten_field_t;

typedef struct
{
    __IO uint16_t CCSEN                     : 1;
    __IO uint16_t TCSEN                     : 1;
    __IO uint16_t BGESEN                    : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t BWRSEN                    : 1;
    __IO uint16_t BRRSEN                    : 1;
    __IO uint16_t CISTSEN                   : 1;
    __IO uint16_t CRMSEN                    : 1;
    __IO uint16_t CINTSEN                   : 1;
} stc_sdioc_norintsgen_field_t;

typedef struct
{
    __IO uint16_t CTOESEN                   : 1;
    __IO uint16_t CCESEN                    : 1;
    __IO uint16_t CEBESEN                   : 1;
    __IO uint16_t CIESEN                    : 1;
    __IO uint16_t DTOESEN                   : 1;
    __IO uint16_t DCESEN                    : 1;
    __IO uint16_t DEBESEN                   : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t ACESEN                    : 1;
} stc_sdioc_errintsgen_field_t;

typedef struct
{
    __IO uint16_t NE                        : 1;
    __IO uint16_t TOE                       : 1;
    __IO uint16_t CE                        : 1;
    __IO uint16_t EBE                       : 1;
    __IO uint16_t IE                        : 1;
    uint16_t RESERVED5                      : 2;
    __IO uint16_t CMDE                      : 1;
} stc_sdioc_atcerrst_field_t;

typedef struct
{
    __IO uint16_t FNE                       : 1;
    __IO uint16_t FTOE                      : 1;
    __IO uint16_t FCE                       : 1;
    __IO uint16_t FEBE                      : 1;
    __IO uint16_t FIE                       : 1;
    uint16_t RESERVED5                      : 2;
    __IO uint16_t FCMDE                     : 1;
} stc_sdioc_fea_field_t;

typedef struct
{
    __IO uint16_t FCTOE                     : 1;
    __IO uint16_t FCCE                      : 1;
    __IO uint16_t FCEBE                     : 1;
    __IO uint16_t FCIE                      : 1;
    __IO uint16_t FDTOE                     : 1;
    __IO uint16_t FDCE                      : 1;
    __IO uint16_t FDEBE                     : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t FACE                      : 1;
} stc_sdioc_fee_field_t;

typedef struct
{
    __IO uint32_t SPIMDS                    : 1;
    __IO uint32_t TXMDS                     : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t MSTR                      : 1;
    __IO uint32_t SPLPBK                    : 1;
    __IO uint32_t SPLPBK2                   : 1;
    __IO uint32_t SPE                       : 1;
    __IO uint32_t CSUSPE                    : 1;
    __IO uint32_t EIE                       : 1;
    __IO uint32_t TXIE                      : 1;
    __IO uint32_t RXIE                      : 1;
    __IO uint32_t IDIE                      : 1;
    __IO uint32_t MODFE                     : 1;
    __IO uint32_t PATE                      : 1;
    __IO uint32_t PAOE                      : 1;
    __IO uint32_t PAE                       : 1;
} stc_spi_cr1_field_t;

typedef struct
{
    __IO uint32_t FTHLV                     : 2;
    uint32_t RESERVED2                      : 4;
    __IO uint32_t SPRDTD                    : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t SS0PV                     : 1;
    __IO uint32_t SS1PV                     : 1;
    __IO uint32_t SS2PV                     : 1;
    __IO uint32_t SS3PV                     : 1;
    uint32_t RESERVED12                     : 8;
    __IO uint32_t MSSI                      : 3;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t MSSDL                     : 3;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t MIDI                      : 3;
} stc_spi_cfg1_field_t;

typedef struct
{
    __IO uint32_t OVRERF                    : 1;
    __IO uint32_t IDLNF                     : 1;
    __IO uint32_t MODFERF                   : 1;
    __IO uint32_t PERF                      : 1;
    __IO uint32_t UDRERF                    : 1;
    __IO uint32_t TDEF                      : 1;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t RDFF                      : 1;
} stc_spi_sr_field_t;

typedef struct
{
    __IO uint32_t CPHA                      : 1;
    __IO uint32_t CPOL                      : 1;
    __IO uint32_t MBR                       : 3;
    __IO uint32_t SSA                       : 3;
    __IO uint32_t DSIZE                     : 4;
    __IO uint32_t LSBF                      : 1;
    __IO uint32_t NXTDLE                    : 1;
    __IO uint32_t SSDLE                     : 1;
    __IO uint32_t SCKDLE                    : 1;
} stc_spi_cfg2_field_t;

typedef struct
{
    __IO uint32_t SRAMSYSRWT                : 3;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t SRAMSYSWWT                : 3;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t SRAMECCRWT                : 3;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t SRAMECCWWT                : 3;
    uint32_t RESERVED15                     : 1;
    __IO uint32_t SRAMHSRWT                 : 3;
    uint32_t RESERVED19                     : 1;
    __IO uint32_t SRAMHSWWT                 : 3;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t SRAMBKRWT                 : 3;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t SRAMBKWWT                 : 3;
} stc_sramc_wtcr_field_t;

typedef struct
{
    __IO uint32_t WTPRC                     : 1;
    __IO uint32_t WTPRKW                    : 7;
} stc_sramc_wtpr_field_t;

typedef struct
{
    __IO uint32_t PYOAD                     : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t ECCOAD                    : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t ECCMOD                    : 2;
} stc_sramc_ckcr_field_t;

typedef struct
{
    __IO uint32_t CKPRC                     : 1;
    __IO uint32_t CKPRKW                    : 7;
} stc_sramc_ckpr_field_t;

typedef struct
{
    __IO uint32_t SRAMECC1ERR               : 1;
    __IO uint32_t SRAMECC2ERR               : 1;
    __IO uint32_t SRAMSYSPYERR              : 1;
    __IO uint32_t SRAMHSPYERR               : 1;
    __IO uint32_t SRAMBKPYERR               : 1;
} stc_sramc_cksr_field_t;

typedef struct
{
    __IO uint32_t CNT                       :16;
    __IO uint32_t UDF                       : 1;
    __IO uint32_t REF                       : 1;
} stc_swdt_sr_field_t;

typedef struct
{
    __IO uint32_t RF                        :16;
} stc_swdt_rr_field_t;

typedef struct
{
    __IO uint16_t FLNWT                     : 1;
    __IO uint16_t CKSMRC                    : 1;
    uint16_t RESERVED2                      :13;
    __IO uint16_t STOP                      : 1;
} stc_sysreg_pwr_stpmcr_field_t;

typedef struct
{
    __IO uint16_t PERICKSEL                 : 4;
} stc_sysreg_cmu_pericksel_field_t;

typedef struct
{
    __IO uint16_t I2S1CKSEL                 : 4;
    __IO uint16_t I2S2CKSEL                 : 4;
    __IO uint16_t I2S3CKSEL                 : 4;
    __IO uint16_t I2S4CKSEL                 : 4;
} stc_sysreg_cmu_i2scksel_field_t;

typedef struct
{
    __IO uint32_t RAMPDC0                   : 1;
    __IO uint32_t RAMPDC1                   : 1;
    __IO uint32_t RAMPDC2                   : 1;
    __IO uint32_t RAMPDC3                   : 1;
    __IO uint32_t RAMPDC4                   : 1;
    __IO uint32_t RAMPDC5                   : 1;
    __IO uint32_t RAMPDC6                   : 1;
    __IO uint32_t RAMPDC7                   : 1;
    __IO uint32_t RAMPDC8                   : 1;
} stc_sysreg_pwr_rampc0_field_t;

typedef struct
{
    __IO uint32_t RAMOPM                    :16;
} stc_sysreg_pwr_ramopm_field_t;

typedef struct
{
    __IO uint32_t AESRDP                    : 1;
    __IO uint32_t AESWRP                    : 1;
    __IO uint32_t HASHRDP                   : 1;
    __IO uint32_t HASHWRP                   : 1;
    __IO uint32_t TRNGRDP                   : 1;
    __IO uint32_t TRNGWRP                   : 1;
    __IO uint32_t CRCRDP                    : 1;
    __IO uint32_t CRCWRP                    : 1;
    __IO uint32_t FMCRDP                    : 1;
    __IO uint32_t FMCWRP                    : 1;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t WDTRDP                    : 1;
    __IO uint32_t WDTWRP                    : 1;
    __IO uint32_t SWDTRDP                   : 1;
    __IO uint32_t SWDTWRP                   : 1;
    __IO uint32_t BKSRAMRDP                 : 1;
    __IO uint32_t BKSRAMWRP                 : 1;
    __IO uint32_t RTCRDP                    : 1;
    __IO uint32_t RTCWRP                    : 1;
    __IO uint32_t DMPURDP                   : 1;
    __IO uint32_t DMPUWRP                   : 1;
    __IO uint32_t SRAMCRDP                  : 1;
    __IO uint32_t SRAMCWRP                  : 1;
    __IO uint32_t INTCRDP                   : 1;
    __IO uint32_t INTCWRP                   : 1;
    __IO uint32_t SYSCRDP                   : 1;
    __IO uint32_t SYSCWRP                   : 1;
    __IO uint32_t MSTPRDP                   : 1;
    __IO uint32_t MSTPWRP                   : 1;
    uint32_t RESERVED30                     : 1;
    __IO uint32_t BUSERRE                   : 1;
} stc_sysreg_mpu_ippr_field_t;

typedef struct
{
    __IO uint32_t PCLK0S                    : 3;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t PCLK1S                    : 3;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t PCLK2S                    : 3;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t PCLK3S                    : 3;
    uint32_t RESERVED15                     : 1;
    __IO uint32_t PCLK4S                    : 3;
    uint32_t RESERVED19                     : 1;
    __IO uint32_t EXCKS                     : 3;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t HCLKS                     : 3;
} stc_sysreg_cmu_scfgr_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 4;
    __IO uint8_t USBCKS                     : 4;
} stc_sysreg_cmu_ufsckcfgr_field_t;

typedef struct
{
    __IO uint8_t CKSW                       : 3;
} stc_sysreg_cmu_ckswr_field_t;

typedef struct
{
    __IO uint8_t MPLLOFF                    : 1;
} stc_sysreg_cmu_pllcr_field_t;

typedef struct
{
    __IO uint8_t UPLLOFF                    : 1;
} stc_sysreg_cmu_upllcr_field_t;

typedef struct
{
    __IO uint8_t XTALSTP                    : 1;
} stc_sysreg_cmu_xtalcr_field_t;

typedef struct
{
    __IO uint8_t HRCSTP                     : 1;
} stc_sysreg_cmu_hrccr_field_t;

typedef struct
{
    __IO uint8_t MRCSTP                     : 1;
} stc_sysreg_cmu_mrccr_field_t;

typedef struct
{
    __IO uint8_t HRCSTBF                    : 1;
    uint8_t RESERVED1                       : 2;
    __IO uint8_t XTALSTBF                   : 1;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t MPLLSTBF                   : 1;
    __IO uint8_t UPLLSTBF                   : 1;
} stc_sysreg_cmu_oscstbsr_field_t;

typedef struct
{
    __IO uint8_t MCO1SEL                    : 4;
    __IO uint8_t MCO1DIV                    : 3;
    __IO uint8_t MCO1EN                     : 1;
} stc_sysreg_cmu_mco1cfgr_field_t;

typedef struct
{
    __IO uint8_t MCO2SEL                    : 4;
    __IO uint8_t MCO2DIV                    : 3;
    __IO uint8_t MCO2EN                     : 1;
} stc_sysreg_cmu_mco2cfgr_field_t;

typedef struct
{
    __IO uint8_t TPIUCKS                    : 2;
    uint8_t RESERVED2                       : 5;
    __IO uint8_t TPIUCKOE                   : 1;
} stc_sysreg_cmu_tpiuckcfgr_field_t;

typedef struct
{
    __IO uint8_t XTALSTDIE                  : 1;
    __IO uint8_t XTALSTDRE                  : 1;
    __IO uint8_t XTALSTDRIS                 : 1;
    uint8_t RESERVED3                       : 4;
    __IO uint8_t XTALSTDE                   : 1;
} stc_sysreg_cmu_xtalstdcr_field_t;

typedef struct
{
    __IO uint8_t XTALSTDF                   : 1;
} stc_sysreg_cmu_xtalstdsr_field_t;

typedef struct
{
    __IO uint8_t XTALSTB                    : 4;
} stc_sysreg_cmu_xtalstbcr_field_t;

typedef struct
{
    __IO uint16_t PORF                      : 1;
    __IO uint16_t PINRF                     : 1;
    __IO uint16_t BORF                      : 1;
    __IO uint16_t PVD1RF                    : 1;
    __IO uint16_t PVD2RF                    : 1;
    __IO uint16_t WDRF                      : 1;
    __IO uint16_t SWDRF                     : 1;
    __IO uint16_t PDRF                      : 1;
    __IO uint16_t SWRF                      : 1;
    __IO uint16_t MPUERF                    : 1;
    __IO uint16_t RAPERF                    : 1;
    __IO uint16_t RAECRF                    : 1;
    __IO uint16_t CKFERF                    : 1;
    __IO uint16_t XTALERF                   : 1;
    __IO uint16_t MULTIRF                   : 1;
    __IO uint16_t CLRF                      : 1;
} stc_sysreg_rmu_rstf0_field_t;

typedef struct
{
    __IO uint8_t PVD1NMIS                   : 1;
    uint8_t RESERVED1                       : 3;
    __IO uint8_t PVD2NMIS                   : 1;
} stc_sysreg_pwr_pvdicr_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 1;
    __IO uint8_t PVD1DETFLG                 : 1;
    uint8_t RESERVED2                       : 3;
    __IO uint8_t PVD2DETFLG                 : 1;
} stc_sysreg_pwr_pvddsr_field_t;

typedef struct
{
    __IO uint32_t MPLLM                     : 5;
    uint32_t RESERVED5                      : 2;
    __IO uint32_t PLLSRC                    : 1;
    __IO uint32_t MPLLN                     : 9;
    uint32_t RESERVED17                     : 3;
    __IO uint32_t MPLLR                     : 4;
    __IO uint32_t MPLLQ                     : 4;
    __IO uint32_t MPLLP                     : 4;
} stc_sysreg_cmu_pllcfgr_field_t;

typedef struct
{
    __IO uint32_t UPLLM                     : 5;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t UPLLN                     : 9;
    uint32_t RESERVED17                     : 3;
    __IO uint32_t UPLLR                     : 4;
    __IO uint32_t UPLLQ                     : 4;
    __IO uint32_t UPLLP                     : 4;
} stc_sysreg_cmu_upllcfgr_field_t;

typedef struct
{
    __IO uint16_t FPRCB0                    : 1;
    __IO uint16_t FPRCB1                    : 1;
    __IO uint16_t FPRCB2                    : 1;
    __IO uint16_t FPRCB3                    : 1;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t FPRCWE                    : 8;
} stc_sysreg_pwr_fprc_field_t;

typedef struct
{
    __IO uint8_t PDMDS                      : 2;
    __IO uint8_t VVDRSD                     : 1;
    __IO uint8_t RETRAMSD                   : 1;
    __IO uint8_t IORTN                      : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t PWDN                       : 1;
} stc_sysreg_pwr_pwrc0_field_t;

typedef struct
{
    __IO uint8_t VPLLSD                     : 1;
    __IO uint8_t VHRCSD                     : 1;
    uint8_t RESERVED2                       : 4;
    __IO uint8_t STPDAS                     : 2;
} stc_sysreg_pwr_pwrc1_field_t;

typedef struct
{
    __IO uint8_t DDAS                       : 4;
    __IO uint8_t DVS                        : 2;
} stc_sysreg_pwr_pwrc2_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 2;
    __IO uint8_t PDTS                       : 1;
} stc_sysreg_pwr_pwrc3_field_t;

typedef struct
{
    __IO uint8_t WKE00                      : 1;
    __IO uint8_t WKE01                      : 1;
    __IO uint8_t WKE02                      : 1;
    __IO uint8_t WKE03                      : 1;
    __IO uint8_t WKE10                      : 1;
    __IO uint8_t WKE11                      : 1;
    __IO uint8_t WKE12                      : 1;
    __IO uint8_t WKE13                      : 1;
} stc_sysreg_pwr_pdwke0_field_t;

typedef struct
{
    __IO uint8_t WKE20                      : 1;
    __IO uint8_t WKE21                      : 1;
    __IO uint8_t WKE22                      : 1;
    __IO uint8_t WKE23                      : 1;
    __IO uint8_t WKE30                      : 1;
    __IO uint8_t WKE31                      : 1;
    __IO uint8_t WKE32                      : 1;
    __IO uint8_t WKE33                      : 1;
} stc_sysreg_pwr_pdwke1_field_t;

typedef struct
{
    __IO uint8_t VD1WKE                     : 1;
    __IO uint8_t VD2WKE                     : 1;
    __IO uint8_t NMIWKE                     : 1;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t RTCPRDWKE                  : 1;
    __IO uint8_t RTCALMWKE                  : 1;
    __IO uint8_t XTAL32ERWKE                : 1;
    __IO uint8_t WKTMWKE                    : 1;
} stc_sysreg_pwr_pdwke2_field_t;

typedef struct
{
    __IO uint8_t WK0EGS                     : 1;
    __IO uint8_t WK1EGS                     : 1;
    __IO uint8_t WK2EGS                     : 1;
    __IO uint8_t WK3EGS                     : 1;
    __IO uint8_t VD1EGS                     : 1;
    __IO uint8_t VD2EGS                     : 1;
    __IO uint8_t NMIEGS                     : 1;
} stc_sysreg_pwr_pdwkes_field_t;

typedef struct
{
    __IO uint8_t PTWK0F                     : 1;
    __IO uint8_t PTWK1F                     : 1;
    __IO uint8_t PTWK2F                     : 1;
    __IO uint8_t PTWK3F                     : 1;
    __IO uint8_t VD1WKF                     : 1;
    __IO uint8_t VD2WKF                     : 1;
    __IO uint8_t NMIWKF                     : 1;
} stc_sysreg_pwr_pdwkf0_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 3;
    __IO uint8_t RXD0WKF                    : 1;
    __IO uint8_t RTCPRDWKF                  : 1;
    __IO uint8_t RTCALMWKF                  : 1;
    __IO uint8_t XTAL32ERWKF                : 1;
    __IO uint8_t WKTMWKF                    : 1;
} stc_sysreg_pwr_pdwkf1_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 7;
    __IO uint8_t ADBUFE                     : 1;
} stc_sysreg_pwr_pwcmr_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 4;
    __IO uint8_t XTALDRV                    : 2;
    __IO uint8_t XTALMS                     : 1;
    __IO uint8_t SUPDRV                     : 1;
} stc_sysreg_cmu_xtalcfgr_field_t;

typedef struct
{
    __IO uint8_t EXVCCINEN                  : 1;
    uint8_t RESERVED1                       : 4;
    __IO uint8_t PVD1EN                     : 1;
    __IO uint8_t PVD2EN                     : 1;
} stc_sysreg_pwr_pvdcr0_field_t;

typedef struct
{
    __IO uint8_t PVD1IRE                    : 1;
    __IO uint8_t PVD1IRS                    : 1;
    __IO uint8_t PVD1CMPOE                  : 1;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t PVD2IRE                    : 1;
    __IO uint8_t PVD2IRS                    : 1;
    __IO uint8_t PVD2CMPOE                  : 1;
} stc_sysreg_pwr_pvdcr1_field_t;

typedef struct
{
    __IO uint8_t PVD1NFDIS                  : 1;
    __IO uint8_t PVD1NFCKS                  : 2;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t PVD2NFDIS                  : 1;
    __IO uint8_t PVD2NFCKS                  : 2;
} stc_sysreg_pwr_pvdfcr_field_t;

typedef struct
{
    __IO uint8_t PVD1LVL                    : 3;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t PVD2LVL                    : 3;
} stc_sysreg_pwr_pvdlcr_field_t;

typedef struct
{
    __IO uint8_t XTAL32STP                  : 1;
} stc_sysreg_cmu_xtal32cr_field_t;

typedef struct
{
    __IO uint8_t XTAL32DRV                  : 2;
    __IO uint8_t XTAL32SUPDRV               : 1;
} stc_sysreg_cmu_xtal32cfgr_field_t;

typedef struct
{
    __IO uint8_t XTAL32NF                   : 2;
} stc_sysreg_cmu_xtal32nfr_field_t;

typedef struct
{
    __IO uint8_t LRCSTP                     : 1;
} stc_sysreg_cmu_lrccr_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 7;
    __IO uint8_t CSDIS                      : 1;
} stc_sysreg_pwr_xtal32cs_field_t;

typedef struct
{
    __IO uint32_t CNTA                      :16;
} stc_tmr0_cntar_field_t;

typedef struct
{
    __IO uint32_t CNTB                      :16;
} stc_tmr0_cntbr_field_t;

typedef struct
{
    __IO uint32_t CMPA                      :16;
} stc_tmr0_cmpar_field_t;

typedef struct
{
    __IO uint32_t CMPB                      :16;
} stc_tmr0_cmpbr_field_t;

typedef struct
{
    __IO uint32_t CSTA                      : 1;
    __IO uint32_t CAPMDA                    : 1;
    __IO uint32_t INTENA                    : 1;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t CKDIVA                    : 4;
    __IO uint32_t SYNSA                     : 1;
    __IO uint32_t SYNCLKA                   : 1;
    __IO uint32_t ASYNCLKA                  : 1;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t HSTAA                     : 1;
    __IO uint32_t HSTPA                     : 1;
    __IO uint32_t HCLEA                     : 1;
    __IO uint32_t HICPA                     : 1;
    __IO uint32_t CSTB                      : 1;
    __IO uint32_t CAPMDB                    : 1;
    __IO uint32_t INTENB                    : 1;
    uint32_t RESERVED19                     : 1;
    __IO uint32_t CKDIVB                    : 4;
    __IO uint32_t SYNSB                     : 1;
    __IO uint32_t SYNCLKB                   : 1;
    __IO uint32_t ASYNCLKB                  : 1;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t HSTAB                     : 1;
    __IO uint32_t HSTPB                     : 1;
    __IO uint32_t HCLEB                     : 1;
    __IO uint32_t HICPB                     : 1;
} stc_tmr0_bconr_field_t;

typedef struct
{
    __IO uint32_t CMAF                      : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t CMBF                      : 1;
} stc_tmr0_stflr_field_t;

typedef struct
{
    __IO uint16_t OCEHU                     : 1;
    __IO uint16_t OCELU                     : 1;
    __IO uint16_t OCPHU                     : 1;
    __IO uint16_t OCPLU                     : 1;
    __IO uint16_t OCIEHU                    : 1;
    __IO uint16_t OCIELU                    : 1;
    __IO uint16_t OCFHU                     : 1;
    __IO uint16_t OCFLU                     : 1;
} stc_tmr4_ocsru_field_t;

typedef struct
{
    __IO uint16_t CHBUFENU                  : 2;
    __IO uint16_t CLBUFENU                  : 2;
    __IO uint16_t MHBUFENU                  : 2;
    __IO uint16_t MLBUFENU                  : 2;
    __IO uint16_t LMCHU                     : 1;
    __IO uint16_t LMCLU                     : 1;
    __IO uint16_t LMMHU                     : 1;
    __IO uint16_t LMMLU                     : 1;
    __IO uint16_t MCECHU                    : 1;
    __IO uint16_t MCECLU                    : 1;
} stc_tmr4_oceru_field_t;

