CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
typedef struct
{
    __IO uint32_t MPSIZ                     : 2;
    uint32_t RESERVED2                      :13;
    __IO uint32_t USBAEP                    : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYP                     : 2;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t TXFNUM                    : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    uint32_t RESERVED28                     : 2;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usbfs_diepctl0_field_t;

typedef struct
{
    __IO uint32_t XFRC                      : 1;
    __IO uint32_t EPDISD                    : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t TOC                       : 1;
    __IO uint32_t TTXFE                     : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t NEPNE                     : 1;
    __IO uint32_t TXFE                      : 1;
} stc_usbfs_diepint0_field_t;

typedef struct
{
    __IO uint32_t XFRSIZ                    : 7;
    uint32_t RESERVED7                      :12;
    __IO uint32_t PKTCNT                    : 2;
} stc_usbfs_dieptsiz0_field_t;

typedef struct
{
    __IO uint32_t INEPTFSAV                 :16;
} stc_usbfs_dtxfsts0_field_t;

typedef struct
{
    __IO uint32_t MPSIZ                     :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBAEP                    : 1;
    __IO uint32_t EONUM_DPID                : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYP                     : 2;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t TXFNUM                    : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SD0PID_SEVNFRM            : 1;
    __IO uint32_t SODDFRM                   : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usbfs_diepctl_field_t;

typedef struct
{
    __IO uint32_t XFRC                      : 1;
    __IO uint32_t EPDISD                    : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t TOC                       : 1;
    __IO uint32_t TTXFE                     : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t NEPNE                     : 1;
    __IO uint32_t TXFE                      : 1;
} stc_usbfs_diepint_field_t;

typedef struct
{
    __IO uint32_t XFRSIZ                    :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t MC                        : 2;
} stc_usbfs_dieptsiz_field_t;

typedef struct
{
    __IO uint32_t INEPTFSAV                 :16;
} stc_usbfs_dtxfsts_field_t;

typedef struct
{
    __IO uint32_t MPSIZ                     : 2;
    uint32_t RESERVED2                      :13;
    __IO uint32_t USBAEP                    : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYP                     : 2;
    __IO uint32_t SNPM                      : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    uint32_t RESERVED28                     : 2;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usbfs_doepctl0_field_t;

typedef struct
{
    __IO uint32_t XFRC                      : 1;
    __IO uint32_t EPDISD                    : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t STUP                      : 1;
    __IO uint32_t OTEPDIS                   : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t B2BSTUP                   : 1;
} stc_usbfs_doepint_field_t;

typedef struct
{
    __IO uint32_t XFRSIZ                    : 7;
    uint32_t RESERVED7                      :12;
    __IO uint32_t PKTCNT                    : 1;
    uint32_t RESERVED20                     : 9;
    __IO uint32_t STUPCNT                   : 2;
} stc_usbfs_doeptsiz0_field_t;

typedef struct
{
    __IO uint32_t MPSIZ                     :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBAEP                    : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYP                     : 2;
    __IO uint32_t SNPM                      : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SD0PID                    : 1;
    __IO uint32_t SD1PID                    : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usbfs_doepctl_field_t;

typedef struct
{
    __IO uint32_t XFRSIZ                    :19;
    __IO uint32_t PKTCNT                    :10;
} stc_usbfs_doeptsiz_field_t;

typedef struct
{
    __IO uint32_t STPPCLK                   : 1;
    __IO uint32_t GATEHCLK                  : 1;
} stc_usbfs_pcgcctl_field_t;

typedef struct
{
    __IO uint32_t PERI                      : 2;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t CKS                       : 4;
    __IO uint32_t WDPT                      : 4;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t SLPOFF                    : 1;
    uint32_t RESERVED17                     :14;
    __IO uint32_t ITS                       : 1;
} stc_wdt_cr_field_t;

typedef struct
{
    __IO uint32_t CNT                       :16;
    __IO uint32_t UDF                       : 1;
    __IO uint32_t REF                       : 1;
} stc_wdt_sr_field_t;

typedef struct
{
    __IO uint32_t RF                        :16;
} stc_wdt_rr_field_t;

typedef struct
{
    __IO uint16_t WKTMCMP                   :12;
    __IO uint16_t WKOVF                     : 1;
    __IO uint16_t WKCKS                     : 2;
    __IO uint16_t WKTCE                     : 1;
} stc_wktm_cr_field_t;


typedef struct
{
    union
    {
        __IO uint8_t STR;
        stc_adc_str_field_t STR_f;
    };
    uint8_t RESERVED1[1];
    union
    {
        __IO uint16_t CR0;
        stc_adc_cr0_field_t CR0_f;
    };
    union
    {
        __IO uint16_t CR1;
        stc_adc_cr1_field_t CR1_f;
    };
    uint8_t RESERVED3[4];
    union
    {
        __IO uint16_t TRGSR;
        stc_adc_trgsr_field_t TRGSR_f;
    };
    __IO uint16_t CHSELRA0;
    union
    {
        __IO uint16_t CHSELRA1;
        stc_adc_chselra1_field_t CHSELRA1_f;
    };
    __IO uint16_t CHSELRB0;
    union
    {
        __IO uint16_t CHSELRB1;
        stc_adc_chselrb1_field_t CHSELRB1_f;
    };
    __IO uint16_t AVCHSELR0;
    union
    {
        __IO uint16_t AVCHSELR1;
        stc_adc_avchselr1_field_t AVCHSELR1_f;
    };
    uint8_t RESERVED10[8];
    __IO uint8_t SSTR0;
    __IO uint8_t SSTR1;
    __IO uint8_t SSTR2;
    __IO uint8_t SSTR3;
    __IO uint8_t SSTR4;
    __IO uint8_t SSTR5;
    __IO uint8_t SSTR6;
    __IO uint8_t SSTR7;
    __IO uint8_t SSTR8;
    __IO uint8_t SSTR9;
    __IO uint8_t SSTR10;
    __IO uint8_t SSTR11;
    __IO uint8_t SSTR12;
    __IO uint8_t SSTR13;
    __IO uint8_t SSTR14;
    __IO uint8_t SSTR15;
    __IO uint8_t SSTRL;
    uint8_t RESERVED27[7];
    union
    {
        __IO uint16_t CHMUXR0;
        stc_adc_chmuxr0_field_t CHMUXR0_f;
    };
    union
    {
        __IO uint16_t CHMUXR1;
        stc_adc_chmuxr1_field_t CHMUXR1_f;
    };
    union
    {
        __IO uint16_t CHMUXR2;
        stc_adc_chmuxr2_field_t CHMUXR2_f;
    };
    union
    {
        __IO uint16_t CHMUXR3;
        stc_adc_chmuxr3_field_t CHMUXR3_f;
    };
    uint8_t RESERVED31[6];
    union
    {
        __IO uint8_t ISR;
        stc_adc_isr_field_t ISR_f;
    };
    union
    {
        __IO uint8_t ICR;
        stc_adc_icr_field_t ICR_f;
    };
    uint8_t RESERVED33[4];
    union
    {
        __IO uint16_t SYNCCR;
        stc_adc_synccr_field_t SYNCCR_f;
    };
    uint8_t RESERVED34[2];
    __IO uint16_t DR0;
    __IO uint16_t DR1;
    __IO uint16_t DR2;
    __IO uint16_t DR3;
    __IO uint16_t DR4;
    __IO uint16_t DR5;
    __IO uint16_t DR6;
    __IO uint16_t DR7;
    __IO uint16_t DR8;
    __IO uint16_t DR9;
    __IO uint16_t DR10;
    __IO uint16_t DR11;
    __IO uint16_t DR12;
    __IO uint16_t DR13;
    __IO uint16_t DR14;
    __IO uint16_t DR15;
    __IO uint16_t DR16;
    uint8_t RESERVED51[46];
    union
    {
        __IO uint16_t AWDCR;
        stc_adc_awdcr_field_t AWDCR_f;
    };
    uint8_t RESERVED52[2];
    __IO uint16_t AWDDR0;
    __IO uint16_t AWDDR1;
    uint8_t RESERVED54[4];
    __IO uint16_t AWDCHSR0;
    union
    {
        __IO uint16_t AWDCHSR1;
        stc_adc_awdchsr1_field_t AWDCHSR1_f;
    };
    __IO uint16_t AWDSR0;
    union
    {
        __IO uint16_t AWDSR1;
        stc_adc_awdsr1_field_t AWDSR1_f;
    };
    uint8_t RESERVED58[12];
    union
    {
        __IO uint16_t PGACR;
        stc_adc_pgacr_field_t PGACR_f;
    };
    union
    {
        __IO uint16_t PGAGSR;
        stc_adc_pgagsr_field_t PGAGSR_f;
    };
    uint8_t RESERVED60[8];
    union
    {
        __IO uint16_t PGAINSR0;
        stc_adc_pgainsr0_field_t PGAINSR0_f;
    };
    union
    {
        __IO uint16_t PGAINSR1;
        stc_adc_pgainsr1_field_t PGAINSR1_f;
    };
}M4_ADC_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CR;
        stc_aes_cr_field_t CR_f;
    };
    uint8_t RESERVED1[12];
    __IO uint32_t DR0;
    __IO uint32_t DR1;
    __IO uint32_t DR2;
    __IO uint32_t DR3;
    __IO uint32_t KR0;
    __IO uint32_t KR1;
    __IO uint32_t KR2;
    __IO uint32_t KR3;
}M4_AES_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t INT_SFTTRG;
        stc_aos_int_sfttrg_field_t INT_SFTTRG_f;
    };
    union
    {
        __IO uint32_t DCU1_TRGSEL;
        stc_aos_dcu1_trgsel_field_t DCU1_TRGSEL_f;
    };
    union
    {
        __IO uint32_t DCU2_TRGSEL;
        stc_aos_dcu2_trgsel_field_t DCU2_TRGSEL_f;
    };
    union
    {
        __IO uint32_t DCU3_TRGSEL;
        stc_aos_dcu3_trgsel_field_t DCU3_TRGSEL_f;
    };
    union
    {
        __IO uint32_t DCU4_TRGSEL;
        stc_aos_dcu4_trgsel_field_t DCU4_TRGSEL_f;
    };
    union
    {
        __IO uint32_t DMA1_TRGSEL0;
        stc_aos_dma1_trgsel0_field_t DMA1_TRGSEL0_f;
    };
    union
    {
        __IO uint32_t DMA1_TRGSEL1;
        stc_aos_dma1_trgsel1_field_t DMA1_TRGSEL1_f;
    };
    union
    {
        __IO uint32_t DMA1_TRGSEL2;
        stc_aos_dma1_trgsel2_field_t DMA1_TRGSEL2_f;
    };
    union
    {
        __IO uint32_t DMA1_TRGSEL3;
        stc_aos_dma1_trgsel3_field_t DMA1_TRGSEL3_f;
    };
    union
    {
        __IO uint32_t DMA2_TRGSEL0;
        stc_aos_dma2_trgsel0_field_t DMA2_TRGSEL0_f;
    };
    union
    {
        __IO uint32_t DMA2_TRGSEL1;
        stc_aos_dma2_trgsel1_field_t DMA2_TRGSEL1_f;
    };
    union
    {
        __IO uint32_t DMA2_TRGSEL2;
        stc_aos_dma2_trgsel2_field_t DMA2_TRGSEL2_f;
    };
    union
    {
        __IO uint32_t DMA2_TRGSEL3;
        stc_aos_dma2_trgsel3_field_t DMA2_TRGSEL3_f;
    };
    union
    {
        __IO uint32_t DMATRGSELRC;
        stc_aos_dmatrgselrc_field_t DMATRGSELRC_f;
    };
    union
    {
        __IO uint32_t TMR6_HTSSR1;
        stc_aos_tmr6_htssr1_field_t TMR6_HTSSR1_f;
    };
    union
    {
        __IO uint32_t TMR6_HTSSR2;
        stc_aos_tmr6_htssr2_field_t TMR6_HTSSR2_f;
    };
    union
    {
        __IO uint32_t TMR0_HTSSR;
        stc_aos_tmr0_htssr_field_t TMR0_HTSSR_f;
    };
    union
    {
        __IO uint32_t PORT_PEVNTTRGSR12;
        stc_aos_port_pevnttrgsr12_field_t PORT_PEVNTTRGSR12_f;
    };
    union
    {
        __IO uint32_t PORT_PEVNTTRGSR34;
        stc_aos_port_pevnttrgsr34_field_t PORT_PEVNTTRGSR34_f;
    };
    union
    {
        __IO uint32_t TMRA_HTSSR0;
        stc_aos_tmra_htssr0_field_t TMRA_HTSSR0_f;
    };
    union
    {
        __IO uint32_t TMRA_HTSSR1;
        stc_aos_tmra_htssr1_field_t TMRA_HTSSR1_f;
    };
    union
    {
        __IO uint32_t OTS_TRG;
        stc_aos_ots_trg_field_t OTS_TRG_f;
    };
    union
    {
        __IO uint32_t ADC1_ITRGSELR0;
        stc_aos_adc1_itrgselr0_field_t ADC1_ITRGSELR0_f;
    };
    union
    {
        __IO uint32_t ADC1_ITRGSELR1;
        stc_aos_adc1_itrgselr1_field_t ADC1_ITRGSELR1_f;
    };
    union
    {
        __IO uint32_t ADC2_ITRGSELR0;
        stc_aos_adc2_itrgselr0_field_t ADC2_ITRGSELR0_f;
    };
    union
    {
        __IO uint32_t ADC2_ITRGSELR1;
        stc_aos_adc2_itrgselr1_field_t ADC2_ITRGSELR1_f;
    };
    union
    {
        __IO uint32_t COMTRG1;
        stc_aos_comtrg1_field_t COMTRG1_f;
    };
    union
    {
        __IO uint32_t COMTRG2;
        stc_aos_comtrg2_field_t COMTRG2_f;
    };
    uint8_t RESERVED28[144];
    union
    {
        __IO uint32_t PEVNTDIRR1;
        stc_aos_pevntdirr_field_t PEVNTDIRR1_f;
    };
    union
    {
        __IO uint32_t PEVNTIDR1;
        stc_aos_pevntidr_field_t PEVNTIDR1_f;
    };
    union
    {
        __IO uint32_t PEVNTODR1;
        stc_aos_pevntodr_field_t PEVNTODR1_f;
    };
    union
    {
        __IO uint32_t PEVNTORR1;
        stc_aos_pevntorr_field_t PEVNTORR1_f;
    };
    union
    {
        __IO uint32_t PEVNTOSR1;
        stc_aos_pevntosr_field_t PEVNTOSR1_f;
    };
    union
    {
        __IO uint32_t PEVNTRISR1;
        stc_aos_pevntrisr_field_t PEVNTRISR1_f;
    };
    union
    {
        __IO uint32_t PEVNTFAL1;
        stc_aos_pevntfal_field_t PEVNTFAL1_f;
    };
    union
    {
        __IO uint32_t PEVNTDIRR2;
        stc_aos_pevntdirr_field_t PEVNTDIRR2_f;
    };
    union
    {
        __IO uint32_t PEVNTIDR2;
        stc_aos_pevntidr_field_t PEVNTIDR2_f;
    };
    union
    {
        __IO uint32_t PEVNTODR2;
        stc_aos_pevntodr_field_t PEVNTODR2_f;
    };
    union
    {
        __IO uint32_t PEVNTORR2;
        stc_aos_pevntorr_field_t PEVNTORR2_f;
    };
    union
    {
        __IO uint32_t PEVNTOSR2;
        stc_aos_pevntosr_field_t PEVNTOSR2_f;
    };
    union
    {
        __IO uint32_t PEVNTRISR2;
        stc_aos_pevntrisr_field_t PEVNTRISR2_f;
    };
    union
    {
        __IO uint32_t PEVNTFAL2;
        stc_aos_pevntfal_field_t PEVNTFAL2_f;
    };
    union
    {
        __IO uint32_t PEVNTDIRR3;
        stc_aos_pevntdirr_field_t PEVNTDIRR3_f;
    };
    union
    {
        __IO uint32_t PEVNTIDR3;
        stc_aos_pevntidr_field_t PEVNTIDR3_f;
    };
    union
    {
        __IO uint32_t PEVNTODR3;
        stc_aos_pevntodr_field_t PEVNTODR3_f;
    };
    union
    {
        __IO uint32_t PEVNTORR3;
        stc_aos_pevntorr_field_t PEVNTORR3_f;
    };
    union
    {
        __IO uint32_t PEVNTOSR3;
        stc_aos_pevntosr_field_t PEVNTOSR3_f;
    };
    union
    {
        __IO uint32_t PEVNTRISR3;
        stc_aos_pevntrisr_field_t PEVNTRISR3_f;
    };
    union
    {
        __IO uint32_t PEVNTFAL3;
        stc_aos_pevntfal_field_t PEVNTFAL3_f;
    };
    union
    {
        __IO uint32_t PEVNTDIRR4;
        stc_aos_pevntdirr_field_t PEVNTDIRR4_f;
    };
    union
    {
        __IO uint32_t PEVNTIDR4;
        stc_aos_pevntidr_field_t PEVNTIDR4_f;
    };
    union
    {
        __IO uint32_t PEVNTODR4;
        stc_aos_pevntodr_field_t PEVNTODR4_f;
    };
    union
    {
        __IO uint32_t PEVNTORR4;
        stc_aos_pevntorr_field_t PEVNTORR4_f;
    };
    union
    {
        __IO uint32_t PEVNTOSR4;
        stc_aos_pevntosr_field_t PEVNTOSR4_f;
    };
    union
    {
        __IO uint32_t PEVNTRISR4;
        stc_aos_pevntrisr_field_t PEVNTRISR4_f;
    };
    union
    {
        __IO uint32_t PEVNTFAL4;
        stc_aos_pevntfal_field_t PEVNTFAL4_f;
    };
    union
    {
        __IO uint32_t PEVNTNFCR;
        stc_aos_pevntnfcr_field_t PEVNTNFCR_f;
    };
}M4_AOS_TypeDef;

typedef struct
{
    __IO uint32_t RBUF0;
    __IO uint32_t RBUF1;
    __IO uint32_t RBUF2;
    __IO uint32_t RBUF3;
    uint8_t RESERVED4[64];
    __IO uint32_t TBUF0;
    __IO uint32_t TBUF1;
    __IO uint32_t TBUF2;
    __IO uint32_t TBUF3;
    uint8_t RESERVED8[64];
    union
    {
        __IO uint8_t CFG_STAT;
        stc_can_cfg_stat_field_t CFG_STAT_f;
    };
    union
    {
        __IO uint8_t TCMD;
        stc_can_tcmd_field_t TCMD_f;
    };
    union
    {
        __IO uint8_t TCTRL;
        stc_can_tctrl_field_t TCTRL_f;
    };
    union
    {
        __IO uint8_t RCTRL;
        stc_can_rctrl_field_t RCTRL_f;
    };
    union
    {
        __IO uint8_t RTIE;
        stc_can_rtie_field_t RTIE_f;
    };
    union
    {
        __IO uint8_t RTIF;
        stc_can_rtif_field_t RTIF_f;
    };
    union
    {
        __IO uint8_t ERRINT;
        stc_can_errint_field_t ERRINT_f;
    };
    union
    {
        __IO uint8_t LIMIT;
        stc_can_limit_field_t LIMIT_f;
    };
    union
    {
        __IO uint32_t BT;
        stc_can_bt_field_t BT_f;
    };
    uint8_t RESERVED17[4];
    union
    {
        __IO uint8_t EALCAP;
        stc_can_ealcap_field_t EALCAP_f;
    };
    uint8_t RESERVED18[1];
    __IO uint8_t RECNT;
    __IO uint8_t TECNT;
    union
    {
        __IO uint8_t ACFCTRL;
        stc_can_acfctrl_field_t ACFCTRL_f;
    };
    uint8_t RESERVED21[1];
    union
    {
        __IO uint8_t ACFEN;
        stc_can_acfen_field_t ACFEN_f;
    };
    uint8_t RESERVED22[1];
    union
    {
        __IO uint32_t ACF;
        stc_can_acf_field_t ACF_f;
    };
    uint8_t RESERVED23[2];
    union
    {
        __IO uint8_t TBSLOT;
        stc_can_tbslot_field_t TBSLOT_f;
    };
    union
    {
        __IO uint8_t TTCFG;
        stc_can_ttcfg_field_t TTCFG_f;
    };
    union
    {
        __IO uint32_t REF_MSG;
        stc_can_ref_msg_field_t REF_MSG_f;
    };
    union
    {
        __IO uint16_t TRG_CFG;
        stc_can_trg_cfg_field_t TRG_CFG_f;
    };
    __IO uint16_t TT_TRIG;
    __IO uint16_t TT_WTRIG;
}M4_CAN_TypeDef;

typedef struct
{
    union
    {
        __IO uint16_t CTRL;
        stc_cmp_ctrl_field_t CTRL_f;
    };
    union
    {
        __IO uint16_t VLTSEL;
        stc_cmp_vltsel_field_t VLTSEL_f;
    };
    union
    {
        __IO uint16_t MON;
        stc_cmp_mon_field_t MON_f;
    };
    union
    {
        __IO uint16_t CVSSTB;
        stc_cmp_cvsstb_field_t CVSSTB_f;
    };
    union
    {
        __IO uint16_t CVSPRD;
        stc_cmp_cvsprd_field_t CVSPRD_f;
    };
}M4_CMP_TypeDef;

typedef struct
{
    uint8_t RESERVED0[256];
    union
    {
        __IO uint16_t DADR1;
        stc_cmp_cr_dadr1_field_t DADR1_f;
    };
    union
    {
        __IO uint16_t DADR2;
        stc_cmp_cr_dadr2_field_t DADR2_f;
    };
    uint8_t RESERVED2[4];
    union
    {
        __IO uint16_t DACR;
        stc_cmp_cr_dacr_field_t DACR_f;
    };
    uint8_t RESERVED3[2];
    union
    {
        __IO uint16_t RVADC;
        stc_cmp_cr_rvadc_field_t RVADC_f;
    };
}M4_CMP_CR_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CR;
        stc_crc_cr_field_t CR_f;
    };
    __IO uint32_t RESLT;
    uint8_t RESERVED2[4];
    union
    {
        __IO uint32_t FLG;
        stc_crc_flg_field_t FLG_f;
    };
    uint8_t RESERVED3[112];
    __IO uint32_t DAT0;
    __IO uint32_t DAT1;
    __IO uint32_t DAT2;
    __IO uint32_t DAT3;
    __IO uint32_t DAT4;
    __IO uint32_t DAT5;
    __IO uint32_t DAT6;
    __IO uint32_t DAT7;
    __IO uint32_t DAT8;
    __IO uint32_t DAT9;
    __IO uint32_t DAT10;
    __IO uint32_t DAT11;
    __IO uint32_t DAT12;
    __IO uint32_t DAT13;
    __IO uint32_t DAT14;
    __IO uint32_t DAT15;
    __IO uint32_t DAT16;
    __IO uint32_t DAT17;
    __IO uint32_t DAT18;
    __IO uint32_t DAT19;
    __IO uint32_t DAT20;
    __IO uint32_t DAT21;
    __IO uint32_t DAT22;
    __IO uint32_t DAT23;
    __IO uint32_t DAT24;
    __IO uint32_t DAT25;
    __IO uint32_t DAT26;
    __IO uint32_t DAT27;
    __IO uint32_t DAT28;
    __IO uint32_t DAT29;
    __IO uint32_t DAT30;
    __IO uint32_t DAT31;
}M4_CRC_TypeDef;

typedef struct
{
    __IO uint32_t AUTHID0;
    __IO uint32_t AUTHID1;
    __IO uint32_t AUTHID2;
    __IO uint32_t RESV0;
    union
    {
        __IO uint32_t MCUSTAT;
        stc_dbgc_mcustat_field_t MCUSTAT_f;
    };
    union
    {
        __IO uint32_t MCUCTL;
        stc_dbgc_mcuctl_field_t MCUCTL_f;
    };
    union
    {
        __IO uint32_t FMCCTL;
        stc_dbgc_fmcctl_field_t FMCCTL_f;
    };
    union
    {
        __IO uint32_t MCUDBGSTAT;
        stc_dbgc_mcudbgstat_field_t MCUDBGSTAT_f;
    };
    union
    {
        __IO uint32_t MCUSTPCTL;
        stc_dbgc_mcustpctl_field_t MCUSTPCTL_f;
    };
    union
    {
        __IO uint32_t MCUTRACECTL;
        stc_dbgc_mcutracectl_field_t MCUTRACECTL_f;
    };
}M4_DBGC_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CTL;
        stc_dcu_ctl_field_t CTL_f;
    };
    union
    {
        __IO uint32_t FLAG;
        stc_dcu_flag_field_t FLAG_f;
    };
    __IO uint32_t DATA0;
    __IO uint32_t DATA1;
    __IO uint32_t DATA2;
    union
    {
        __IO uint32_t FLAGCLR;
        stc_dcu_flagclr_field_t FLAGCLR_f;
    };
    union
    {
        __IO uint32_t INTSEL;
        stc_dcu_intsel_field_t INTSEL_f;
    };
}M4_DCU_TypeDef;

