CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
typedef struct
{
    union
    {
        __IO uint32_t NMICR;
        stc_intc_nmicr_field_t NMICR_f;
    };
    union
    {
        __IO uint32_t NMIENR;
        stc_intc_nmienr_field_t NMIENR_f;
    };
    union
    {
        __IO uint32_t NMIFR;
        stc_intc_nmifr_field_t NMIFR_f;
    };
    union
    {
        __IO uint32_t NMICFR;
        stc_intc_nmicfr_field_t NMICFR_f;
    };
    union
    {
        __IO uint32_t EIRQCR0;
        stc_intc_eirqcr_field_t EIRQCR0_f;
    };
    union
    {
        __IO uint32_t EIRQCR1;
        stc_intc_eirqcr_field_t EIRQCR1_f;
    };
    union
    {
        __IO uint32_t EIRQCR2;
        stc_intc_eirqcr_field_t EIRQCR2_f;
    };
    union
    {
        __IO uint32_t EIRQCR3;
        stc_intc_eirqcr_field_t EIRQCR3_f;
    };
    union
    {
        __IO uint32_t EIRQCR4;
        stc_intc_eirqcr_field_t EIRQCR4_f;
    };
    union
    {
        __IO uint32_t EIRQCR5;
        stc_intc_eirqcr_field_t EIRQCR5_f;
    };
    union
    {
        __IO uint32_t EIRQCR6;
        stc_intc_eirqcr_field_t EIRQCR6_f;
    };
    union
    {
        __IO uint32_t EIRQCR7;
        stc_intc_eirqcr_field_t EIRQCR7_f;
    };
    union
    {
        __IO uint32_t EIRQCR8;
        stc_intc_eirqcr_field_t EIRQCR8_f;
    };
    union
    {
        __IO uint32_t EIRQCR9;
        stc_intc_eirqcr_field_t EIRQCR9_f;
    };
    union
    {
        __IO uint32_t EIRQCR10;
        stc_intc_eirqcr_field_t EIRQCR10_f;
    };
    union
    {
        __IO uint32_t EIRQCR11;
        stc_intc_eirqcr_field_t EIRQCR11_f;
    };
    union
    {
        __IO uint32_t EIRQCR12;
        stc_intc_eirqcr_field_t EIRQCR12_f;
    };
    union
    {
        __IO uint32_t EIRQCR13;
        stc_intc_eirqcr_field_t EIRQCR13_f;
    };
    union
    {
        __IO uint32_t EIRQCR14;
        stc_intc_eirqcr_field_t EIRQCR14_f;
    };
    union
    {
        __IO uint32_t EIRQCR15;
        stc_intc_eirqcr_field_t EIRQCR15_f;
    };
    union
    {
        __IO uint32_t WUPEN;
        stc_intc_wupen_field_t WUPEN_f;
    };
    union
    {
        __IO uint32_t EIFR;
        stc_intc_eifr_field_t EIFR_f;
    };
    union
    {
        __IO uint32_t EICFR;
        stc_intc_eicfr_field_t EICFR_f;
    };
    union
    {
        __IO uint32_t SEL0;
        stc_intc_sel_field_t SEL0_f;
    };
    union
    {
        __IO uint32_t SEL1;
        stc_intc_sel_field_t SEL1_f;
    };
    union
    {
        __IO uint32_t SEL2;
        stc_intc_sel_field_t SEL2_f;
    };
    union
    {
        __IO uint32_t SEL3;
        stc_intc_sel_field_t SEL3_f;
    };
    union
    {
        __IO uint32_t SEL4;
        stc_intc_sel_field_t SEL4_f;
    };
    union
    {
        __IO uint32_t SEL5;
        stc_intc_sel_field_t SEL5_f;
    };
    union
    {
        __IO uint32_t SEL6;
        stc_intc_sel_field_t SEL6_f;
    };
    union
    {
        __IO uint32_t SEL7;
        stc_intc_sel_field_t SEL7_f;
    };
    union
    {
        __IO uint32_t SEL8;
        stc_intc_sel_field_t SEL8_f;
    };
    union
    {
        __IO uint32_t SEL9;
        stc_intc_sel_field_t SEL9_f;
    };
    union
    {
        __IO uint32_t SEL10;
        stc_intc_sel_field_t SEL10_f;
    };
    union
    {
        __IO uint32_t SEL11;
        stc_intc_sel_field_t SEL11_f;
    };
    union
    {
        __IO uint32_t SEL12;
        stc_intc_sel_field_t SEL12_f;
    };
    union
    {
        __IO uint32_t SEL13;
        stc_intc_sel_field_t SEL13_f;
    };
    union
    {
        __IO uint32_t SEL14;
        stc_intc_sel_field_t SEL14_f;
    };
    union
    {
        __IO uint32_t SEL15;
        stc_intc_sel_field_t SEL15_f;
    };
    union
    {
        __IO uint32_t SEL16;
        stc_intc_sel_field_t SEL16_f;
    };
    union
    {
        __IO uint32_t SEL17;
        stc_intc_sel_field_t SEL17_f;
    };
    union
    {
        __IO uint32_t SEL18;
        stc_intc_sel_field_t SEL18_f;
    };
    union
    {
        __IO uint32_t SEL19;
        stc_intc_sel_field_t SEL19_f;
    };
    union
    {
        __IO uint32_t SEL20;
        stc_intc_sel_field_t SEL20_f;
    };
    union
    {
        __IO uint32_t SEL21;
        stc_intc_sel_field_t SEL21_f;
    };
    union
    {
        __IO uint32_t SEL22;
        stc_intc_sel_field_t SEL22_f;
    };
    union
    {
        __IO uint32_t SEL23;
        stc_intc_sel_field_t SEL23_f;
    };
    union
    {
        __IO uint32_t SEL24;
        stc_intc_sel_field_t SEL24_f;
    };
    union
    {
        __IO uint32_t SEL25;
        stc_intc_sel_field_t SEL25_f;
    };
    union
    {
        __IO uint32_t SEL26;
        stc_intc_sel_field_t SEL26_f;
    };
    union
    {
        __IO uint32_t SEL27;
        stc_intc_sel_field_t SEL27_f;
    };
    union
    {
        __IO uint32_t SEL28;
        stc_intc_sel_field_t SEL28_f;
    };
    union
    {
        __IO uint32_t SEL29;
        stc_intc_sel_field_t SEL29_f;
    };
    union
    {
        __IO uint32_t SEL30;
        stc_intc_sel_field_t SEL30_f;
    };
    union
    {
        __IO uint32_t SEL31;
        stc_intc_sel_field_t SEL31_f;
    };
    union
    {
        __IO uint32_t SEL32;
        stc_intc_sel_field_t SEL32_f;
    };
    union
    {
        __IO uint32_t SEL33;
        stc_intc_sel_field_t SEL33_f;
    };
    union
    {
        __IO uint32_t SEL34;
        stc_intc_sel_field_t SEL34_f;
    };
    union
    {
        __IO uint32_t SEL35;
        stc_intc_sel_field_t SEL35_f;
    };
    union
    {
        __IO uint32_t SEL36;
        stc_intc_sel_field_t SEL36_f;
    };
    union
    {
        __IO uint32_t SEL37;
        stc_intc_sel_field_t SEL37_f;
    };
    union
    {
        __IO uint32_t SEL38;
        stc_intc_sel_field_t SEL38_f;
    };
    union
    {
        __IO uint32_t SEL39;
        stc_intc_sel_field_t SEL39_f;
    };
    union
    {
        __IO uint32_t SEL40;
        stc_intc_sel_field_t SEL40_f;
    };
    union
    {
        __IO uint32_t SEL41;
        stc_intc_sel_field_t SEL41_f;
    };
    union
    {
        __IO uint32_t SEL42;
        stc_intc_sel_field_t SEL42_f;
    };
    union
    {
        __IO uint32_t SEL43;
        stc_intc_sel_field_t SEL43_f;
    };
    union
    {
        __IO uint32_t SEL44;
        stc_intc_sel_field_t SEL44_f;
    };
    union
    {
        __IO uint32_t SEL45;
        stc_intc_sel_field_t SEL45_f;
    };
    union
    {
        __IO uint32_t SEL46;
        stc_intc_sel_field_t SEL46_f;
    };
    union
    {
        __IO uint32_t SEL47;
        stc_intc_sel_field_t SEL47_f;
    };
    union
    {
        __IO uint32_t SEL48;
        stc_intc_sel_field_t SEL48_f;
    };
    union
    {
        __IO uint32_t SEL49;
        stc_intc_sel_field_t SEL49_f;
    };
    union
    {
        __IO uint32_t SEL50;
        stc_intc_sel_field_t SEL50_f;
    };
    union
    {
        __IO uint32_t SEL51;
        stc_intc_sel_field_t SEL51_f;
    };
    union
    {
        __IO uint32_t SEL52;
        stc_intc_sel_field_t SEL52_f;
    };
    union
    {
        __IO uint32_t SEL53;
        stc_intc_sel_field_t SEL53_f;
    };
    union
    {
        __IO uint32_t SEL54;
        stc_intc_sel_field_t SEL54_f;
    };
    union
    {
        __IO uint32_t SEL55;
        stc_intc_sel_field_t SEL55_f;
    };
    union
    {
        __IO uint32_t SEL56;
        stc_intc_sel_field_t SEL56_f;
    };
    union
    {
        __IO uint32_t SEL57;
        stc_intc_sel_field_t SEL57_f;
    };
    union
    {
        __IO uint32_t SEL58;
        stc_intc_sel_field_t SEL58_f;
    };
    union
    {
        __IO uint32_t SEL59;
        stc_intc_sel_field_t SEL59_f;
    };
    union
    {
        __IO uint32_t SEL60;
        stc_intc_sel_field_t SEL60_f;
    };
    union
    {
        __IO uint32_t SEL61;
        stc_intc_sel_field_t SEL61_f;
    };
    union
    {
        __IO uint32_t SEL62;
        stc_intc_sel_field_t SEL62_f;
    };
    union
    {
        __IO uint32_t SEL63;
        stc_intc_sel_field_t SEL63_f;
    };
    union
    {
        __IO uint32_t SEL64;
        stc_intc_sel_field_t SEL64_f;
    };
    union
    {
        __IO uint32_t SEL65;
        stc_intc_sel_field_t SEL65_f;
    };
    union
    {
        __IO uint32_t SEL66;
        stc_intc_sel_field_t SEL66_f;
    };
    union
    {
        __IO uint32_t SEL67;
        stc_intc_sel_field_t SEL67_f;
    };
    union
    {
        __IO uint32_t SEL68;
        stc_intc_sel_field_t SEL68_f;
    };
    union
    {
        __IO uint32_t SEL69;
        stc_intc_sel_field_t SEL69_f;
    };
    union
    {
        __IO uint32_t SEL70;
        stc_intc_sel_field_t SEL70_f;
    };
    union
    {
        __IO uint32_t SEL71;
        stc_intc_sel_field_t SEL71_f;
    };
    union
    {
        __IO uint32_t SEL72;
        stc_intc_sel_field_t SEL72_f;
    };
    union
    {
        __IO uint32_t SEL73;
        stc_intc_sel_field_t SEL73_f;
    };
    union
    {
        __IO uint32_t SEL74;
        stc_intc_sel_field_t SEL74_f;
    };
    union
    {
        __IO uint32_t SEL75;
        stc_intc_sel_field_t SEL75_f;
    };
    union
    {
        __IO uint32_t SEL76;
        stc_intc_sel_field_t SEL76_f;
    };
    union
    {
        __IO uint32_t SEL77;
        stc_intc_sel_field_t SEL77_f;
    };
    union
    {
        __IO uint32_t SEL78;
        stc_intc_sel_field_t SEL78_f;
    };
    union
    {
        __IO uint32_t SEL79;
        stc_intc_sel_field_t SEL79_f;
    };
    union
    {
        __IO uint32_t SEL80;
        stc_intc_sel_field_t SEL80_f;
    };
    union
    {
        __IO uint32_t SEL81;
        stc_intc_sel_field_t SEL81_f;
    };
    union
    {
        __IO uint32_t SEL82;
        stc_intc_sel_field_t SEL82_f;
    };
    union
    {
        __IO uint32_t SEL83;
        stc_intc_sel_field_t SEL83_f;
    };
    union
    {
        __IO uint32_t SEL84;
        stc_intc_sel_field_t SEL84_f;
    };
    union
    {
        __IO uint32_t SEL85;
        stc_intc_sel_field_t SEL85_f;
    };
    union
    {
        __IO uint32_t SEL86;
        stc_intc_sel_field_t SEL86_f;
    };
    union
    {
        __IO uint32_t SEL87;
        stc_intc_sel_field_t SEL87_f;
    };
    union
    {
        __IO uint32_t SEL88;
        stc_intc_sel_field_t SEL88_f;
    };
    union
    {
        __IO uint32_t SEL89;
        stc_intc_sel_field_t SEL89_f;
    };
    union
    {
        __IO uint32_t SEL90;
        stc_intc_sel_field_t SEL90_f;
    };
    union
    {
        __IO uint32_t SEL91;
        stc_intc_sel_field_t SEL91_f;
    };
    union
    {
        __IO uint32_t SEL92;
        stc_intc_sel_field_t SEL92_f;
    };
    union
    {
        __IO uint32_t SEL93;
        stc_intc_sel_field_t SEL93_f;
    };
    union
    {
        __IO uint32_t SEL94;
        stc_intc_sel_field_t SEL94_f;
    };
    union
    {
        __IO uint32_t SEL95;
        stc_intc_sel_field_t SEL95_f;
    };
    union
    {
        __IO uint32_t SEL96;
        stc_intc_sel_field_t SEL96_f;
    };
    union
    {
        __IO uint32_t SEL97;
        stc_intc_sel_field_t SEL97_f;
    };
    union
    {
        __IO uint32_t SEL98;
        stc_intc_sel_field_t SEL98_f;
    };
    union
    {
        __IO uint32_t SEL99;
        stc_intc_sel_field_t SEL99_f;
    };
    union
    {
        __IO uint32_t SEL100;
        stc_intc_sel_field_t SEL100_f;
    };
    union
    {
        __IO uint32_t SEL101;
        stc_intc_sel_field_t SEL101_f;
    };
    union
    {
        __IO uint32_t SEL102;
        stc_intc_sel_field_t SEL102_f;
    };
    union
    {
        __IO uint32_t SEL103;
        stc_intc_sel_field_t SEL103_f;
    };
    union
    {
        __IO uint32_t SEL104;
        stc_intc_sel_field_t SEL104_f;
    };
    union
    {
        __IO uint32_t SEL105;
        stc_intc_sel_field_t SEL105_f;
    };
    union
    {
        __IO uint32_t SEL106;
        stc_intc_sel_field_t SEL106_f;
    };
    union
    {
        __IO uint32_t SEL107;
        stc_intc_sel_field_t SEL107_f;
    };
    union
    {
        __IO uint32_t SEL108;
        stc_intc_sel_field_t SEL108_f;
    };
    union
    {
        __IO uint32_t SEL109;
        stc_intc_sel_field_t SEL109_f;
    };
    union
    {
        __IO uint32_t SEL110;
        stc_intc_sel_field_t SEL110_f;
    };
    union
    {
        __IO uint32_t SEL111;
        stc_intc_sel_field_t SEL111_f;
    };
    union
    {
        __IO uint32_t SEL112;
        stc_intc_sel_field_t SEL112_f;
    };
    union
    {
        __IO uint32_t SEL113;
        stc_intc_sel_field_t SEL113_f;
    };
    union
    {
        __IO uint32_t SEL114;
        stc_intc_sel_field_t SEL114_f;
    };
    union
    {
        __IO uint32_t SEL115;
        stc_intc_sel_field_t SEL115_f;
    };
    union
    {
        __IO uint32_t SEL116;
        stc_intc_sel_field_t SEL116_f;
    };
    union
    {
        __IO uint32_t SEL117;
        stc_intc_sel_field_t SEL117_f;
    };
    union
    {
        __IO uint32_t SEL118;
        stc_intc_sel_field_t SEL118_f;
    };
    union
    {
        __IO uint32_t SEL119;
        stc_intc_sel_field_t SEL119_f;
    };
    union
    {
        __IO uint32_t SEL120;
        stc_intc_sel_field_t SEL120_f;
    };
    union
    {
        __IO uint32_t SEL121;
        stc_intc_sel_field_t SEL121_f;
    };
    union
    {
        __IO uint32_t SEL122;
        stc_intc_sel_field_t SEL122_f;
    };
    union
    {
        __IO uint32_t SEL123;
        stc_intc_sel_field_t SEL123_f;
    };
    union
    {
        __IO uint32_t SEL124;
        stc_intc_sel_field_t SEL124_f;
    };
    union
    {
        __IO uint32_t SEL125;
        stc_intc_sel_field_t SEL125_f;
    };
    union
    {
        __IO uint32_t SEL126;
        stc_intc_sel_field_t SEL126_f;
    };
    union
    {
        __IO uint32_t SEL127;
        stc_intc_sel_field_t SEL127_f;
    };
    union
    {
        __IO uint32_t VSSEL128;
        stc_intc_vssel_field_t VSSEL128_f;
    };
    union
    {
        __IO uint32_t VSSEL129;
        stc_intc_vssel_field_t VSSEL129_f;
    };
    union
    {
        __IO uint32_t VSSEL130;
        stc_intc_vssel_field_t VSSEL130_f;
    };
    union
    {
        __IO uint32_t VSSEL131;
        stc_intc_vssel_field_t VSSEL131_f;
    };
    union
    {
        __IO uint32_t VSSEL132;
        stc_intc_vssel_field_t VSSEL132_f;
    };
    union
    {
        __IO uint32_t VSSEL133;
        stc_intc_vssel_field_t VSSEL133_f;
    };
    union
    {
        __IO uint32_t VSSEL134;
        stc_intc_vssel_field_t VSSEL134_f;
    };
    union
    {
        __IO uint32_t VSSEL135;
        stc_intc_vssel_field_t VSSEL135_f;
    };
    union
    {
        __IO uint32_t VSSEL136;
        stc_intc_vssel_field_t VSSEL136_f;
    };
    union
    {
        __IO uint32_t VSSEL137;
        stc_intc_vssel_field_t VSSEL137_f;
    };
    union
    {
        __IO uint32_t VSSEL138;
        stc_intc_vssel_field_t VSSEL138_f;
    };
    union
    {
        __IO uint32_t VSSEL139;
        stc_intc_vssel_field_t VSSEL139_f;
    };
    union
    {
        __IO uint32_t VSSEL140;
        stc_intc_vssel_field_t VSSEL140_f;
    };
    union
    {
        __IO uint32_t VSSEL141;
        stc_intc_vssel_field_t VSSEL141_f;
    };
    union
    {
        __IO uint32_t VSSEL142;
        stc_intc_vssel_field_t VSSEL142_f;
    };
    union
    {
        __IO uint32_t VSSEL143;
        stc_intc_vssel_field_t VSSEL143_f;
    };
    union
    {
        __IO uint32_t SWIER;
        stc_intc_swier_field_t SWIER_f;
    };
    union
    {
        __IO uint32_t EVTER;
        stc_intc_evter_field_t EVTER_f;
    };
    union
    {
        __IO uint32_t IER;
        stc_intc_ier_field_t IER_f;
    };
}M4_INTC_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t SCR;
        stc_keyscan_scr_field_t SCR_f;
    };
    union
    {
        __IO uint32_t SER;
        stc_keyscan_ser_field_t SER_f;
    };
    union
    {
        __IO uint32_t SSR;
        stc_keyscan_ssr_field_t SSR_f;
    };
}M4_KEYSCAN_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t RGD0;
        stc_mpu_rgd0_field_t RGD0_f;
    };
    union
    {
        __IO uint32_t RGD1;
        stc_mpu_rgd1_field_t RGD1_f;
    };
    union
    {
        __IO uint32_t RGD2;
        stc_mpu_rgd2_field_t RGD2_f;
    };
    union
    {
        __IO uint32_t RGD3;
        stc_mpu_rgd3_field_t RGD3_f;
    };
    union
    {
        __IO uint32_t RGD4;
        stc_mpu_rgd4_field_t RGD4_f;
    };
    union
    {
        __IO uint32_t RGD5;
        stc_mpu_rgd5_field_t RGD5_f;
    };
    union
    {
        __IO uint32_t RGD6;
        stc_mpu_rgd6_field_t RGD6_f;
    };
    union
    {
        __IO uint32_t RGD7;
        stc_mpu_rgd7_field_t RGD7_f;
    };
    union
    {
        __IO uint32_t RGD8;
        stc_mpu_rgd8_field_t RGD8_f;
    };
    union
    {
        __IO uint32_t RGD9;
        stc_mpu_rgd9_field_t RGD9_f;
    };
    union
    {
        __IO uint32_t RGD10;
        stc_mpu_rgd10_field_t RGD10_f;
    };
    union
    {
        __IO uint32_t RGD11;
        stc_mpu_rgd11_field_t RGD11_f;
    };
    union
    {
        __IO uint32_t RGD12;
        stc_mpu_rgd12_field_t RGD12_f;
    };
    union
    {
        __IO uint32_t RGD13;
        stc_mpu_rgd13_field_t RGD13_f;
    };
    union
    {
        __IO uint32_t RGD14;
        stc_mpu_rgd14_field_t RGD14_f;
    };
    union
    {
        __IO uint32_t RGD15;
        stc_mpu_rgd15_field_t RGD15_f;
    };
    union
    {
        __IO uint32_t RGCR0;
        stc_mpu_rgcr0_field_t RGCR0_f;
    };
    union
    {
        __IO uint32_t RGCR1;
        stc_mpu_rgcr1_field_t RGCR1_f;
    };
    union
    {
        __IO uint32_t RGCR2;
        stc_mpu_rgcr2_field_t RGCR2_f;
    };
    union
    {
        __IO uint32_t RGCR3;
        stc_mpu_rgcr3_field_t RGCR3_f;
    };
    union
    {
        __IO uint32_t RGCR4;
        stc_mpu_rgcr4_field_t RGCR4_f;
    };
    union
    {
        __IO uint32_t RGCR5;
        stc_mpu_rgcr5_field_t RGCR5_f;
    };
    union
    {
        __IO uint32_t RGCR6;
        stc_mpu_rgcr6_field_t RGCR6_f;
    };
    union
    {
        __IO uint32_t RGCR7;
        stc_mpu_rgcr7_field_t RGCR7_f;
    };
    union
    {
        __IO uint32_t RGCR8;
        stc_mpu_rgcr8_field_t RGCR8_f;
    };
    union
    {
        __IO uint32_t RGCR9;
        stc_mpu_rgcr9_field_t RGCR9_f;
    };
    union
    {
        __IO uint32_t RGCR10;
        stc_mpu_rgcr10_field_t RGCR10_f;
    };
    union
    {
        __IO uint32_t RGCR11;
        stc_mpu_rgcr11_field_t RGCR11_f;
    };
    union
    {
        __IO uint32_t RGCR12;
        stc_mpu_rgcr12_field_t RGCR12_f;
    };
    union
    {
        __IO uint32_t RGCR13;
        stc_mpu_rgcr13_field_t RGCR13_f;
    };
    union
    {
        __IO uint32_t RGCR14;
        stc_mpu_rgcr14_field_t RGCR14_f;
    };
    union
    {
        __IO uint32_t RGCR15;
        stc_mpu_rgcr15_field_t RGCR15_f;
    };
    union
    {
        __IO uint32_t CR;
        stc_mpu_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t SR;
        stc_mpu_sr_field_t SR_f;
    };
    union
    {
        __IO uint32_t ECLR;
        stc_mpu_eclr_field_t ECLR_f;
    };
    union
    {
        __IO uint32_t WP;
        stc_mpu_wp_field_t WP_f;
    };
}M4_MPU_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t FCG0;
        stc_mstp_fcg0_field_t FCG0_f;
    };
    union
    {
        __IO uint32_t FCG1;
        stc_mstp_fcg1_field_t FCG1_f;
    };
    union
    {
        __IO uint32_t FCG2;
        stc_mstp_fcg2_field_t FCG2_f;
    };
    union
    {
        __IO uint32_t FCG3;
        stc_mstp_fcg3_field_t FCG3_f;
    };
    union
    {
        __IO uint32_t FCG0PC;
        stc_mstp_fcg0pc_field_t FCG0PC_f;
    };
}M4_MSTP_TypeDef;

typedef struct
{
    union
    {
        __IO uint16_t CTL;
        stc_ots_ctl_field_t CTL_f;
    };
    union
    {
        __IO uint16_t DR1;
        stc_ots_dr1_field_t DR1_f;
    };
    union
    {
        __IO uint16_t DR2;
        stc_ots_dr2_field_t DR2_f;
    };
    union
    {
        __IO uint16_t ECR;
        stc_ots_ecr_field_t ECR_f;
    };
    union
    {
        __IO uint32_t LPR;
        stc_ots_lpr_field_t LPR_f;
    };
}M4_OTS_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t USBFS_SYCTLREG;
        stc_peric_usbfs_syctlreg_field_t USBFS_SYCTLREG_f;
    };
    union
    {
        __IO uint32_t SDIOC_SYCTLREG;
        stc_peric_sdioc_syctlreg_field_t SDIOC_SYCTLREG_f;
    };
}M4_PERIC_TypeDef;

