CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_ADC1_STR_STRT                               *((volatile unsigned int*)(0x42800000UL))
#define bM4_ADC1_CR0_MS0                                *((volatile unsigned int*)(0x42800040UL))
#define bM4_ADC1_CR0_MS1                                *((volatile unsigned int*)(0x42800044UL))
#define bM4_ADC1_CR0_ACCSEL0                            *((volatile unsigned int*)(0x42800050UL))
#define bM4_ADC1_CR0_ACCSEL1                            *((volatile unsigned int*)(0x42800054UL))
#define bM4_ADC1_CR0_CLREN                              *((volatile unsigned int*)(0x42800058UL))
#define bM4_ADC1_CR0_DFMT                               *((volatile unsigned int*)(0x4280005CUL))
#define bM4_ADC1_CR0_AVCNT0                             *((volatile unsigned int*)(0x42800060UL))
#define bM4_ADC1_CR0_AVCNT1                             *((volatile unsigned int*)(0x42800064UL))
#define bM4_ADC1_CR0_AVCNT2                             *((volatile unsigned int*)(0x42800068UL))
#define bM4_ADC1_CR1_RSCHSEL                            *((volatile unsigned int*)(0x42800088UL))
#define bM4_ADC1_TRGSR_TRGSELA0                         *((volatile unsigned int*)(0x42800140UL))
#define bM4_ADC1_TRGSR_TRGSELA1                         *((volatile unsigned int*)(0x42800144UL))
#define bM4_ADC1_TRGSR_TRGSELA2                         *((volatile unsigned int*)(0x42800148UL))
#define bM4_ADC1_TRGSR_TRGENA                           *((volatile unsigned int*)(0x4280015CUL))
#define bM4_ADC1_TRGSR_TRGSELB0                         *((volatile unsigned int*)(0x42800160UL))
#define bM4_ADC1_TRGSR_TRGSELB1                         *((volatile unsigned int*)(0x42800164UL))
#define bM4_ADC1_TRGSR_TRGSELB2                         *((volatile unsigned int*)(0x42800168UL))
#define bM4_ADC1_TRGSR_TRGENB                           *((volatile unsigned int*)(0x4280017CUL))
#define bM4_ADC1_CHSELRA1_CHSELA16                      *((volatile unsigned int*)(0x428001C0UL))
#define bM4_ADC1_CHSELRB1_CHSELB16                      *((volatile unsigned int*)(0x42800240UL))
#define bM4_ADC1_AVCHSELR1_AVCHSEL16                    *((volatile unsigned int*)(0x428002C0UL))
#define bM4_ADC1_CHMUXR0_CH00MUX0                       *((volatile unsigned int*)(0x42800700UL))
#define bM4_ADC1_CHMUXR0_CH00MUX1                       *((volatile unsigned int*)(0x42800704UL))
#define bM4_ADC1_CHMUXR0_CH00MUX2                       *((volatile unsigned int*)(0x42800708UL))
#define bM4_ADC1_CHMUXR0_CH00MUX3                       *((volatile unsigned int*)(0x4280070CUL))
#define bM4_ADC1_CHMUXR0_CH01MUX0                       *((volatile unsigned int*)(0x42800710UL))
#define bM4_ADC1_CHMUXR0_CH01MUX1                       *((volatile unsigned int*)(0x42800714UL))
#define bM4_ADC1_CHMUXR0_CH01MUX2                       *((volatile unsigned int*)(0x42800718UL))
#define bM4_ADC1_CHMUXR0_CH01MUX3                       *((volatile unsigned int*)(0x4280071CUL))
#define bM4_ADC1_CHMUXR0_CH02MUX0                       *((volatile unsigned int*)(0x42800720UL))
#define bM4_ADC1_CHMUXR0_CH02MUX1                       *((volatile unsigned int*)(0x42800724UL))
#define bM4_ADC1_CHMUXR0_CH02MUX2                       *((volatile unsigned int*)(0x42800728UL))
#define bM4_ADC1_CHMUXR0_CH02MUX3                       *((volatile unsigned int*)(0x4280072CUL))
#define bM4_ADC1_CHMUXR0_CH03MUX0                       *((volatile unsigned int*)(0x42800730UL))
#define bM4_ADC1_CHMUXR0_CH03MUX1                       *((volatile unsigned int*)(0x42800734UL))
#define bM4_ADC1_CHMUXR0_CH03MUX2                       *((volatile unsigned int*)(0x42800738UL))
#define bM4_ADC1_CHMUXR0_CH03MUX3                       *((volatile unsigned int*)(0x4280073CUL))
#define bM4_ADC1_CHMUXR1_CH04MUX0                       *((volatile unsigned int*)(0x42800740UL))
#define bM4_ADC1_CHMUXR1_CH04MUX1                       *((volatile unsigned int*)(0x42800744UL))
#define bM4_ADC1_CHMUXR1_CH04MUX2                       *((volatile unsigned int*)(0x42800748UL))
#define bM4_ADC1_CHMUXR1_CH04MUX3                       *((volatile unsigned int*)(0x4280074CUL))
#define bM4_ADC1_CHMUXR1_CH05MUX0                       *((volatile unsigned int*)(0x42800750UL))
#define bM4_ADC1_CHMUXR1_CH05MUX1                       *((volatile unsigned int*)(0x42800754UL))
#define bM4_ADC1_CHMUXR1_CH05MUX2                       *((volatile unsigned int*)(0x42800758UL))
#define bM4_ADC1_CHMUXR1_CH05MUX3                       *((volatile unsigned int*)(0x4280075CUL))
#define bM4_ADC1_CHMUXR1_CH06MUX0                       *((volatile unsigned int*)(0x42800760UL))
#define bM4_ADC1_CHMUXR1_CH06MUX1                       *((volatile unsigned int*)(0x42800764UL))
#define bM4_ADC1_CHMUXR1_CH06MUX2                       *((volatile unsigned int*)(0x42800768UL))
#define bM4_ADC1_CHMUXR1_CH06MUX3                       *((volatile unsigned int*)(0x4280076CUL))
#define bM4_ADC1_CHMUXR1_CH07MUX0                       *((volatile unsigned int*)(0x42800770UL))
#define bM4_ADC1_CHMUXR1_CH07MUX1                       *((volatile unsigned int*)(0x42800774UL))
#define bM4_ADC1_CHMUXR1_CH07MUX2                       *((volatile unsigned int*)(0x42800778UL))
#define bM4_ADC1_CHMUXR1_CH07MUX3                       *((volatile unsigned int*)(0x4280077CUL))
#define bM4_ADC1_CHMUXR2_CH08MUX0                       *((volatile unsigned int*)(0x42800780UL))
#define bM4_ADC1_CHMUXR2_CH08MUX1                       *((volatile unsigned int*)(0x42800784UL))
#define bM4_ADC1_CHMUXR2_CH08MUX2                       *((volatile unsigned int*)(0x42800788UL))
#define bM4_ADC1_CHMUXR2_CH08MUX3                       *((volatile unsigned int*)(0x4280078CUL))
#define bM4_ADC1_CHMUXR2_CH09MUX0                       *((volatile unsigned int*)(0x42800790UL))
#define bM4_ADC1_CHMUXR2_CH09MUX1                       *((volatile unsigned int*)(0x42800794UL))
#define bM4_ADC1_CHMUXR2_CH09MUX2                       *((volatile unsigned int*)(0x42800798UL))
#define bM4_ADC1_CHMUXR2_CH09MUX3                       *((volatile unsigned int*)(0x4280079CUL))
#define bM4_ADC1_CHMUXR2_CH10MUX0                       *((volatile unsigned int*)(0x428007A0UL))
#define bM4_ADC1_CHMUXR2_CH10MUX1                       *((volatile unsigned int*)(0x428007A4UL))
#define bM4_ADC1_CHMUXR2_CH10MUX2                       *((volatile unsigned int*)(0x428007A8UL))
#define bM4_ADC1_CHMUXR2_CH10MUX3                       *((volatile unsigned int*)(0x428007ACUL))
#define bM4_ADC1_CHMUXR2_CH11MUX0                       *((volatile unsigned int*)(0x428007B0UL))
#define bM4_ADC1_CHMUXR2_CH11MUX1                       *((volatile unsigned int*)(0x428007B4UL))
#define bM4_ADC1_CHMUXR2_CH11MUX2                       *((volatile unsigned int*)(0x428007B8UL))
#define bM4_ADC1_CHMUXR2_CH11MUX3                       *((volatile unsigned int*)(0x428007BCUL))
#define bM4_ADC1_CHMUXR3_CH12MUX0                       *((volatile unsigned int*)(0x428007C0UL))
#define bM4_ADC1_CHMUXR3_CH12MUX1                       *((volatile unsigned int*)(0x428007C4UL))
#define bM4_ADC1_CHMUXR3_CH12MUX2                       *((volatile unsigned int*)(0x428007C8UL))
#define bM4_ADC1_CHMUXR3_CH12MUX3                       *((volatile unsigned int*)(0x428007CCUL))
#define bM4_ADC1_CHMUXR3_CH13MUX0                       *((volatile unsigned int*)(0x428007D0UL))
#define bM4_ADC1_CHMUXR3_CH13MUX1                       *((volatile unsigned int*)(0x428007D4UL))
#define bM4_ADC1_CHMUXR3_CH13MUX2                       *((volatile unsigned int*)(0x428007D8UL))
#define bM4_ADC1_CHMUXR3_CH13MUX3                       *((volatile unsigned int*)(0x428007DCUL))
#define bM4_ADC1_CHMUXR3_CH14MUX0                       *((volatile unsigned int*)(0x428007E0UL))
#define bM4_ADC1_CHMUXR3_CH14MUX1                       *((volatile unsigned int*)(0x428007E4UL))
#define bM4_ADC1_CHMUXR3_CH14MUX2                       *((volatile unsigned int*)(0x428007E8UL))
#define bM4_ADC1_CHMUXR3_CH14MUX3                       *((volatile unsigned int*)(0x428007ECUL))
#define bM4_ADC1_CHMUXR3_CH15MUX0                       *((volatile unsigned int*)(0x428007F0UL))
#define bM4_ADC1_CHMUXR3_CH15MUX1                       *((volatile unsigned int*)(0x428007F4UL))
#define bM4_ADC1_CHMUXR3_CH15MUX2                       *((volatile unsigned int*)(0x428007F8UL))
#define bM4_ADC1_CHMUXR3_CH15MUX3                       *((volatile unsigned int*)(0x428007FCUL))
#define bM4_ADC1_ISR_EOCAF                              *((volatile unsigned int*)(0x428008C0UL))
#define bM4_ADC1_ISR_EOCBF                              *((volatile unsigned int*)(0x428008C4UL))
#define bM4_ADC1_ICR_EOCAIEN                            *((volatile unsigned int*)(0x428008E0UL))
#define bM4_ADC1_ICR_EOCBIEN                            *((volatile unsigned int*)(0x428008E4UL))
#define bM4_ADC1_SYNCCR_SYNCEN                          *((volatile unsigned int*)(0x42800980UL))
#define bM4_ADC1_SYNCCR_SYNCMD0                         *((volatile unsigned int*)(0x42800990UL))
#define bM4_ADC1_SYNCCR_SYNCMD1                         *((volatile unsigned int*)(0x42800994UL))
#define bM4_ADC1_SYNCCR_SYNCMD2                         *((volatile unsigned int*)(0x42800998UL))
#define bM4_ADC1_SYNCCR_SYNCDLY0                        *((volatile unsigned int*)(0x428009A0UL))
#define bM4_ADC1_SYNCCR_SYNCDLY1                        *((volatile unsigned int*)(0x428009A4UL))
#define bM4_ADC1_SYNCCR_SYNCDLY2                        *((volatile unsigned int*)(0x428009A8UL))
#define bM4_ADC1_SYNCCR_SYNCDLY3                        *((volatile unsigned int*)(0x428009ACUL))
#define bM4_ADC1_SYNCCR_SYNCDLY4                        *((volatile unsigned int*)(0x428009B0UL))
#define bM4_ADC1_SYNCCR_SYNCDLY5                        *((volatile unsigned int*)(0x428009B4UL))
#define bM4_ADC1_SYNCCR_SYNCDLY6                        *((volatile unsigned int*)(0x428009B8UL))
#define bM4_ADC1_SYNCCR_SYNCDLY7                        *((volatile unsigned int*)(0x428009BCUL))
#define bM4_ADC1_AWDCR_AWDEN                            *((volatile unsigned int*)(0x42801400UL))
#define bM4_ADC1_AWDCR_AWDMD                            *((volatile unsigned int*)(0x42801410UL))
#define bM4_ADC1_AWDCR_AWDSS0                           *((volatile unsigned int*)(0x42801418UL))
#define bM4_ADC1_AWDCR_AWDSS1                           *((volatile unsigned int*)(0x4280141CUL))
#define bM4_ADC1_AWDCR_AWDIEN                           *((volatile unsigned int*)(0x42801420UL))
#define bM4_ADC1_AWDCHSR1_AWDCH16                       *((volatile unsigned int*)(0x428015C0UL))
#define bM4_ADC1_AWDSR1_AWDF16                          *((volatile unsigned int*)(0x42801640UL))
#define bM4_ADC1_PGACR_PGACTL0                          *((volatile unsigned int*)(0x42801800UL))
#define bM4_ADC1_PGACR_PGACTL1                          *((volatile unsigned int*)(0x42801804UL))
#define bM4_ADC1_PGACR_PGACTL2                          *((volatile unsigned int*)(0x42801808UL))
#define bM4_ADC1_PGACR_PGACTL3                          *((volatile unsigned int*)(0x4280180CUL))
#define bM4_ADC1_PGAGSR_GAIN0                           *((volatile unsigned int*)(0x42801840UL))
#define bM4_ADC1_PGAGSR_GAIN1                           *((volatile unsigned int*)(0x42801844UL))
#define bM4_ADC1_PGAGSR_GAIN2                           *((volatile unsigned int*)(0x42801848UL))
#define bM4_ADC1_PGAGSR_GAIN3                           *((volatile unsigned int*)(0x4280184CUL))
#define bM4_ADC1_PGAINSR0_PGAINSEL0                     *((volatile unsigned int*)(0x42801980UL))
#define bM4_ADC1_PGAINSR0_PGAINSEL1                     *((volatile unsigned int*)(0x42801984UL))
#define bM4_ADC1_PGAINSR0_PGAINSEL2                     *((volatile unsigned int*)(0x42801988UL))
#define bM4_ADC1_PGAINSR0_PGAINSEL3                     *((volatile unsigned int*)(0x4280198CUL))
#define bM4_ADC1_PGAINSR0_PGAINSEL4                     *((volatile unsigned int*)(0x42801990UL))
#define bM4_ADC1_PGAINSR0_PGAINSEL5                     *((volatile unsigned int*)(0x42801994UL))
#define bM4_ADC1_PGAINSR0_PGAINSEL6                     *((volatile unsigned int*)(0x42801998UL))
#define bM4_ADC1_PGAINSR0_PGAINSEL7                     *((volatile unsigned int*)(0x4280199CUL))
#define bM4_ADC1_PGAINSR0_PGAINSEL8                     *((volatile unsigned int*)(0x428019A0UL))
#define bM4_ADC1_PGAINSR1_PGAVSSEN                      *((volatile unsigned int*)(0x428019C0UL))
#define bM4_ADC2_STR_STRT                               *((volatile unsigned int*)(0x42808000UL))
#define bM4_ADC2_CR0_MS0                                *((volatile unsigned int*)(0x42808040UL))
#define bM4_ADC2_CR0_MS1                                *((volatile unsigned int*)(0x42808044UL))
#define bM4_ADC2_CR0_ACCSEL0                            *((volatile unsigned int*)(0x42808050UL))
#define bM4_ADC2_CR0_ACCSEL1                            *((volatile unsigned int*)(0x42808054UL))
#define bM4_ADC2_CR0_CLREN                              *((volatile unsigned int*)(0x42808058UL))
#define bM4_ADC2_CR0_DFMT                               *((volatile unsigned int*)(0x4280805CUL))
#define bM4_ADC2_CR0_AVCNT0                             *((volatile unsigned int*)(0x42808060UL))
#define bM4_ADC2_CR0_AVCNT1                             *((volatile unsigned int*)(0x42808064UL))
#define bM4_ADC2_CR0_AVCNT2                             *((volatile unsigned int*)(0x42808068UL))
#define bM4_ADC2_CR1_RSCHSEL                            *((volatile unsigned int*)(0x42808088UL))
#define bM4_ADC2_TRGSR_TRGSELA0                         *((volatile unsigned int*)(0x42808140UL))
#define bM4_ADC2_TRGSR_TRGSELA1                         *((volatile unsigned int*)(0x42808144UL))
#define bM4_ADC2_TRGSR_TRGSELA2                         *((volatile unsigned int*)(0x42808148UL))
#define bM4_ADC2_TRGSR_TRGENA                           *((volatile unsigned int*)(0x4280815CUL))
#define bM4_ADC2_TRGSR_TRGSELB0                         *((volatile unsigned int*)(0x42808160UL))
#define bM4_ADC2_TRGSR_TRGSELB1                         *((volatile unsigned int*)(0x42808164UL))
#define bM4_ADC2_TRGSR_TRGSELB2                         *((volatile unsigned int*)(0x42808168UL))
#define bM4_ADC2_TRGSR_TRGENB                           *((volatile unsigned int*)(0x4280817CUL))
#define bM4_ADC2_CHSELRA1_CHSELA16                      *((volatile unsigned int*)(0x428081C0UL))
#define bM4_ADC2_CHSELRB1_CHSELB16                      *((volatile unsigned int*)(0x42808240UL))
#define bM4_ADC2_AVCHSELR1_AVCHSEL16                    *((volatile unsigned int*)(0x428082C0UL))
#define bM4_ADC2_CHMUXR0_CH00MUX0                       *((volatile unsigned int*)(0x42808700UL))
#define bM4_ADC2_CHMUXR0_CH00MUX1                       *((volatile unsigned int*)(0x42808704UL))
#define bM4_ADC2_CHMUXR0_CH00MUX2                       *((volatile unsigned int*)(0x42808708UL))
#define bM4_ADC2_CHMUXR0_CH00MUX3                       *((volatile unsigned int*)(0x4280870CUL))
#define bM4_ADC2_CHMUXR0_CH01MUX0                       *((volatile unsigned int*)(0x42808710UL))
#define bM4_ADC2_CHMUXR0_CH01MUX1                       *((volatile unsigned int*)(0x42808714UL))
#define bM4_ADC2_CHMUXR0_CH01MUX2                       *((volatile unsigned int*)(0x42808718UL))
#define bM4_ADC2_CHMUXR0_CH01MUX3                       *((volatile unsigned int*)(0x4280871CUL))
#define bM4_ADC2_CHMUXR0_CH02MUX0                       *((volatile unsigned int*)(0x42808720UL))
#define bM4_ADC2_CHMUXR0_CH02MUX1                       *((volatile unsigned int*)(0x42808724UL))
#define bM4_ADC2_CHMUXR0_CH02MUX2                       *((volatile unsigned int*)(0x42808728UL))
#define bM4_ADC2_CHMUXR0_CH02MUX3                       *((volatile unsigned int*)(0x4280872CUL))
#define bM4_ADC2_CHMUXR0_CH03MUX0                       *((volatile unsigned int*)(0x42808730UL))
#define bM4_ADC2_CHMUXR0_CH03MUX1                       *((volatile unsigned int*)(0x42808734UL))
#define bM4_ADC2_CHMUXR0_CH03MUX2                       *((volatile unsigned int*)(0x42808738UL))
#define bM4_ADC2_CHMUXR0_CH03MUX3                       *((volatile unsigned int*)(0x4280873CUL))
#define bM4_ADC2_CHMUXR1_CH04MUX0                       *((volatile unsigned int*)(0x42808740UL))
#define bM4_ADC2_CHMUXR1_CH04MUX1                       *((volatile unsigned int*)(0x42808744UL))
#define bM4_ADC2_CHMUXR1_CH04MUX2                       *((volatile unsigned int*)(0x42808748UL))
#define bM4_ADC2_CHMUXR1_CH04MUX3                       *((volatile unsigned int*)(0x4280874CUL))
#define bM4_ADC2_CHMUXR1_CH05MUX0                       *((volatile unsigned int*)(0x42808750UL))
#define bM4_ADC2_CHMUXR1_CH05MUX1                       *((volatile unsigned int*)(0x42808754UL))
#define bM4_ADC2_CHMUXR1_CH05MUX2                       *((volatile unsigned int*)(0x42808758UL))
#define bM4_ADC2_CHMUXR1_CH05MUX3                       *((volatile unsigned int*)(0x4280875CUL))
#define bM4_ADC2_CHMUXR1_CH06MUX0                       *((volatile unsigned int*)(0x42808760UL))
#define bM4_ADC2_CHMUXR1_CH06MUX1                       *((volatile unsigned int*)(0x42808764UL))
#define bM4_ADC2_CHMUXR1_CH06MUX2                       *((volatile unsigned int*)(0x42808768UL))
#define bM4_ADC2_CHMUXR1_CH06MUX3                       *((volatile unsigned int*)(0x4280876CUL))
#define bM4_ADC2_CHMUXR1_CH07MUX0                       *((volatile unsigned int*)(0x42808770UL))
#define bM4_ADC2_CHMUXR1_CH07MUX1                       *((volatile unsigned int*)(0x42808774UL))
#define bM4_ADC2_CHMUXR1_CH07MUX2                       *((volatile unsigned int*)(0x42808778UL))
#define bM4_ADC2_CHMUXR1_CH07MUX3                       *((volatile unsigned int*)(0x4280877CUL))
#define bM4_ADC2_CHMUXR2_CH08MUX0                       *((volatile unsigned int*)(0x42808780UL))
#define bM4_ADC2_CHMUXR2_CH08MUX1                       *((volatile unsigned int*)(0x42808784UL))
#define bM4_ADC2_CHMUXR2_CH08MUX2                       *((volatile unsigned int*)(0x42808788UL))
#define bM4_ADC2_CHMUXR2_CH08MUX3                       *((volatile unsigned int*)(0x4280878CUL))
#define bM4_ADC2_CHMUXR2_CH09MUX0                       *((volatile unsigned int*)(0x42808790UL))
#define bM4_ADC2_CHMUXR2_CH09MUX1                       *((volatile unsigned int*)(0x42808794UL))
#define bM4_ADC2_CHMUXR2_CH09MUX2                       *((volatile unsigned int*)(0x42808798UL))
#define bM4_ADC2_CHMUXR2_CH09MUX3                       *((volatile unsigned int*)(0x4280879CUL))
#define bM4_ADC2_CHMUXR2_CH10MUX0                       *((volatile unsigned int*)(0x428087A0UL))
#define bM4_ADC2_CHMUXR2_CH10MUX1                       *((volatile unsigned int*)(0x428087A4UL))
#define bM4_ADC2_CHMUXR2_CH10MUX2                       *((volatile unsigned int*)(0x428087A8UL))
#define bM4_ADC2_CHMUXR2_CH10MUX3                       *((volatile unsigned int*)(0x428087ACUL))
#define bM4_ADC2_CHMUXR2_CH11MUX0                       *((volatile unsigned int*)(0x428087B0UL))
#define bM4_ADC2_CHMUXR2_CH11MUX1                       *((volatile unsigned int*)(0x428087B4UL))
#define bM4_ADC2_CHMUXR2_CH11MUX2                       *((volatile unsigned int*)(0x428087B8UL))
#define bM4_ADC2_CHMUXR2_CH11MUX3                       *((volatile unsigned int*)(0x428087BCUL))
#define bM4_ADC2_CHMUXR3_CH12MUX0                       *((volatile unsigned int*)(0x428087C0UL))
#define bM4_ADC2_CHMUXR3_CH12MUX1                       *((volatile unsigned int*)(0x428087C4UL))
#define bM4_ADC2_CHMUXR3_CH12MUX2                       *((volatile unsigned int*)(0x428087C8UL))
#define bM4_ADC2_CHMUXR3_CH12MUX3                       *((volatile unsigned int*)(0x428087CCUL))
#define bM4_ADC2_CHMUXR3_CH13MUX0                       *((volatile unsigned int*)(0x428087D0UL))
#define bM4_ADC2_CHMUXR3_CH13MUX1                       *((volatile unsigned int*)(0x428087D4UL))
#define bM4_ADC2_CHMUXR3_CH13MUX2                       *((volatile unsigned int*)(0x428087D8UL))
#define bM4_ADC2_CHMUXR3_CH13MUX3                       *((volatile unsigned int*)(0x428087DCUL))
#define bM4_ADC2_CHMUXR3_CH14MUX0                       *((volatile unsigned int*)(0x428087E0UL))
#define bM4_ADC2_CHMUXR3_CH14MUX1                       *((volatile unsigned int*)(0x428087E4UL))
#define bM4_ADC2_CHMUXR3_CH14MUX2                       *((volatile unsigned int*)(0x428087E8UL))
#define bM4_ADC2_CHMUXR3_CH14MUX3                       *((volatile unsigned int*)(0x428087ECUL))
#define bM4_ADC2_CHMUXR3_CH15MUX0                       *((volatile unsigned int*)(0x428087F0UL))
#define bM4_ADC2_CHMUXR3_CH15MUX1                       *((volatile unsigned int*)(0x428087F4UL))
#define bM4_ADC2_CHMUXR3_CH15MUX2                       *((volatile unsigned int*)(0x428087F8UL))
#define bM4_ADC2_CHMUXR3_CH15MUX3                       *((volatile unsigned int*)(0x428087FCUL))
#define bM4_ADC2_ISR_EOCAF                              *((volatile unsigned int*)(0x428088C0UL))
#define bM4_ADC2_ISR_EOCBF                              *((volatile unsigned int*)(0x428088C4UL))
#define bM4_ADC2_ICR_EOCAIEN                            *((volatile unsigned int*)(0x428088E0UL))
#define bM4_ADC2_ICR_EOCBIEN                            *((volatile unsigned int*)(0x428088E4UL))
#define bM4_ADC2_SYNCCR_SYNCEN                          *((volatile unsigned int*)(0x42808980UL))
#define bM4_ADC2_SYNCCR_SYNCMD0                         *((volatile unsigned int*)(0x42808990UL))
#define bM4_ADC2_SYNCCR_SYNCMD1                         *((volatile unsigned int*)(0x42808994UL))
#define bM4_ADC2_SYNCCR_SYNCMD2                         *((volatile unsigned int*)(0x42808998UL))
#define bM4_ADC2_SYNCCR_SYNCDLY0                        *((volatile unsigned int*)(0x428089A0UL))
#define bM4_ADC2_SYNCCR_SYNCDLY1                        *((volatile unsigned int*)(0x428089A4UL))
#define bM4_ADC2_SYNCCR_SYNCDLY2                        *((volatile unsigned int*)(0x428089A8UL))
#define bM4_ADC2_SYNCCR_SYNCDLY3                        *((volatile unsigned int*)(0x428089ACUL))
#define bM4_ADC2_SYNCCR_SYNCDLY4                        *((volatile unsigned int*)(0x428089B0UL))
#define bM4_ADC2_SYNCCR_SYNCDLY5                        *((volatile unsigned int*)(0x428089B4UL))
#define bM4_ADC2_SYNCCR_SYNCDLY6                        *((volatile unsigned int*)(0x428089B8UL))
#define bM4_ADC2_SYNCCR_SYNCDLY7                        *((volatile unsigned int*)(0x428089BCUL))
#define bM4_ADC2_AWDCR_AWDEN                            *((volatile unsigned int*)(0x42809400UL))
#define bM4_ADC2_AWDCR_AWDMD                            *((volatile unsigned int*)(0x42809410UL))
#define bM4_ADC2_AWDCR_AWDSS0                           *((volatile unsigned int*)(0x42809418UL))
#define bM4_ADC2_AWDCR_AWDSS1                           *((volatile unsigned int*)(0x4280941CUL))
#define bM4_ADC2_AWDCR_AWDIEN                           *((volatile unsigned int*)(0x42809420UL))
#define bM4_ADC2_AWDCHSR1_AWDCH16                       *((volatile unsigned int*)(0x428095C0UL))
#define bM4_ADC2_AWDSR1_AWDF16                          *((volatile unsigned int*)(0x42809640UL))
#define bM4_ADC2_PGACR_PGACTL0                          *((volatile unsigned int*)(0x42809800UL))
#define bM4_ADC2_PGACR_PGACTL1                          *((volatile unsigned int*)(0x42809804UL))
#define bM4_ADC2_PGACR_PGACTL2                          *((volatile unsigned int*)(0x42809808UL))
#define bM4_ADC2_PGACR_PGACTL3                          *((volatile unsigned int*)(0x4280980CUL))
#define bM4_ADC2_PGAGSR_GAIN0                           *((volatile unsigned int*)(0x42809840UL))
#define bM4_ADC2_PGAGSR_GAIN1                           *((volatile unsigned int*)(0x42809844UL))
#define bM4_ADC2_PGAGSR_GAIN2                           *((volatile unsigned int*)(0x42809848UL))
#define bM4_ADC2_PGAGSR_GAIN3                           *((volatile unsigned int*)(0x4280984CUL))
