CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_ADC2_PGAINSR0_PGAINSEL0                     *((volatile unsigned int*)(0x42809980UL))
#define bM4_ADC2_PGAINSR0_PGAINSEL1                     *((volatile unsigned int*)(0x42809984UL))
#define bM4_ADC2_PGAINSR0_PGAINSEL2                     *((volatile unsigned int*)(0x42809988UL))
#define bM4_ADC2_PGAINSR0_PGAINSEL3                     *((volatile unsigned int*)(0x4280998CUL))
#define bM4_ADC2_PGAINSR0_PGAINSEL4                     *((volatile unsigned int*)(0x42809990UL))
#define bM4_ADC2_PGAINSR0_PGAINSEL5                     *((volatile unsigned int*)(0x42809994UL))
#define bM4_ADC2_PGAINSR0_PGAINSEL6                     *((volatile unsigned int*)(0x42809998UL))
#define bM4_ADC2_PGAINSR0_PGAINSEL7                     *((volatile unsigned int*)(0x4280999CUL))
#define bM4_ADC2_PGAINSR0_PGAINSEL8                     *((volatile unsigned int*)(0x428099A0UL))
#define bM4_ADC2_PGAINSR1_PGAVSSEN                      *((volatile unsigned int*)(0x428099C0UL))
#define bM4_AES_CR_START                                *((volatile unsigned int*)(0x42100000UL))
#define bM4_AES_CR_MODE                                 *((volatile unsigned int*)(0x42100004UL))
#define bM4_AOS_INT_SFTTRG_STRG                         *((volatile unsigned int*)(0x42210000UL))
#define bM4_AOS_DCU1_TRGSEL_TRGSEL0                     *((volatile unsigned int*)(0x42210080UL))
#define bM4_AOS_DCU1_TRGSEL_TRGSEL1                     *((volatile unsigned int*)(0x42210084UL))
#define bM4_AOS_DCU1_TRGSEL_TRGSEL2                     *((volatile unsigned int*)(0x42210088UL))
#define bM4_AOS_DCU1_TRGSEL_TRGSEL3                     *((volatile unsigned int*)(0x4221008CUL))
#define bM4_AOS_DCU1_TRGSEL_TRGSEL4                     *((volatile unsigned int*)(0x42210090UL))
#define bM4_AOS_DCU1_TRGSEL_TRGSEL5                     *((volatile unsigned int*)(0x42210094UL))
#define bM4_AOS_DCU1_TRGSEL_TRGSEL6                     *((volatile unsigned int*)(0x42210098UL))
#define bM4_AOS_DCU1_TRGSEL_TRGSEL7                     *((volatile unsigned int*)(0x4221009CUL))
#define bM4_AOS_DCU1_TRGSEL_TRGSEL8                     *((volatile unsigned int*)(0x422100A0UL))
#define bM4_AOS_DCU2_TRGSEL_TRGSEL0                     *((volatile unsigned int*)(0x42210100UL))
#define bM4_AOS_DCU2_TRGSEL_TRGSEL1                     *((volatile unsigned int*)(0x42210104UL))
#define bM4_AOS_DCU2_TRGSEL_TRGSEL2                     *((volatile unsigned int*)(0x42210108UL))
#define bM4_AOS_DCU2_TRGSEL_TRGSEL3                     *((volatile unsigned int*)(0x4221010CUL))
#define bM4_AOS_DCU2_TRGSEL_TRGSEL4                     *((volatile unsigned int*)(0x42210110UL))
#define bM4_AOS_DCU2_TRGSEL_TRGSEL5                     *((volatile unsigned int*)(0x42210114UL))
#define bM4_AOS_DCU2_TRGSEL_TRGSEL6                     *((volatile unsigned int*)(0x42210118UL))
#define bM4_AOS_DCU2_TRGSEL_TRGSEL7                     *((volatile unsigned int*)(0x4221011CUL))
#define bM4_AOS_DCU2_TRGSEL_TRGSEL8                     *((volatile unsigned int*)(0x42210120UL))
#define bM4_AOS_DCU3_TRGSEL_TRGSEL0                     *((volatile unsigned int*)(0x42210180UL))
#define bM4_AOS_DCU3_TRGSEL_TRGSEL1                     *((volatile unsigned int*)(0x42210184UL))
#define bM4_AOS_DCU3_TRGSEL_TRGSEL2                     *((volatile unsigned int*)(0x42210188UL))
#define bM4_AOS_DCU3_TRGSEL_TRGSEL3                     *((volatile unsigned int*)(0x4221018CUL))
#define bM4_AOS_DCU3_TRGSEL_TRGSEL4                     *((volatile unsigned int*)(0x42210190UL))
#define bM4_AOS_DCU3_TRGSEL_TRGSEL5                     *((volatile unsigned int*)(0x42210194UL))
#define bM4_AOS_DCU3_TRGSEL_TRGSEL6                     *((volatile unsigned int*)(0x42210198UL))
#define bM4_AOS_DCU3_TRGSEL_TRGSEL7                     *((volatile unsigned int*)(0x4221019CUL))
#define bM4_AOS_DCU3_TRGSEL_TRGSEL8                     *((volatile unsigned int*)(0x422101A0UL))
#define bM4_AOS_DCU4_TRGSEL_TRGSEL0                     *((volatile unsigned int*)(0x42210200UL))
#define bM4_AOS_DCU4_TRGSEL_TRGSEL1                     *((volatile unsigned int*)(0x42210204UL))
#define bM4_AOS_DCU4_TRGSEL_TRGSEL2                     *((volatile unsigned int*)(0x42210208UL))
#define bM4_AOS_DCU4_TRGSEL_TRGSEL3                     *((volatile unsigned int*)(0x4221020CUL))
#define bM4_AOS_DCU4_TRGSEL_TRGSEL4                     *((volatile unsigned int*)(0x42210210UL))
#define bM4_AOS_DCU4_TRGSEL_TRGSEL5                     *((volatile unsigned int*)(0x42210214UL))
#define bM4_AOS_DCU4_TRGSEL_TRGSEL6                     *((volatile unsigned int*)(0x42210218UL))
#define bM4_AOS_DCU4_TRGSEL_TRGSEL7                     *((volatile unsigned int*)(0x4221021CUL))
#define bM4_AOS_DCU4_TRGSEL_TRGSEL8                     *((volatile unsigned int*)(0x42210220UL))
#define bM4_AOS_DMA1_TRGSEL0_TRGSEL0                    *((volatile unsigned int*)(0x42210280UL))
#define bM4_AOS_DMA1_TRGSEL0_TRGSEL1                    *((volatile unsigned int*)(0x42210284UL))
#define bM4_AOS_DMA1_TRGSEL0_TRGSEL2                    *((volatile unsigned int*)(0x42210288UL))
#define bM4_AOS_DMA1_TRGSEL0_TRGSEL3                    *((volatile unsigned int*)(0x4221028CUL))
#define bM4_AOS_DMA1_TRGSEL0_TRGSEL4                    *((volatile unsigned int*)(0x42210290UL))
#define bM4_AOS_DMA1_TRGSEL0_TRGSEL5                    *((volatile unsigned int*)(0x42210294UL))
#define bM4_AOS_DMA1_TRGSEL0_TRGSEL6                    *((volatile unsigned int*)(0x42210298UL))
#define bM4_AOS_DMA1_TRGSEL0_TRGSEL7                    *((volatile unsigned int*)(0x4221029CUL))
#define bM4_AOS_DMA1_TRGSEL0_TRGSEL8                    *((volatile unsigned int*)(0x422102A0UL))
#define bM4_AOS_DMA1_TRGSEL1_TRGSEL0                    *((volatile unsigned int*)(0x42210300UL))
#define bM4_AOS_DMA1_TRGSEL1_TRGSEL1                    *((volatile unsigned int*)(0x42210304UL))
#define bM4_AOS_DMA1_TRGSEL1_TRGSEL2                    *((volatile unsigned int*)(0x42210308UL))
#define bM4_AOS_DMA1_TRGSEL1_TRGSEL3                    *((volatile unsigned int*)(0x4221030CUL))
#define bM4_AOS_DMA1_TRGSEL1_TRGSEL4                    *((volatile unsigned int*)(0x42210310UL))
#define bM4_AOS_DMA1_TRGSEL1_TRGSEL5                    *((volatile unsigned int*)(0x42210314UL))
#define bM4_AOS_DMA1_TRGSEL1_TRGSEL6                    *((volatile unsigned int*)(0x42210318UL))
#define bM4_AOS_DMA1_TRGSEL1_TRGSEL7                    *((volatile unsigned int*)(0x4221031CUL))
#define bM4_AOS_DMA1_TRGSEL1_TRGSEL8                    *((volatile unsigned int*)(0x42210320UL))
#define bM4_AOS_DMA1_TRGSEL2_TRGSEL0                    *((volatile unsigned int*)(0x42210380UL))
#define bM4_AOS_DMA1_TRGSEL2_TRGSEL1                    *((volatile unsigned int*)(0x42210384UL))
#define bM4_AOS_DMA1_TRGSEL2_TRGSEL2                    *((volatile unsigned int*)(0x42210388UL))
#define bM4_AOS_DMA1_TRGSEL2_TRGSEL3                    *((volatile unsigned int*)(0x4221038CUL))
#define bM4_AOS_DMA1_TRGSEL2_TRGSEL4                    *((volatile unsigned int*)(0x42210390UL))
#define bM4_AOS_DMA1_TRGSEL2_TRGSEL5                    *((volatile unsigned int*)(0x42210394UL))
#define bM4_AOS_DMA1_TRGSEL2_TRGSEL6                    *((volatile unsigned int*)(0x42210398UL))
#define bM4_AOS_DMA1_TRGSEL2_TRGSEL7                    *((volatile unsigned int*)(0x4221039CUL))
#define bM4_AOS_DMA1_TRGSEL2_TRGSEL8                    *((volatile unsigned int*)(0x422103A0UL))
#define bM4_AOS_DMA1_TRGSEL3_TRGSEL0                    *((volatile unsigned int*)(0x42210400UL))
#define bM4_AOS_DMA1_TRGSEL3_TRGSEL1                    *((volatile unsigned int*)(0x42210404UL))
#define bM4_AOS_DMA1_TRGSEL3_TRGSEL2                    *((volatile unsigned int*)(0x42210408UL))
#define bM4_AOS_DMA1_TRGSEL3_TRGSEL3                    *((volatile unsigned int*)(0x4221040CUL))
#define bM4_AOS_DMA1_TRGSEL3_TRGSEL4                    *((volatile unsigned int*)(0x42210410UL))
#define bM4_AOS_DMA1_TRGSEL3_TRGSEL5                    *((volatile unsigned int*)(0x42210414UL))
#define bM4_AOS_DMA1_TRGSEL3_TRGSEL6                    *((volatile unsigned int*)(0x42210418UL))
#define bM4_AOS_DMA1_TRGSEL3_TRGSEL7                    *((volatile unsigned int*)(0x4221041CUL))
#define bM4_AOS_DMA1_TRGSEL3_TRGSEL8                    *((volatile unsigned int*)(0x42210420UL))
#define bM4_AOS_DMA2_TRGSEL0_TRGSEL0                    *((volatile unsigned int*)(0x42210480UL))
#define bM4_AOS_DMA2_TRGSEL0_TRGSEL1                    *((volatile unsigned int*)(0x42210484UL))
#define bM4_AOS_DMA2_TRGSEL0_TRGSEL2                    *((volatile unsigned int*)(0x42210488UL))
#define bM4_AOS_DMA2_TRGSEL0_TRGSEL3                    *((volatile unsigned int*)(0x4221048CUL))
#define bM4_AOS_DMA2_TRGSEL0_TRGSEL4                    *((volatile unsigned int*)(0x42210490UL))
#define bM4_AOS_DMA2_TRGSEL0_TRGSEL5                    *((volatile unsigned int*)(0x42210494UL))
#define bM4_AOS_DMA2_TRGSEL0_TRGSEL6                    *((volatile unsigned int*)(0x42210498UL))
#define bM4_AOS_DMA2_TRGSEL0_TRGSEL7                    *((volatile unsigned int*)(0x4221049CUL))
#define bM4_AOS_DMA2_TRGSEL0_TRGSEL8                    *((volatile unsigned int*)(0x422104A0UL))
#define bM4_AOS_DMA2_TRGSEL1_TRGSEL0                    *((volatile unsigned int*)(0x42210500UL))
#define bM4_AOS_DMA2_TRGSEL1_TRGSEL1                    *((volatile unsigned int*)(0x42210504UL))
#define bM4_AOS_DMA2_TRGSEL1_TRGSEL2                    *((volatile unsigned int*)(0x42210508UL))
#define bM4_AOS_DMA2_TRGSEL1_TRGSEL3                    *((volatile unsigned int*)(0x4221050CUL))
#define bM4_AOS_DMA2_TRGSEL1_TRGSEL4                    *((volatile unsigned int*)(0x42210510UL))
#define bM4_AOS_DMA2_TRGSEL1_TRGSEL5                    *((volatile unsigned int*)(0x42210514UL))
#define bM4_AOS_DMA2_TRGSEL1_TRGSEL6                    *((volatile unsigned int*)(0x42210518UL))
#define bM4_AOS_DMA2_TRGSEL1_TRGSEL7                    *((volatile unsigned int*)(0x4221051CUL))
#define bM4_AOS_DMA2_TRGSEL1_TRGSEL8                    *((volatile unsigned int*)(0x42210520UL))
#define bM4_AOS_DMA2_TRGSEL2_TRGSEL0                    *((volatile unsigned int*)(0x42210580UL))
#define bM4_AOS_DMA2_TRGSEL2_TRGSEL1                    *((volatile unsigned int*)(0x42210584UL))
#define bM4_AOS_DMA2_TRGSEL2_TRGSEL2                    *((volatile unsigned int*)(0x42210588UL))
#define bM4_AOS_DMA2_TRGSEL2_TRGSEL3                    *((volatile unsigned int*)(0x4221058CUL))
#define bM4_AOS_DMA2_TRGSEL2_TRGSEL4                    *((volatile unsigned int*)(0x42210590UL))
#define bM4_AOS_DMA2_TRGSEL2_TRGSEL5                    *((volatile unsigned int*)(0x42210594UL))
#define bM4_AOS_DMA2_TRGSEL2_TRGSEL6                    *((volatile unsigned int*)(0x42210598UL))
#define bM4_AOS_DMA2_TRGSEL2_TRGSEL7                    *((volatile unsigned int*)(0x4221059CUL))
#define bM4_AOS_DMA2_TRGSEL2_TRGSEL8                    *((volatile unsigned int*)(0x422105A0UL))
#define bM4_AOS_DMA2_TRGSEL3_TRGSEL0                    *((volatile unsigned int*)(0x42210600UL))
#define bM4_AOS_DMA2_TRGSEL3_TRGSEL1                    *((volatile unsigned int*)(0x42210604UL))
#define bM4_AOS_DMA2_TRGSEL3_TRGSEL2                    *((volatile unsigned int*)(0x42210608UL))
#define bM4_AOS_DMA2_TRGSEL3_TRGSEL3                    *((volatile unsigned int*)(0x4221060CUL))
#define bM4_AOS_DMA2_TRGSEL3_TRGSEL4                    *((volatile unsigned int*)(0x42210610UL))
#define bM4_AOS_DMA2_TRGSEL3_TRGSEL5                    *((volatile unsigned int*)(0x42210614UL))
#define bM4_AOS_DMA2_TRGSEL3_TRGSEL6                    *((volatile unsigned int*)(0x42210618UL))
#define bM4_AOS_DMA2_TRGSEL3_TRGSEL7                    *((volatile unsigned int*)(0x4221061CUL))
#define bM4_AOS_DMA2_TRGSEL3_TRGSEL8                    *((volatile unsigned int*)(0x42210620UL))
#define bM4_AOS_DMATRGSELRC_TRGSEL0                     *((volatile unsigned int*)(0x42210680UL))
#define bM4_AOS_DMATRGSELRC_TRGSEL1                     *((volatile unsigned int*)(0x42210684UL))
#define bM4_AOS_DMATRGSELRC_TRGSEL2                     *((volatile unsigned int*)(0x42210688UL))
#define bM4_AOS_DMATRGSELRC_TRGSEL3                     *((volatile unsigned int*)(0x4221068CUL))
#define bM4_AOS_DMATRGSELRC_TRGSEL4                     *((volatile unsigned int*)(0x42210690UL))
#define bM4_AOS_DMATRGSELRC_TRGSEL5                     *((volatile unsigned int*)(0x42210694UL))
#define bM4_AOS_DMATRGSELRC_TRGSEL6                     *((volatile unsigned int*)(0x42210698UL))
#define bM4_AOS_DMATRGSELRC_TRGSEL7                     *((volatile unsigned int*)(0x4221069CUL))
#define bM4_AOS_DMATRGSELRC_TRGSEL8                     *((volatile unsigned int*)(0x422106A0UL))
#define bM4_AOS_TMR6_HTSSR1_TRGSEL0                     *((volatile unsigned int*)(0x42210700UL))
#define bM4_AOS_TMR6_HTSSR1_TRGSEL1                     *((volatile unsigned int*)(0x42210704UL))
#define bM4_AOS_TMR6_HTSSR1_TRGSEL2                     *((volatile unsigned int*)(0x42210708UL))
#define bM4_AOS_TMR6_HTSSR1_TRGSEL3                     *((volatile unsigned int*)(0x4221070CUL))
#define bM4_AOS_TMR6_HTSSR1_TRGSEL4                     *((volatile unsigned int*)(0x42210710UL))
#define bM4_AOS_TMR6_HTSSR1_TRGSEL5                     *((volatile unsigned int*)(0x42210714UL))
#define bM4_AOS_TMR6_HTSSR1_TRGSEL6                     *((volatile unsigned int*)(0x42210718UL))
#define bM4_AOS_TMR6_HTSSR1_TRGSEL7                     *((volatile unsigned int*)(0x4221071CUL))
#define bM4_AOS_TMR6_HTSSR1_TRGSEL8                     *((volatile unsigned int*)(0x42210720UL))
#define bM4_AOS_TMR6_HTSSR2_TRGSEL0                     *((volatile unsigned int*)(0x42210780UL))
#define bM4_AOS_TMR6_HTSSR2_TRGSEL1                     *((volatile unsigned int*)(0x42210784UL))
#define bM4_AOS_TMR6_HTSSR2_TRGSEL2                     *((volatile unsigned int*)(0x42210788UL))
#define bM4_AOS_TMR6_HTSSR2_TRGSEL3                     *((volatile unsigned int*)(0x4221078CUL))
#define bM4_AOS_TMR6_HTSSR2_TRGSEL4                     *((volatile unsigned int*)(0x42210790UL))
#define bM4_AOS_TMR6_HTSSR2_TRGSEL5                     *((volatile unsigned int*)(0x42210794UL))
#define bM4_AOS_TMR6_HTSSR2_TRGSEL6                     *((volatile unsigned int*)(0x42210798UL))
#define bM4_AOS_TMR6_HTSSR2_TRGSEL7                     *((volatile unsigned int*)(0x4221079CUL))
#define bM4_AOS_TMR6_HTSSR2_TRGSEL8                     *((volatile unsigned int*)(0x422107A0UL))
#define bM4_AOS_TMR0_HTSSR_TRGSEL0                      *((volatile unsigned int*)(0x42210800UL))
#define bM4_AOS_TMR0_HTSSR_TRGSEL1                      *((volatile unsigned int*)(0x42210804UL))
#define bM4_AOS_TMR0_HTSSR_TRGSEL2                      *((volatile unsigned int*)(0x42210808UL))
#define bM4_AOS_TMR0_HTSSR_TRGSEL3                      *((volatile unsigned int*)(0x4221080CUL))
#define bM4_AOS_TMR0_HTSSR_TRGSEL4                      *((volatile unsigned int*)(0x42210810UL))
#define bM4_AOS_TMR0_HTSSR_TRGSEL5                      *((volatile unsigned int*)(0x42210814UL))
#define bM4_AOS_TMR0_HTSSR_TRGSEL6                      *((volatile unsigned int*)(0x42210818UL))
#define bM4_AOS_TMR0_HTSSR_TRGSEL7                      *((volatile unsigned int*)(0x4221081CUL))
#define bM4_AOS_TMR0_HTSSR_TRGSEL8                      *((volatile unsigned int*)(0x42210820UL))
#define bM4_AOS_PORT_PEVNTTRGSR12_TRGSEL0               *((volatile unsigned int*)(0x42210880UL))
#define bM4_AOS_PORT_PEVNTTRGSR12_TRGSEL1               *((volatile unsigned int*)(0x42210884UL))
#define bM4_AOS_PORT_PEVNTTRGSR12_TRGSEL2               *((volatile unsigned int*)(0x42210888UL))
#define bM4_AOS_PORT_PEVNTTRGSR12_TRGSEL3               *((volatile unsigned int*)(0x4221088CUL))
#define bM4_AOS_PORT_PEVNTTRGSR12_TRGSEL4               *((volatile unsigned int*)(0x42210890UL))
#define bM4_AOS_PORT_PEVNTTRGSR12_TRGSEL5               *((volatile unsigned int*)(0x42210894UL))
#define bM4_AOS_PORT_PEVNTTRGSR12_TRGSEL6               *((volatile unsigned int*)(0x42210898UL))
#define bM4_AOS_PORT_PEVNTTRGSR12_TRGSEL7               *((volatile unsigned int*)(0x4221089CUL))
#define bM4_AOS_PORT_PEVNTTRGSR12_TRGSEL8               *((volatile unsigned int*)(0x422108A0UL))
#define bM4_AOS_PORT_PEVNTTRGSR34_TRGSEL0               *((volatile unsigned int*)(0x42210900UL))
#define bM4_AOS_PORT_PEVNTTRGSR34_TRGSEL1               *((volatile unsigned int*)(0x42210904UL))
#define bM4_AOS_PORT_PEVNTTRGSR34_TRGSEL2               *((volatile unsigned int*)(0x42210908UL))
#define bM4_AOS_PORT_PEVNTTRGSR34_TRGSEL3               *((volatile unsigned int*)(0x4221090CUL))
#define bM4_AOS_PORT_PEVNTTRGSR34_TRGSEL4               *((volatile unsigned int*)(0x42210910UL))
#define bM4_AOS_PORT_PEVNTTRGSR34_TRGSEL5               *((volatile unsigned int*)(0x42210914UL))
#define bM4_AOS_PORT_PEVNTTRGSR34_TRGSEL6               *((volatile unsigned int*)(0x42210918UL))
#define bM4_AOS_PORT_PEVNTTRGSR34_TRGSEL7               *((volatile unsigned int*)(0x4221091CUL))
#define bM4_AOS_PORT_PEVNTTRGSR34_TRGSEL8               *((volatile unsigned int*)(0x42210920UL))
#define bM4_AOS_TMRA_HTSSR0_TRGSEL0                     *((volatile unsigned int*)(0x42210980UL))
#define bM4_AOS_TMRA_HTSSR0_TRGSEL1                     *((volatile unsigned int*)(0x42210984UL))
#define bM4_AOS_TMRA_HTSSR0_TRGSEL2                     *((volatile unsigned int*)(0x42210988UL))
#define bM4_AOS_TMRA_HTSSR0_TRGSEL3                     *((volatile unsigned int*)(0x4221098CUL))
#define bM4_AOS_TMRA_HTSSR0_TRGSEL4                     *((volatile unsigned int*)(0x42210990UL))
#define bM4_AOS_TMRA_HTSSR0_TRGSEL5                     *((volatile unsigned int*)(0x42210994UL))
#define bM4_AOS_TMRA_HTSSR0_TRGSEL6                     *((volatile unsigned int*)(0x42210998UL))
#define bM4_AOS_TMRA_HTSSR0_TRGSEL7                     *((volatile unsigned int*)(0x4221099CUL))
#define bM4_AOS_TMRA_HTSSR0_TRGSEL8                     *((volatile unsigned int*)(0x422109A0UL))
#define bM4_AOS_TMRA_HTSSR1_TRGSEL0                     *((volatile unsigned int*)(0x42210A00UL))
#define bM4_AOS_TMRA_HTSSR1_TRGSEL1                     *((volatile unsigned int*)(0x42210A04UL))
#define bM4_AOS_TMRA_HTSSR1_TRGSEL2                     *((volatile unsigned int*)(0x42210A08UL))
#define bM4_AOS_TMRA_HTSSR1_TRGSEL3                     *((volatile unsigned int*)(0x42210A0CUL))
#define bM4_AOS_TMRA_HTSSR1_TRGSEL4                     *((volatile unsigned int*)(0x42210A10UL))
#define bM4_AOS_TMRA_HTSSR1_TRGSEL5                     *((volatile unsigned int*)(0x42210A14UL))
#define bM4_AOS_TMRA_HTSSR1_TRGSEL6                     *((volatile unsigned int*)(0x42210A18UL))
#define bM4_AOS_TMRA_HTSSR1_TRGSEL7                     *((volatile unsigned int*)(0x42210A1CUL))
#define bM4_AOS_TMRA_HTSSR1_TRGSEL8                     *((volatile unsigned int*)(0x42210A20UL))
#define bM4_AOS_OTS_TRG_TRGSEL0                         *((volatile unsigned int*)(0x42210A80UL))
#define bM4_AOS_OTS_TRG_TRGSEL1                         *((volatile unsigned int*)(0x42210A84UL))
#define bM4_AOS_OTS_TRG_TRGSEL2                         *((volatile unsigned int*)(0x42210A88UL))
#define bM4_AOS_OTS_TRG_TRGSEL3                         *((volatile unsigned int*)(0x42210A8CUL))
#define bM4_AOS_OTS_TRG_TRGSEL4                         *((volatile unsigned int*)(0x42210A90UL))
#define bM4_AOS_OTS_TRG_TRGSEL5                         *((volatile unsigned int*)(0x42210A94UL))
#define bM4_AOS_OTS_TRG_TRGSEL6                         *((volatile unsigned int*)(0x42210A98UL))
#define bM4_AOS_OTS_TRG_TRGSEL7                         *((volatile unsigned int*)(0x42210A9CUL))
#define bM4_AOS_OTS_TRG_TRGSEL8                         *((volatile unsigned int*)(0x42210AA0UL))
#define bM4_AOS_ADC1_ITRGSELR0_TRGSEL0                  *((volatile unsigned int*)(0x42210B00UL))
#define bM4_AOS_ADC1_ITRGSELR0_TRGSEL1                  *((volatile unsigned int*)(0x42210B04UL))
#define bM4_AOS_ADC1_ITRGSELR0_TRGSEL2                  *((volatile unsigned int*)(0x42210B08UL))
#define bM4_AOS_ADC1_ITRGSELR0_TRGSEL3                  *((volatile unsigned int*)(0x42210B0CUL))
#define bM4_AOS_ADC1_ITRGSELR0_TRGSEL4                  *((volatile unsigned int*)(0x42210B10UL))
#define bM4_AOS_ADC1_ITRGSELR0_TRGSEL5                  *((volatile unsigned int*)(0x42210B14UL))
#define bM4_AOS_ADC1_ITRGSELR0_TRGSEL6                  *((volatile unsigned int*)(0x42210B18UL))
#define bM4_AOS_ADC1_ITRGSELR0_TRGSEL7                  *((volatile unsigned int*)(0x42210B1CUL))
#define bM4_AOS_ADC1_ITRGSELR0_TRGSEL8                  *((volatile unsigned int*)(0x42210B20UL))
#define bM4_AOS_ADC1_ITRGSELR1_TRGSEL0                  *((volatile unsigned int*)(0x42210B80UL))
#define bM4_AOS_ADC1_ITRGSELR1_TRGSEL1                  *((volatile unsigned int*)(0x42210B84UL))
#define bM4_AOS_ADC1_ITRGSELR1_TRGSEL2                  *((volatile unsigned int*)(0x42210B88UL))
#define bM4_AOS_ADC1_ITRGSELR1_TRGSEL3                  *((volatile unsigned int*)(0x42210B8CUL))
#define bM4_AOS_ADC1_ITRGSELR1_TRGSEL4                  *((volatile unsigned int*)(0x42210B90UL))
#define bM4_AOS_ADC1_ITRGSELR1_TRGSEL5                  *((volatile unsigned int*)(0x42210B94UL))
#define bM4_AOS_ADC1_ITRGSELR1_TRGSEL6                  *((volatile unsigned int*)(0x42210B98UL))
#define bM4_AOS_ADC1_ITRGSELR1_TRGSEL7                  *((volatile unsigned int*)(0x42210B9CUL))
#define bM4_AOS_ADC1_ITRGSELR1_TRGSEL8                  *((volatile unsigned int*)(0x42210BA0UL))
#define bM4_AOS_ADC2_ITRGSELR0_TRGSEL0                  *((volatile unsigned int*)(0x42210C00UL))
#define bM4_AOS_ADC2_ITRGSELR0_TRGSEL1                  *((volatile unsigned int*)(0x42210C04UL))
#define bM4_AOS_ADC2_ITRGSELR0_TRGSEL2                  *((volatile unsigned int*)(0x42210C08UL))
#define bM4_AOS_ADC2_ITRGSELR0_TRGSEL3                  *((volatile unsigned int*)(0x42210C0CUL))
#define bM4_AOS_ADC2_ITRGSELR0_TRGSEL4                  *((volatile unsigned int*)(0x42210C10UL))
#define bM4_AOS_ADC2_ITRGSELR0_TRGSEL5                  *((volatile unsigned int*)(0x42210C14UL))
#define bM4_AOS_ADC2_ITRGSELR0_TRGSEL6                  *((volatile unsigned int*)(0x42210C18UL))
#define bM4_AOS_ADC2_ITRGSELR0_TRGSEL7                  *((volatile unsigned int*)(0x42210C1CUL))
#define bM4_AOS_ADC2_ITRGSELR0_TRGSEL8                  *((volatile unsigned int*)(0x42210C20UL))
#define bM4_AOS_ADC2_ITRGSELR1_TRGSEL0                  *((volatile unsigned int*)(0x42210C80UL))
#define bM4_AOS_ADC2_ITRGSELR1_TRGSEL1                  *((volatile unsigned int*)(0x42210C84UL))
#define bM4_AOS_ADC2_ITRGSELR1_TRGSEL2                  *((volatile unsigned int*)(0x42210C88UL))
#define bM4_AOS_ADC2_ITRGSELR1_TRGSEL3                  *((volatile unsigned int*)(0x42210C8CUL))
#define bM4_AOS_ADC2_ITRGSELR1_TRGSEL4                  *((volatile unsigned int*)(0x42210C90UL))
#define bM4_AOS_ADC2_ITRGSELR1_TRGSEL5                  *((volatile unsigned int*)(0x42210C94UL))
#define bM4_AOS_ADC2_ITRGSELR1_TRGSEL6                  *((volatile unsigned int*)(0x42210C98UL))
#define bM4_AOS_ADC2_ITRGSELR1_TRGSEL7                  *((volatile unsigned int*)(0x42210C9CUL))
#define bM4_AOS_ADC2_ITRGSELR1_TRGSEL8                  *((volatile unsigned int*)(0x42210CA0UL))
#define bM4_AOS_COMTRG1_TRGSEL0                         *((volatile unsigned int*)(0x42210D00UL))
#define bM4_AOS_COMTRG1_TRGSEL1                         *((volatile unsigned int*)(0x42210D04UL))
#define bM4_AOS_COMTRG1_TRGSEL2                         *((volatile unsigned int*)(0x42210D08UL))
#define bM4_AOS_COMTRG1_TRGSEL3                         *((volatile unsigned int*)(0x42210D0CUL))
#define bM4_AOS_COMTRG1_TRGSEL4                         *((volatile unsigned int*)(0x42210D10UL))
#define bM4_AOS_COMTRG1_TRGSEL5                         *((volatile unsigned int*)(0x42210D14UL))
