CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_AOS_PEVNTDIRR3_PDIR04                       *((volatile unsigned int*)(0x42212710UL))
#define bM4_AOS_PEVNTDIRR3_PDIR05                       *((volatile unsigned int*)(0x42212714UL))
#define bM4_AOS_PEVNTDIRR3_PDIR06                       *((volatile unsigned int*)(0x42212718UL))
#define bM4_AOS_PEVNTDIRR3_PDIR07                       *((volatile unsigned int*)(0x4221271CUL))
#define bM4_AOS_PEVNTDIRR3_PDIR08                       *((volatile unsigned int*)(0x42212720UL))
#define bM4_AOS_PEVNTDIRR3_PDIR09                       *((volatile unsigned int*)(0x42212724UL))
#define bM4_AOS_PEVNTDIRR3_PDIR10                       *((volatile unsigned int*)(0x42212728UL))
#define bM4_AOS_PEVNTDIRR3_PDIR11                       *((volatile unsigned int*)(0x4221272CUL))
#define bM4_AOS_PEVNTDIRR3_PDIR12                       *((volatile unsigned int*)(0x42212730UL))
#define bM4_AOS_PEVNTDIRR3_PDIR13                       *((volatile unsigned int*)(0x42212734UL))
#define bM4_AOS_PEVNTDIRR3_PDIR14                       *((volatile unsigned int*)(0x42212738UL))
#define bM4_AOS_PEVNTDIRR3_PDIR15                       *((volatile unsigned int*)(0x4221273CUL))
#define bM4_AOS_PEVNTIDR3_PIN00                         *((volatile unsigned int*)(0x42212780UL))
#define bM4_AOS_PEVNTIDR3_PIN01                         *((volatile unsigned int*)(0x42212784UL))
#define bM4_AOS_PEVNTIDR3_PIN02                         *((volatile unsigned int*)(0x42212788UL))
#define bM4_AOS_PEVNTIDR3_PIN03                         *((volatile unsigned int*)(0x4221278CUL))
#define bM4_AOS_PEVNTIDR3_PIN04                         *((volatile unsigned int*)(0x42212790UL))
#define bM4_AOS_PEVNTIDR3_PIN05                         *((volatile unsigned int*)(0x42212794UL))
#define bM4_AOS_PEVNTIDR3_PIN06                         *((volatile unsigned int*)(0x42212798UL))
#define bM4_AOS_PEVNTIDR3_PIN07                         *((volatile unsigned int*)(0x4221279CUL))
#define bM4_AOS_PEVNTIDR3_PIN08                         *((volatile unsigned int*)(0x422127A0UL))
#define bM4_AOS_PEVNTIDR3_PIN09                         *((volatile unsigned int*)(0x422127A4UL))
#define bM4_AOS_PEVNTIDR3_PIN10                         *((volatile unsigned int*)(0x422127A8UL))
#define bM4_AOS_PEVNTIDR3_PIN11                         *((volatile unsigned int*)(0x422127ACUL))
#define bM4_AOS_PEVNTIDR3_PIN12                         *((volatile unsigned int*)(0x422127B0UL))
#define bM4_AOS_PEVNTIDR3_PIN13                         *((volatile unsigned int*)(0x422127B4UL))
#define bM4_AOS_PEVNTIDR3_PIN14                         *((volatile unsigned int*)(0x422127B8UL))
#define bM4_AOS_PEVNTIDR3_PIN15                         *((volatile unsigned int*)(0x422127BCUL))
#define bM4_AOS_PEVNTODR3_POUT00                        *((volatile unsigned int*)(0x42212800UL))
#define bM4_AOS_PEVNTODR3_POUT01                        *((volatile unsigned int*)(0x42212804UL))
#define bM4_AOS_PEVNTODR3_POUT02                        *((volatile unsigned int*)(0x42212808UL))
#define bM4_AOS_PEVNTODR3_POUT03                        *((volatile unsigned int*)(0x4221280CUL))
#define bM4_AOS_PEVNTODR3_POUT04                        *((volatile unsigned int*)(0x42212810UL))
#define bM4_AOS_PEVNTODR3_POUT05                        *((volatile unsigned int*)(0x42212814UL))
#define bM4_AOS_PEVNTODR3_POUT06                        *((volatile unsigned int*)(0x42212818UL))
#define bM4_AOS_PEVNTODR3_POUT07                        *((volatile unsigned int*)(0x4221281CUL))
#define bM4_AOS_PEVNTODR3_POUT08                        *((volatile unsigned int*)(0x42212820UL))
#define bM4_AOS_PEVNTODR3_POUT09                        *((volatile unsigned int*)(0x42212824UL))
#define bM4_AOS_PEVNTODR3_POUT10                        *((volatile unsigned int*)(0x42212828UL))
#define bM4_AOS_PEVNTODR3_POUT11                        *((volatile unsigned int*)(0x4221282CUL))
#define bM4_AOS_PEVNTODR3_POUT12                        *((volatile unsigned int*)(0x42212830UL))
#define bM4_AOS_PEVNTODR3_POUT13                        *((volatile unsigned int*)(0x42212834UL))
#define bM4_AOS_PEVNTODR3_POUT14                        *((volatile unsigned int*)(0x42212838UL))
#define bM4_AOS_PEVNTODR3_POUT15                        *((volatile unsigned int*)(0x4221283CUL))
#define bM4_AOS_PEVNTORR3_POR00                         *((volatile unsigned int*)(0x42212880UL))
#define bM4_AOS_PEVNTORR3_POR01                         *((volatile unsigned int*)(0x42212884UL))
#define bM4_AOS_PEVNTORR3_POR02                         *((volatile unsigned int*)(0x42212888UL))
#define bM4_AOS_PEVNTORR3_POR03                         *((volatile unsigned int*)(0x4221288CUL))
#define bM4_AOS_PEVNTORR3_POR04                         *((volatile unsigned int*)(0x42212890UL))
#define bM4_AOS_PEVNTORR3_POR05                         *((volatile unsigned int*)(0x42212894UL))
#define bM4_AOS_PEVNTORR3_POR06                         *((volatile unsigned int*)(0x42212898UL))
#define bM4_AOS_PEVNTORR3_POR07                         *((volatile unsigned int*)(0x4221289CUL))
#define bM4_AOS_PEVNTORR3_POR08                         *((volatile unsigned int*)(0x422128A0UL))
#define bM4_AOS_PEVNTORR3_POR09                         *((volatile unsigned int*)(0x422128A4UL))
#define bM4_AOS_PEVNTORR3_POR10                         *((volatile unsigned int*)(0x422128A8UL))
#define bM4_AOS_PEVNTORR3_POR11                         *((volatile unsigned int*)(0x422128ACUL))
#define bM4_AOS_PEVNTORR3_POR12                         *((volatile unsigned int*)(0x422128B0UL))
#define bM4_AOS_PEVNTORR3_POR13                         *((volatile unsigned int*)(0x422128B4UL))
#define bM4_AOS_PEVNTORR3_POR14                         *((volatile unsigned int*)(0x422128B8UL))
#define bM4_AOS_PEVNTORR3_POR15                         *((volatile unsigned int*)(0x422128BCUL))
#define bM4_AOS_PEVNTOSR3_POS00                         *((volatile unsigned int*)(0x42212900UL))
#define bM4_AOS_PEVNTOSR3_POS01                         *((volatile unsigned int*)(0x42212904UL))
#define bM4_AOS_PEVNTOSR3_POS02                         *((volatile unsigned int*)(0x42212908UL))
#define bM4_AOS_PEVNTOSR3_POS03                         *((volatile unsigned int*)(0x4221290CUL))
#define bM4_AOS_PEVNTOSR3_POS04                         *((volatile unsigned int*)(0x42212910UL))
#define bM4_AOS_PEVNTOSR3_POS05                         *((volatile unsigned int*)(0x42212914UL))
#define bM4_AOS_PEVNTOSR3_POS06                         *((volatile unsigned int*)(0x42212918UL))
#define bM4_AOS_PEVNTOSR3_POS07                         *((volatile unsigned int*)(0x4221291CUL))
#define bM4_AOS_PEVNTOSR3_POS08                         *((volatile unsigned int*)(0x42212920UL))
#define bM4_AOS_PEVNTOSR3_POS09                         *((volatile unsigned int*)(0x42212924UL))
#define bM4_AOS_PEVNTOSR3_POS10                         *((volatile unsigned int*)(0x42212928UL))
#define bM4_AOS_PEVNTOSR3_POS11                         *((volatile unsigned int*)(0x4221292CUL))
#define bM4_AOS_PEVNTOSR3_POS12                         *((volatile unsigned int*)(0x42212930UL))
#define bM4_AOS_PEVNTOSR3_POS13                         *((volatile unsigned int*)(0x42212934UL))
#define bM4_AOS_PEVNTOSR3_POS14                         *((volatile unsigned int*)(0x42212938UL))
#define bM4_AOS_PEVNTOSR3_POS15                         *((volatile unsigned int*)(0x4221293CUL))
#define bM4_AOS_PEVNTRISR3_RIS00                        *((volatile unsigned int*)(0x42212980UL))
#define bM4_AOS_PEVNTRISR3_RIS01                        *((volatile unsigned int*)(0x42212984UL))
#define bM4_AOS_PEVNTRISR3_RIS02                        *((volatile unsigned int*)(0x42212988UL))
#define bM4_AOS_PEVNTRISR3_RIS03                        *((volatile unsigned int*)(0x4221298CUL))
#define bM4_AOS_PEVNTRISR3_RIS04                        *((volatile unsigned int*)(0x42212990UL))
#define bM4_AOS_PEVNTRISR3_RIS05                        *((volatile unsigned int*)(0x42212994UL))
#define bM4_AOS_PEVNTRISR3_RIS06                        *((volatile unsigned int*)(0x42212998UL))
#define bM4_AOS_PEVNTRISR3_RIS07                        *((volatile unsigned int*)(0x4221299CUL))
#define bM4_AOS_PEVNTRISR3_RIS08                        *((volatile unsigned int*)(0x422129A0UL))
#define bM4_AOS_PEVNTRISR3_RIS09                        *((volatile unsigned int*)(0x422129A4UL))
#define bM4_AOS_PEVNTRISR3_RIS10                        *((volatile unsigned int*)(0x422129A8UL))
#define bM4_AOS_PEVNTRISR3_RIS11                        *((volatile unsigned int*)(0x422129ACUL))
#define bM4_AOS_PEVNTRISR3_RIS12                        *((volatile unsigned int*)(0x422129B0UL))
#define bM4_AOS_PEVNTRISR3_RIS13                        *((volatile unsigned int*)(0x422129B4UL))
#define bM4_AOS_PEVNTRISR3_RIS14                        *((volatile unsigned int*)(0x422129B8UL))
#define bM4_AOS_PEVNTRISR3_RIS15                        *((volatile unsigned int*)(0x422129BCUL))
#define bM4_AOS_PEVNTFAL3_FAL00                         *((volatile unsigned int*)(0x42212A00UL))
#define bM4_AOS_PEVNTFAL3_FAL01                         *((volatile unsigned int*)(0x42212A04UL))
#define bM4_AOS_PEVNTFAL3_FAL02                         *((volatile unsigned int*)(0x42212A08UL))
#define bM4_AOS_PEVNTFAL3_FAL03                         *((volatile unsigned int*)(0x42212A0CUL))
#define bM4_AOS_PEVNTFAL3_FAL04                         *((volatile unsigned int*)(0x42212A10UL))
#define bM4_AOS_PEVNTFAL3_FAL05                         *((volatile unsigned int*)(0x42212A14UL))
#define bM4_AOS_PEVNTFAL3_FAL06                         *((volatile unsigned int*)(0x42212A18UL))
#define bM4_AOS_PEVNTFAL3_FAL07                         *((volatile unsigned int*)(0x42212A1CUL))
#define bM4_AOS_PEVNTFAL3_FAL08                         *((volatile unsigned int*)(0x42212A20UL))
#define bM4_AOS_PEVNTFAL3_FAL09                         *((volatile unsigned int*)(0x42212A24UL))
#define bM4_AOS_PEVNTFAL3_FAL10                         *((volatile unsigned int*)(0x42212A28UL))
#define bM4_AOS_PEVNTFAL3_FAL11                         *((volatile unsigned int*)(0x42212A2CUL))
#define bM4_AOS_PEVNTFAL3_FAL12                         *((volatile unsigned int*)(0x42212A30UL))
#define bM4_AOS_PEVNTFAL3_FAL13                         *((volatile unsigned int*)(0x42212A34UL))
#define bM4_AOS_PEVNTFAL3_FAL14                         *((volatile unsigned int*)(0x42212A38UL))
#define bM4_AOS_PEVNTFAL3_FAL15                         *((volatile unsigned int*)(0x42212A3CUL))
#define bM4_AOS_PEVNTDIRR4_PDIR00                       *((volatile unsigned int*)(0x42212A80UL))
#define bM4_AOS_PEVNTDIRR4_PDIR01                       *((volatile unsigned int*)(0x42212A84UL))
#define bM4_AOS_PEVNTDIRR4_PDIR02                       *((volatile unsigned int*)(0x42212A88UL))
#define bM4_AOS_PEVNTDIRR4_PDIR03                       *((volatile unsigned int*)(0x42212A8CUL))
#define bM4_AOS_PEVNTDIRR4_PDIR04                       *((volatile unsigned int*)(0x42212A90UL))
#define bM4_AOS_PEVNTDIRR4_PDIR05                       *((volatile unsigned int*)(0x42212A94UL))
#define bM4_AOS_PEVNTDIRR4_PDIR06                       *((volatile unsigned int*)(0x42212A98UL))
#define bM4_AOS_PEVNTDIRR4_PDIR07                       *((volatile unsigned int*)(0x42212A9CUL))
#define bM4_AOS_PEVNTDIRR4_PDIR08                       *((volatile unsigned int*)(0x42212AA0UL))
#define bM4_AOS_PEVNTDIRR4_PDIR09                       *((volatile unsigned int*)(0x42212AA4UL))
#define bM4_AOS_PEVNTDIRR4_PDIR10                       *((volatile unsigned int*)(0x42212AA8UL))
#define bM4_AOS_PEVNTDIRR4_PDIR11                       *((volatile unsigned int*)(0x42212AACUL))
#define bM4_AOS_PEVNTDIRR4_PDIR12                       *((volatile unsigned int*)(0x42212AB0UL))
#define bM4_AOS_PEVNTDIRR4_PDIR13                       *((volatile unsigned int*)(0x42212AB4UL))
#define bM4_AOS_PEVNTDIRR4_PDIR14                       *((volatile unsigned int*)(0x42212AB8UL))
#define bM4_AOS_PEVNTDIRR4_PDIR15                       *((volatile unsigned int*)(0x42212ABCUL))
#define bM4_AOS_PEVNTIDR4_PIN00                         *((volatile unsigned int*)(0x42212B00UL))
#define bM4_AOS_PEVNTIDR4_PIN01                         *((volatile unsigned int*)(0x42212B04UL))
#define bM4_AOS_PEVNTIDR4_PIN02                         *((volatile unsigned int*)(0x42212B08UL))
#define bM4_AOS_PEVNTIDR4_PIN03                         *((volatile unsigned int*)(0x42212B0CUL))
#define bM4_AOS_PEVNTIDR4_PIN04                         *((volatile unsigned int*)(0x42212B10UL))
#define bM4_AOS_PEVNTIDR4_PIN05                         *((volatile unsigned int*)(0x42212B14UL))
#define bM4_AOS_PEVNTIDR4_PIN06                         *((volatile unsigned int*)(0x42212B18UL))
#define bM4_AOS_PEVNTIDR4_PIN07                         *((volatile unsigned int*)(0x42212B1CUL))
#define bM4_AOS_PEVNTIDR4_PIN08                         *((volatile unsigned int*)(0x42212B20UL))
#define bM4_AOS_PEVNTIDR4_PIN09                         *((volatile unsigned int*)(0x42212B24UL))
#define bM4_AOS_PEVNTIDR4_PIN10                         *((volatile unsigned int*)(0x42212B28UL))
#define bM4_AOS_PEVNTIDR4_PIN11                         *((volatile unsigned int*)(0x42212B2CUL))
#define bM4_AOS_PEVNTIDR4_PIN12                         *((volatile unsigned int*)(0x42212B30UL))
#define bM4_AOS_PEVNTIDR4_PIN13                         *((volatile unsigned int*)(0x42212B34UL))
#define bM4_AOS_PEVNTIDR4_PIN14                         *((volatile unsigned int*)(0x42212B38UL))
#define bM4_AOS_PEVNTIDR4_PIN15                         *((volatile unsigned int*)(0x42212B3CUL))
#define bM4_AOS_PEVNTODR4_POUT00                        *((volatile unsigned int*)(0x42212B80UL))
#define bM4_AOS_PEVNTODR4_POUT01                        *((volatile unsigned int*)(0x42212B84UL))
#define bM4_AOS_PEVNTODR4_POUT02                        *((volatile unsigned int*)(0x42212B88UL))
#define bM4_AOS_PEVNTODR4_POUT03                        *((volatile unsigned int*)(0x42212B8CUL))
#define bM4_AOS_PEVNTODR4_POUT04                        *((volatile unsigned int*)(0x42212B90UL))
#define bM4_AOS_PEVNTODR4_POUT05                        *((volatile unsigned int*)(0x42212B94UL))
#define bM4_AOS_PEVNTODR4_POUT06                        *((volatile unsigned int*)(0x42212B98UL))
#define bM4_AOS_PEVNTODR4_POUT07                        *((volatile unsigned int*)(0x42212B9CUL))
#define bM4_AOS_PEVNTODR4_POUT08                        *((volatile unsigned int*)(0x42212BA0UL))
#define bM4_AOS_PEVNTODR4_POUT09                        *((volatile unsigned int*)(0x42212BA4UL))
#define bM4_AOS_PEVNTODR4_POUT10                        *((volatile unsigned int*)(0x42212BA8UL))
#define bM4_AOS_PEVNTODR4_POUT11                        *((volatile unsigned int*)(0x42212BACUL))
#define bM4_AOS_PEVNTODR4_POUT12                        *((volatile unsigned int*)(0x42212BB0UL))
#define bM4_AOS_PEVNTODR4_POUT13                        *((volatile unsigned int*)(0x42212BB4UL))
#define bM4_AOS_PEVNTODR4_POUT14                        *((volatile unsigned int*)(0x42212BB8UL))
#define bM4_AOS_PEVNTODR4_POUT15                        *((volatile unsigned int*)(0x42212BBCUL))
#define bM4_AOS_PEVNTORR4_POR00                         *((volatile unsigned int*)(0x42212C00UL))
#define bM4_AOS_PEVNTORR4_POR01                         *((volatile unsigned int*)(0x42212C04UL))
#define bM4_AOS_PEVNTORR4_POR02                         *((volatile unsigned int*)(0x42212C08UL))
#define bM4_AOS_PEVNTORR4_POR03                         *((volatile unsigned int*)(0x42212C0CUL))
#define bM4_AOS_PEVNTORR4_POR04                         *((volatile unsigned int*)(0x42212C10UL))
#define bM4_AOS_PEVNTORR4_POR05                         *((volatile unsigned int*)(0x42212C14UL))
#define bM4_AOS_PEVNTORR4_POR06                         *((volatile unsigned int*)(0x42212C18UL))
#define bM4_AOS_PEVNTORR4_POR07                         *((volatile unsigned int*)(0x42212C1CUL))
#define bM4_AOS_PEVNTORR4_POR08                         *((volatile unsigned int*)(0x42212C20UL))
#define bM4_AOS_PEVNTORR4_POR09                         *((volatile unsigned int*)(0x42212C24UL))
#define bM4_AOS_PEVNTORR4_POR10                         *((volatile unsigned int*)(0x42212C28UL))
#define bM4_AOS_PEVNTORR4_POR11                         *((volatile unsigned int*)(0x42212C2CUL))
#define bM4_AOS_PEVNTORR4_POR12                         *((volatile unsigned int*)(0x42212C30UL))
#define bM4_AOS_PEVNTORR4_POR13                         *((volatile unsigned int*)(0x42212C34UL))
#define bM4_AOS_PEVNTORR4_POR14                         *((volatile unsigned int*)(0x42212C38UL))
#define bM4_AOS_PEVNTORR4_POR15                         *((volatile unsigned int*)(0x42212C3CUL))
#define bM4_AOS_PEVNTOSR4_POS00                         *((volatile unsigned int*)(0x42212C80UL))
#define bM4_AOS_PEVNTOSR4_POS01                         *((volatile unsigned int*)(0x42212C84UL))
#define bM4_AOS_PEVNTOSR4_POS02                         *((volatile unsigned int*)(0x42212C88UL))
#define bM4_AOS_PEVNTOSR4_POS03                         *((volatile unsigned int*)(0x42212C8CUL))
#define bM4_AOS_PEVNTOSR4_POS04                         *((volatile unsigned int*)(0x42212C90UL))
#define bM4_AOS_PEVNTOSR4_POS05                         *((volatile unsigned int*)(0x42212C94UL))
#define bM4_AOS_PEVNTOSR4_POS06                         *((volatile unsigned int*)(0x42212C98UL))
#define bM4_AOS_PEVNTOSR4_POS07                         *((volatile unsigned int*)(0x42212C9CUL))
#define bM4_AOS_PEVNTOSR4_POS08                         *((volatile unsigned int*)(0x42212CA0UL))
#define bM4_AOS_PEVNTOSR4_POS09                         *((volatile unsigned int*)(0x42212CA4UL))
#define bM4_AOS_PEVNTOSR4_POS10                         *((volatile unsigned int*)(0x42212CA8UL))
#define bM4_AOS_PEVNTOSR4_POS11                         *((volatile unsigned int*)(0x42212CACUL))
#define bM4_AOS_PEVNTOSR4_POS12                         *((volatile unsigned int*)(0x42212CB0UL))
#define bM4_AOS_PEVNTOSR4_POS13                         *((volatile unsigned int*)(0x42212CB4UL))
#define bM4_AOS_PEVNTOSR4_POS14                         *((volatile unsigned int*)(0x42212CB8UL))
#define bM4_AOS_PEVNTOSR4_POS15                         *((volatile unsigned int*)(0x42212CBCUL))
#define bM4_AOS_PEVNTRISR4_RIS00                        *((volatile unsigned int*)(0x42212D00UL))
#define bM4_AOS_PEVNTRISR4_RIS01                        *((volatile unsigned int*)(0x42212D04UL))
#define bM4_AOS_PEVNTRISR4_RIS02                        *((volatile unsigned int*)(0x42212D08UL))
#define bM4_AOS_PEVNTRISR4_RIS03                        *((volatile unsigned int*)(0x42212D0CUL))
#define bM4_AOS_PEVNTRISR4_RIS04                        *((volatile unsigned int*)(0x42212D10UL))
#define bM4_AOS_PEVNTRISR4_RIS05                        *((volatile unsigned int*)(0x42212D14UL))
#define bM4_AOS_PEVNTRISR4_RIS06                        *((volatile unsigned int*)(0x42212D18UL))
#define bM4_AOS_PEVNTRISR4_RIS07                        *((volatile unsigned int*)(0x42212D1CUL))
#define bM4_AOS_PEVNTRISR4_RIS08                        *((volatile unsigned int*)(0x42212D20UL))
#define bM4_AOS_PEVNTRISR4_RIS09                        *((volatile unsigned int*)(0x42212D24UL))
#define bM4_AOS_PEVNTRISR4_RIS10                        *((volatile unsigned int*)(0x42212D28UL))
#define bM4_AOS_PEVNTRISR4_RIS11                        *((volatile unsigned int*)(0x42212D2CUL))
#define bM4_AOS_PEVNTRISR4_RIS12                        *((volatile unsigned int*)(0x42212D30UL))
#define bM4_AOS_PEVNTRISR4_RIS13                        *((volatile unsigned int*)(0x42212D34UL))
#define bM4_AOS_PEVNTRISR4_RIS14                        *((volatile unsigned int*)(0x42212D38UL))
#define bM4_AOS_PEVNTRISR4_RIS15                        *((volatile unsigned int*)(0x42212D3CUL))
#define bM4_AOS_PEVNTFAL4_FAL00                         *((volatile unsigned int*)(0x42212D80UL))
#define bM4_AOS_PEVNTFAL4_FAL01                         *((volatile unsigned int*)(0x42212D84UL))
#define bM4_AOS_PEVNTFAL4_FAL02                         *((volatile unsigned int*)(0x42212D88UL))
#define bM4_AOS_PEVNTFAL4_FAL03                         *((volatile unsigned int*)(0x42212D8CUL))
#define bM4_AOS_PEVNTFAL4_FAL04                         *((volatile unsigned int*)(0x42212D90UL))
#define bM4_AOS_PEVNTFAL4_FAL05                         *((volatile unsigned int*)(0x42212D94UL))
#define bM4_AOS_PEVNTFAL4_FAL06                         *((volatile unsigned int*)(0x42212D98UL))
#define bM4_AOS_PEVNTFAL4_FAL07                         *((volatile unsigned int*)(0x42212D9CUL))
#define bM4_AOS_PEVNTFAL4_FAL08                         *((volatile unsigned int*)(0x42212DA0UL))
#define bM4_AOS_PEVNTFAL4_FAL09                         *((volatile unsigned int*)(0x42212DA4UL))
#define bM4_AOS_PEVNTFAL4_FAL10                         *((volatile unsigned int*)(0x42212DA8UL))
#define bM4_AOS_PEVNTFAL4_FAL11                         *((volatile unsigned int*)(0x42212DACUL))
#define bM4_AOS_PEVNTFAL4_FAL12                         *((volatile unsigned int*)(0x42212DB0UL))
#define bM4_AOS_PEVNTFAL4_FAL13                         *((volatile unsigned int*)(0x42212DB4UL))
#define bM4_AOS_PEVNTFAL4_FAL14                         *((volatile unsigned int*)(0x42212DB8UL))
#define bM4_AOS_PEVNTFAL4_FAL15                         *((volatile unsigned int*)(0x42212DBCUL))
#define bM4_AOS_PEVNTNFCR_NFEN1                         *((volatile unsigned int*)(0x42212E00UL))
#define bM4_AOS_PEVNTNFCR_DIVS10                        *((volatile unsigned int*)(0x42212E04UL))
#define bM4_AOS_PEVNTNFCR_DIVS11                        *((volatile unsigned int*)(0x42212E08UL))
#define bM4_AOS_PEVNTNFCR_NFEN2                         *((volatile unsigned int*)(0x42212E20UL))
#define bM4_AOS_PEVNTNFCR_DIVS20                        *((volatile unsigned int*)(0x42212E24UL))
#define bM4_AOS_PEVNTNFCR_DIVS21                        *((volatile unsigned int*)(0x42212E28UL))
#define bM4_AOS_PEVNTNFCR_NFEN3                         *((volatile unsigned int*)(0x42212E40UL))
#define bM4_AOS_PEVNTNFCR_DIVS30                        *((volatile unsigned int*)(0x42212E44UL))
#define bM4_AOS_PEVNTNFCR_DIVS31                        *((volatile unsigned int*)(0x42212E48UL))
#define bM4_AOS_PEVNTNFCR_NFEN4                         *((volatile unsigned int*)(0x42212E60UL))
#define bM4_AOS_PEVNTNFCR_DIVS40                        *((volatile unsigned int*)(0x42212E64UL))
#define bM4_AOS_PEVNTNFCR_DIVS41                        *((volatile unsigned int*)(0x42212E68UL))
#define bM4_CAN_CFG_STAT_BUSOFF                         *((volatile unsigned int*)(0x42E09400UL))
#define bM4_CAN_CFG_STAT_TACTIVE                        *((volatile unsigned int*)(0x42E09404UL))
#define bM4_CAN_CFG_STAT_RACTIVE                        *((volatile unsigned int*)(0x42E09408UL))
#define bM4_CAN_CFG_STAT_TSSS                           *((volatile unsigned int*)(0x42E0940CUL))
#define bM4_CAN_CFG_STAT_TPSS                           *((volatile unsigned int*)(0x42E09410UL))
#define bM4_CAN_CFG_STAT_LBMI                           *((volatile unsigned int*)(0x42E09414UL))
#define bM4_CAN_CFG_STAT_LBME                           *((volatile unsigned int*)(0x42E09418UL))
#define bM4_CAN_CFG_STAT_RESET                          *((volatile unsigned int*)(0x42E0941CUL))
#define bM4_CAN_TCMD_TSA                                *((volatile unsigned int*)(0x42E09420UL))
#define bM4_CAN_TCMD_TSALL                              *((volatile unsigned int*)(0x42E09424UL))
#define bM4_CAN_TCMD_TSONE                              *((volatile unsigned int*)(0x42E09428UL))
#define bM4_CAN_TCMD_TPA                                *((volatile unsigned int*)(0x42E0942CUL))
