CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_CMP2_VLTSEL_CVSL1                           *((volatile unsigned int*)(0x42940264UL))
#define bM4_CMP2_VLTSEL_CVSL2                           *((volatile unsigned int*)(0x42940268UL))
#define bM4_CMP2_VLTSEL_CVSL3                           *((volatile unsigned int*)(0x4294026CUL))
#define bM4_CMP2_VLTSEL_C4SL0                           *((volatile unsigned int*)(0x42940270UL))
#define bM4_CMP2_VLTSEL_C4SL1                           *((volatile unsigned int*)(0x42940274UL))
#define bM4_CMP2_VLTSEL_C4SL2                           *((volatile unsigned int*)(0x42940278UL))
#define bM4_CMP2_MON_OMON                               *((volatile unsigned int*)(0x42940280UL))
#define bM4_CMP2_MON_CVST0                              *((volatile unsigned int*)(0x429402A0UL))
#define bM4_CMP2_MON_CVST1                              *((volatile unsigned int*)(0x429402A4UL))
#define bM4_CMP2_MON_CVST2                              *((volatile unsigned int*)(0x429402A8UL))
#define bM4_CMP2_MON_CVST3                              *((volatile unsigned int*)(0x429402ACUL))
#define bM4_CMP2_CVSSTB_STB0                            *((volatile unsigned int*)(0x429402C0UL))
#define bM4_CMP2_CVSSTB_STB1                            *((volatile unsigned int*)(0x429402C4UL))
#define bM4_CMP2_CVSSTB_STB2                            *((volatile unsigned int*)(0x429402C8UL))
#define bM4_CMP2_CVSSTB_STB3                            *((volatile unsigned int*)(0x429402CCUL))
#define bM4_CMP2_CVSPRD_PRD0                            *((volatile unsigned int*)(0x42940300UL))
#define bM4_CMP2_CVSPRD_PRD1                            *((volatile unsigned int*)(0x42940304UL))
#define bM4_CMP2_CVSPRD_PRD2                            *((volatile unsigned int*)(0x42940308UL))
#define bM4_CMP2_CVSPRD_PRD3                            *((volatile unsigned int*)(0x4294030CUL))
#define bM4_CMP2_CVSPRD_PRD4                            *((volatile unsigned int*)(0x42940310UL))
#define bM4_CMP2_CVSPRD_PRD5                            *((volatile unsigned int*)(0x42940314UL))
#define bM4_CMP2_CVSPRD_PRD6                            *((volatile unsigned int*)(0x42940318UL))
#define bM4_CMP2_CVSPRD_PRD7                            *((volatile unsigned int*)(0x4294031CUL))
#define bM4_CMP3_CTRL_FLTSL0                            *((volatile unsigned int*)(0x42940400UL))
#define bM4_CMP3_CTRL_FLTSL1                            *((volatile unsigned int*)(0x42940404UL))
#define bM4_CMP3_CTRL_FLTSL2                            *((volatile unsigned int*)(0x42940408UL))
#define bM4_CMP3_CTRL_EDGSL0                            *((volatile unsigned int*)(0x42940414UL))
#define bM4_CMP3_CTRL_EDGSL1                            *((volatile unsigned int*)(0x42940418UL))
#define bM4_CMP3_CTRL_IEN                               *((volatile unsigned int*)(0x4294041CUL))
#define bM4_CMP3_CTRL_CVSEN                             *((volatile unsigned int*)(0x42940420UL))
#define bM4_CMP3_CTRL_OUTEN                             *((volatile unsigned int*)(0x42940430UL))
#define bM4_CMP3_CTRL_INV                               *((volatile unsigned int*)(0x42940434UL))
#define bM4_CMP3_CTRL_CMPOE                             *((volatile unsigned int*)(0x42940438UL))
#define bM4_CMP3_CTRL_CMPON                             *((volatile unsigned int*)(0x4294043CUL))
#define bM4_CMP3_VLTSEL_RVSL0                           *((volatile unsigned int*)(0x42940440UL))
#define bM4_CMP3_VLTSEL_RVSL1                           *((volatile unsigned int*)(0x42940444UL))
#define bM4_CMP3_VLTSEL_RVSL2                           *((volatile unsigned int*)(0x42940448UL))
#define bM4_CMP3_VLTSEL_RVSL3                           *((volatile unsigned int*)(0x4294044CUL))
#define bM4_CMP3_VLTSEL_CVSL0                           *((volatile unsigned int*)(0x42940460UL))
#define bM4_CMP3_VLTSEL_CVSL1                           *((volatile unsigned int*)(0x42940464UL))
#define bM4_CMP3_VLTSEL_CVSL2                           *((volatile unsigned int*)(0x42940468UL))
#define bM4_CMP3_VLTSEL_CVSL3                           *((volatile unsigned int*)(0x4294046CUL))
#define bM4_CMP3_VLTSEL_C4SL0                           *((volatile unsigned int*)(0x42940470UL))
#define bM4_CMP3_VLTSEL_C4SL1                           *((volatile unsigned int*)(0x42940474UL))
#define bM4_CMP3_VLTSEL_C4SL2                           *((volatile unsigned int*)(0x42940478UL))
#define bM4_CMP3_MON_OMON                               *((volatile unsigned int*)(0x42940480UL))
#define bM4_CMP3_MON_CVST0                              *((volatile unsigned int*)(0x429404A0UL))
#define bM4_CMP3_MON_CVST1                              *((volatile unsigned int*)(0x429404A4UL))
#define bM4_CMP3_MON_CVST2                              *((volatile unsigned int*)(0x429404A8UL))
#define bM4_CMP3_MON_CVST3                              *((volatile unsigned int*)(0x429404ACUL))
#define bM4_CMP3_CVSSTB_STB0                            *((volatile unsigned int*)(0x429404C0UL))
#define bM4_CMP3_CVSSTB_STB1                            *((volatile unsigned int*)(0x429404C4UL))
#define bM4_CMP3_CVSSTB_STB2                            *((volatile unsigned int*)(0x429404C8UL))
#define bM4_CMP3_CVSSTB_STB3                            *((volatile unsigned int*)(0x429404CCUL))
#define bM4_CMP3_CVSPRD_PRD0                            *((volatile unsigned int*)(0x42940500UL))
#define bM4_CMP3_CVSPRD_PRD1                            *((volatile unsigned int*)(0x42940504UL))
#define bM4_CMP3_CVSPRD_PRD2                            *((volatile unsigned int*)(0x42940508UL))
#define bM4_CMP3_CVSPRD_PRD3                            *((volatile unsigned int*)(0x4294050CUL))
#define bM4_CMP3_CVSPRD_PRD4                            *((volatile unsigned int*)(0x42940510UL))
#define bM4_CMP3_CVSPRD_PRD5                            *((volatile unsigned int*)(0x42940514UL))
#define bM4_CMP3_CVSPRD_PRD6                            *((volatile unsigned int*)(0x42940518UL))
#define bM4_CMP3_CVSPRD_PRD7                            *((volatile unsigned int*)(0x4294051CUL))
#define bM4_CMP_CR_DADR1_DATA0                          *((volatile unsigned int*)(0x42942000UL))
#define bM4_CMP_CR_DADR1_DATA1                          *((volatile unsigned int*)(0x42942004UL))
#define bM4_CMP_CR_DADR1_DATA2                          *((volatile unsigned int*)(0x42942008UL))
#define bM4_CMP_CR_DADR1_DATA3                          *((volatile unsigned int*)(0x4294200CUL))
#define bM4_CMP_CR_DADR1_DATA4                          *((volatile unsigned int*)(0x42942010UL))
#define bM4_CMP_CR_DADR1_DATA5                          *((volatile unsigned int*)(0x42942014UL))
#define bM4_CMP_CR_DADR1_DATA6                          *((volatile unsigned int*)(0x42942018UL))
#define bM4_CMP_CR_DADR1_DATA7                          *((volatile unsigned int*)(0x4294201CUL))
#define bM4_CMP_CR_DADR2_DATA0                          *((volatile unsigned int*)(0x42942040UL))
#define bM4_CMP_CR_DADR2_DATA1                          *((volatile unsigned int*)(0x42942044UL))
#define bM4_CMP_CR_DADR2_DATA2                          *((volatile unsigned int*)(0x42942048UL))
#define bM4_CMP_CR_DADR2_DATA3                          *((volatile unsigned int*)(0x4294204CUL))
#define bM4_CMP_CR_DADR2_DATA4                          *((volatile unsigned int*)(0x42942050UL))
#define bM4_CMP_CR_DADR2_DATA5                          *((volatile unsigned int*)(0x42942054UL))
#define bM4_CMP_CR_DADR2_DATA6                          *((volatile unsigned int*)(0x42942058UL))
#define bM4_CMP_CR_DADR2_DATA7                          *((volatile unsigned int*)(0x4294205CUL))
#define bM4_CMP_CR_DACR_DA1EN                           *((volatile unsigned int*)(0x42942100UL))
#define bM4_CMP_CR_DACR_DA2EN                           *((volatile unsigned int*)(0x42942104UL))
#define bM4_CMP_CR_RVADC_DA1SW                          *((volatile unsigned int*)(0x42942180UL))
#define bM4_CMP_CR_RVADC_DA2SW                          *((volatile unsigned int*)(0x42942184UL))
#define bM4_CMP_CR_RVADC_VREFSW                         *((volatile unsigned int*)(0x42942190UL))
#define bM4_CRC_CR_SEL                                  *((volatile unsigned int*)(0x42118004UL))
#define bM4_CRC_CR_REFIN                                *((volatile unsigned int*)(0x42118008UL))
#define bM4_CRC_CR_REFOUT                               *((volatile unsigned int*)(0x4211800CUL))
#define bM4_CRC_CR_XOROUT                               *((volatile unsigned int*)(0x42118010UL))
#define bM4_CRC_FLG_FLAG                                *((volatile unsigned int*)(0x42118180UL))
#define bM4_DCU1_CTL_MODE0                              *((volatile unsigned int*)(0x42A40000UL))
#define bM4_DCU1_CTL_MODE1                              *((volatile unsigned int*)(0x42A40004UL))
#define bM4_DCU1_CTL_MODE2                              *((volatile unsigned int*)(0x42A40008UL))
#define bM4_DCU1_CTL_DATASIZE0                          *((volatile unsigned int*)(0x42A4000CUL))
#define bM4_DCU1_CTL_DATASIZE1                          *((volatile unsigned int*)(0x42A40010UL))
#define bM4_DCU1_CTL_COMP_TRG                           *((volatile unsigned int*)(0x42A40020UL))
#define bM4_DCU1_CTL_INTEN                              *((volatile unsigned int*)(0x42A4007CUL))
#define bM4_DCU1_FLAG_FLAG_OP                           *((volatile unsigned int*)(0x42A40080UL))
#define bM4_DCU1_FLAG_FLAG_LS2                          *((volatile unsigned int*)(0x42A40084UL))
#define bM4_DCU1_FLAG_FLAG_EQ2                          *((volatile unsigned int*)(0x42A40088UL))
#define bM4_DCU1_FLAG_FLAG_GT2                          *((volatile unsigned int*)(0x42A4008CUL))
#define bM4_DCU1_FLAG_FLAG_LS1                          *((volatile unsigned int*)(0x42A40090UL))
#define bM4_DCU1_FLAG_FLAG_EQ1                          *((volatile unsigned int*)(0x42A40094UL))
#define bM4_DCU1_FLAG_FLAG_GT1                          *((volatile unsigned int*)(0x42A40098UL))
#define bM4_DCU1_FLAGCLR_CLR_OP                         *((volatile unsigned int*)(0x42A40280UL))
#define bM4_DCU1_FLAGCLR_CLR_LS2                        *((volatile unsigned int*)(0x42A40284UL))
#define bM4_DCU1_FLAGCLR_CLR_EQ2                        *((volatile unsigned int*)(0x42A40288UL))
#define bM4_DCU1_FLAGCLR_CLR_GT2                        *((volatile unsigned int*)(0x42A4028CUL))
#define bM4_DCU1_FLAGCLR_CLR_LS1                        *((volatile unsigned int*)(0x42A40290UL))
#define bM4_DCU1_FLAGCLR_CLR_EQ1                        *((volatile unsigned int*)(0x42A40294UL))
#define bM4_DCU1_FLAGCLR_CLR_GT1                        *((volatile unsigned int*)(0x42A40298UL))
#define bM4_DCU1_INTSEL_INT_OP                          *((volatile unsigned int*)(0x42A40300UL))
#define bM4_DCU1_INTSEL_INT_LS2                         *((volatile unsigned int*)(0x42A40304UL))
#define bM4_DCU1_INTSEL_INT_EQ2                         *((volatile unsigned int*)(0x42A40308UL))
#define bM4_DCU1_INTSEL_INT_GT2                         *((volatile unsigned int*)(0x42A4030CUL))
#define bM4_DCU1_INTSEL_INT_LS1                         *((volatile unsigned int*)(0x42A40310UL))
#define bM4_DCU1_INTSEL_INT_EQ1                         *((volatile unsigned int*)(0x42A40314UL))
#define bM4_DCU1_INTSEL_INT_GT1                         *((volatile unsigned int*)(0x42A40318UL))
#define bM4_DCU1_INTSEL_INT_WIN0                        *((volatile unsigned int*)(0x42A4031CUL))
#define bM4_DCU1_INTSEL_INT_WIN1                        *((volatile unsigned int*)(0x42A40320UL))
#define bM4_DCU2_CTL_MODE0                              *((volatile unsigned int*)(0x42A48000UL))
#define bM4_DCU2_CTL_MODE1                              *((volatile unsigned int*)(0x42A48004UL))
#define bM4_DCU2_CTL_MODE2                              *((volatile unsigned int*)(0x42A48008UL))
#define bM4_DCU2_CTL_DATASIZE0                          *((volatile unsigned int*)(0x42A4800CUL))
#define bM4_DCU2_CTL_DATASIZE1                          *((volatile unsigned int*)(0x42A48010UL))
#define bM4_DCU2_CTL_COMP_TRG                           *((volatile unsigned int*)(0x42A48020UL))
#define bM4_DCU2_CTL_INTEN                              *((volatile unsigned int*)(0x42A4807CUL))
#define bM4_DCU2_FLAG_FLAG_OP                           *((volatile unsigned int*)(0x42A48080UL))
#define bM4_DCU2_FLAG_FLAG_LS2                          *((volatile unsigned int*)(0x42A48084UL))
#define bM4_DCU2_FLAG_FLAG_EQ2                          *((volatile unsigned int*)(0x42A48088UL))
#define bM4_DCU2_FLAG_FLAG_GT2                          *((volatile unsigned int*)(0x42A4808CUL))
#define bM4_DCU2_FLAG_FLAG_LS1                          *((volatile unsigned int*)(0x42A48090UL))
#define bM4_DCU2_FLAG_FLAG_EQ1                          *((volatile unsigned int*)(0x42A48094UL))
#define bM4_DCU2_FLAG_FLAG_GT1                          *((volatile unsigned int*)(0x42A48098UL))
#define bM4_DCU2_FLAGCLR_CLR_OP                         *((volatile unsigned int*)(0x42A48280UL))
#define bM4_DCU2_FLAGCLR_CLR_LS2                        *((volatile unsigned int*)(0x42A48284UL))
#define bM4_DCU2_FLAGCLR_CLR_EQ2                        *((volatile unsigned int*)(0x42A48288UL))
#define bM4_DCU2_FLAGCLR_CLR_GT2                        *((volatile unsigned int*)(0x42A4828CUL))
#define bM4_DCU2_FLAGCLR_CLR_LS1                        *((volatile unsigned int*)(0x42A48290UL))
#define bM4_DCU2_FLAGCLR_CLR_EQ1                        *((volatile unsigned int*)(0x42A48294UL))
#define bM4_DCU2_FLAGCLR_CLR_GT1                        *((volatile unsigned int*)(0x42A48298UL))
#define bM4_DCU2_INTSEL_INT_OP                          *((volatile unsigned int*)(0x42A48300UL))
#define bM4_DCU2_INTSEL_INT_LS2                         *((volatile unsigned int*)(0x42A48304UL))
#define bM4_DCU2_INTSEL_INT_EQ2                         *((volatile unsigned int*)(0x42A48308UL))
#define bM4_DCU2_INTSEL_INT_GT2                         *((volatile unsigned int*)(0x42A4830CUL))
#define bM4_DCU2_INTSEL_INT_LS1                         *((volatile unsigned int*)(0x42A48310UL))
#define bM4_DCU2_INTSEL_INT_EQ1                         *((volatile unsigned int*)(0x42A48314UL))
#define bM4_DCU2_INTSEL_INT_GT1                         *((volatile unsigned int*)(0x42A48318UL))
#define bM4_DCU2_INTSEL_INT_WIN0                        *((volatile unsigned int*)(0x42A4831CUL))
#define bM4_DCU2_INTSEL_INT_WIN1                        *((volatile unsigned int*)(0x42A48320UL))
#define bM4_DCU3_CTL_MODE0                              *((volatile unsigned int*)(0x42A50000UL))
#define bM4_DCU3_CTL_MODE1                              *((volatile unsigned int*)(0x42A50004UL))
#define bM4_DCU3_CTL_MODE2                              *((volatile unsigned int*)(0x42A50008UL))
#define bM4_DCU3_CTL_DATASIZE0                          *((volatile unsigned int*)(0x42A5000CUL))
#define bM4_DCU3_CTL_DATASIZE1                          *((volatile unsigned int*)(0x42A50010UL))
#define bM4_DCU3_CTL_COMP_TRG                           *((volatile unsigned int*)(0x42A50020UL))
#define bM4_DCU3_CTL_INTEN                              *((volatile unsigned int*)(0x42A5007CUL))
#define bM4_DCU3_FLAG_FLAG_OP                           *((volatile unsigned int*)(0x42A50080UL))
#define bM4_DCU3_FLAG_FLAG_LS2                          *((volatile unsigned int*)(0x42A50084UL))
#define bM4_DCU3_FLAG_FLAG_EQ2                          *((volatile unsigned int*)(0x42A50088UL))
#define bM4_DCU3_FLAG_FLAG_GT2                          *((volatile unsigned int*)(0x42A5008CUL))
#define bM4_DCU3_FLAG_FLAG_LS1                          *((volatile unsigned int*)(0x42A50090UL))
#define bM4_DCU3_FLAG_FLAG_EQ1                          *((volatile unsigned int*)(0x42A50094UL))
#define bM4_DCU3_FLAG_FLAG_GT1                          *((volatile unsigned int*)(0x42A50098UL))
#define bM4_DCU3_FLAGCLR_CLR_OP                         *((volatile unsigned int*)(0x42A50280UL))
#define bM4_DCU3_FLAGCLR_CLR_LS2                        *((volatile unsigned int*)(0x42A50284UL))
#define bM4_DCU3_FLAGCLR_CLR_EQ2                        *((volatile unsigned int*)(0x42A50288UL))
#define bM4_DCU3_FLAGCLR_CLR_GT2                        *((volatile unsigned int*)(0x42A5028CUL))
#define bM4_DCU3_FLAGCLR_CLR_LS1                        *((volatile unsigned int*)(0x42A50290UL))
#define bM4_DCU3_FLAGCLR_CLR_EQ1                        *((volatile unsigned int*)(0x42A50294UL))
#define bM4_DCU3_FLAGCLR_CLR_GT1                        *((volatile unsigned int*)(0x42A50298UL))
#define bM4_DCU3_INTSEL_INT_OP                          *((volatile unsigned int*)(0x42A50300UL))
#define bM4_DCU3_INTSEL_INT_LS2                         *((volatile unsigned int*)(0x42A50304UL))
#define bM4_DCU3_INTSEL_INT_EQ2                         *((volatile unsigned int*)(0x42A50308UL))
#define bM4_DCU3_INTSEL_INT_GT2                         *((volatile unsigned int*)(0x42A5030CUL))
#define bM4_DCU3_INTSEL_INT_LS1                         *((volatile unsigned int*)(0x42A50310UL))
#define bM4_DCU3_INTSEL_INT_EQ1                         *((volatile unsigned int*)(0x42A50314UL))
#define bM4_DCU3_INTSEL_INT_GT1                         *((volatile unsigned int*)(0x42A50318UL))
#define bM4_DCU3_INTSEL_INT_WIN0                        *((volatile unsigned int*)(0x42A5031CUL))
#define bM4_DCU3_INTSEL_INT_WIN1                        *((volatile unsigned int*)(0x42A50320UL))
#define bM4_DCU4_CTL_MODE0                              *((volatile unsigned int*)(0x42A58000UL))
#define bM4_DCU4_CTL_MODE1                              *((volatile unsigned int*)(0x42A58004UL))
#define bM4_DCU4_CTL_MODE2                              *((volatile unsigned int*)(0x42A58008UL))
#define bM4_DCU4_CTL_DATASIZE0                          *((volatile unsigned int*)(0x42A5800CUL))
#define bM4_DCU4_CTL_DATASIZE1                          *((volatile unsigned int*)(0x42A58010UL))
#define bM4_DCU4_CTL_COMP_TRG                           *((volatile unsigned int*)(0x42A58020UL))
#define bM4_DCU4_CTL_INTEN                              *((volatile unsigned int*)(0x42A5807CUL))
#define bM4_DCU4_FLAG_FLAG_OP                           *((volatile unsigned int*)(0x42A58080UL))
#define bM4_DCU4_FLAG_FLAG_LS2                          *((volatile unsigned int*)(0x42A58084UL))
#define bM4_DCU4_FLAG_FLAG_EQ2                          *((volatile unsigned int*)(0x42A58088UL))
#define bM4_DCU4_FLAG_FLAG_GT2                          *((volatile unsigned int*)(0x42A5808CUL))
#define bM4_DCU4_FLAG_FLAG_LS1                          *((volatile unsigned int*)(0x42A58090UL))
#define bM4_DCU4_FLAG_FLAG_EQ1                          *((volatile unsigned int*)(0x42A58094UL))
#define bM4_DCU4_FLAG_FLAG_GT1                          *((volatile unsigned int*)(0x42A58098UL))
#define bM4_DCU4_FLAGCLR_CLR_OP                         *((volatile unsigned int*)(0x42A58280UL))
#define bM4_DCU4_FLAGCLR_CLR_LS2                        *((volatile unsigned int*)(0x42A58284UL))
#define bM4_DCU4_FLAGCLR_CLR_EQ2                        *((volatile unsigned int*)(0x42A58288UL))
#define bM4_DCU4_FLAGCLR_CLR_GT2                        *((volatile unsigned int*)(0x42A5828CUL))
#define bM4_DCU4_FLAGCLR_CLR_LS1                        *((volatile unsigned int*)(0x42A58290UL))
#define bM4_DCU4_FLAGCLR_CLR_EQ1                        *((volatile unsigned int*)(0x42A58294UL))
#define bM4_DCU4_FLAGCLR_CLR_GT1                        *((volatile unsigned int*)(0x42A58298UL))
#define bM4_DCU4_INTSEL_INT_OP                          *((volatile unsigned int*)(0x42A58300UL))
#define bM4_DCU4_INTSEL_INT_LS2                         *((volatile unsigned int*)(0x42A58304UL))
#define bM4_DCU4_INTSEL_INT_EQ2                         *((volatile unsigned int*)(0x42A58308UL))
#define bM4_DCU4_INTSEL_INT_GT2                         *((volatile unsigned int*)(0x42A5830CUL))
#define bM4_DCU4_INTSEL_INT_LS1                         *((volatile unsigned int*)(0x42A58310UL))
#define bM4_DCU4_INTSEL_INT_EQ1                         *((volatile unsigned int*)(0x42A58314UL))
#define bM4_DCU4_INTSEL_INT_GT1                         *((volatile unsigned int*)(0x42A58318UL))
#define bM4_DCU4_INTSEL_INT_WIN0                        *((volatile unsigned int*)(0x42A5831CUL))
#define bM4_DCU4_INTSEL_INT_WIN1                        *((volatile unsigned int*)(0x42A58320UL))
#define bM4_DMA1_EN_EN                                  *((volatile unsigned int*)(0x42A60000UL))
#define bM4_DMA1_INTSTAT0_TRNERR0                       *((volatile unsigned int*)(0x42A60080UL))
#define bM4_DMA1_INTSTAT0_TRNERR1                       *((volatile unsigned int*)(0x42A60084UL))
#define bM4_DMA1_INTSTAT0_TRNERR2                       *((volatile unsigned int*)(0x42A60088UL))
#define bM4_DMA1_INTSTAT0_TRNERR3                       *((volatile unsigned int*)(0x42A6008CUL))
#define bM4_DMA1_INTSTAT0_REQERR0                       *((volatile unsigned int*)(0x42A600C0UL))
#define bM4_DMA1_INTSTAT0_REQERR1                       *((volatile unsigned int*)(0x42A600C4UL))
#define bM4_DMA1_INTSTAT0_REQERR2                       *((volatile unsigned int*)(0x42A600C8UL))
#define bM4_DMA1_INTSTAT0_REQERR3                       *((volatile unsigned int*)(0x42A600CCUL))
#define bM4_DMA1_INTSTAT1_TC0                           *((volatile unsigned int*)(0x42A60100UL))
#define bM4_DMA1_INTSTAT1_TC1                           *((volatile unsigned int*)(0x42A60104UL))
#define bM4_DMA1_INTSTAT1_TC2                           *((volatile unsigned int*)(0x42A60108UL))
#define bM4_DMA1_INTSTAT1_TC3                           *((volatile unsigned int*)(0x42A6010CUL))
#define bM4_DMA1_INTSTAT1_BTC0                          *((volatile unsigned int*)(0x42A60140UL))
#define bM4_DMA1_INTSTAT1_BTC1                          *((volatile unsigned int*)(0x42A60144UL))
#define bM4_DMA1_INTSTAT1_BTC2                          *((volatile unsigned int*)(0x42A60148UL))
#define bM4_DMA1_INTSTAT1_BTC3                          *((volatile unsigned int*)(0x42A6014CUL))
#define bM4_DMA1_INTMASK0_MSKTRNERR0                    *((volatile unsigned int*)(0x42A60180UL))
#define bM4_DMA1_INTMASK0_MSKTRNERR1                    *((volatile unsigned int*)(0x42A60184UL))
#define bM4_DMA1_INTMASK0_MSKTRNERR2                    *((volatile unsigned int*)(0x42A60188UL))
#define bM4_DMA1_INTMASK0_MSKTRNERR3                    *((volatile unsigned int*)(0x42A6018CUL))
#define bM4_DMA1_INTMASK0_MSKREQERR0                    *((volatile unsigned int*)(0x42A601C0UL))
#define bM4_DMA1_INTMASK0_MSKREQERR1                    *((volatile unsigned int*)(0x42A601C4UL))
#define bM4_DMA1_INTMASK0_MSKREQERR2                    *((volatile unsigned int*)(0x42A601C8UL))
#define bM4_DMA1_INTMASK0_MSKREQERR3                    *((volatile unsigned int*)(0x42A601CCUL))
#define bM4_DMA1_INTMASK1_MSKTC0                        *((volatile unsigned int*)(0x42A60200UL))
#define bM4_DMA1_INTMASK1_MSKTC1                        *((volatile unsigned int*)(0x42A60204UL))
#define bM4_DMA1_INTMASK1_MSKTC2                        *((volatile unsigned int*)(0x42A60208UL))
#define bM4_DMA1_INTMASK1_MSKTC3                        *((volatile unsigned int*)(0x42A6020CUL))
#define bM4_DMA1_INTMASK1_MSKBTC0                       *((volatile unsigned int*)(0x42A60240UL))
#define bM4_DMA1_INTMASK1_MSKBTC1                       *((volatile unsigned int*)(0x42A60244UL))
#define bM4_DMA1_INTMASK1_MSKBTC2                       *((volatile unsigned int*)(0x42A60248UL))
#define bM4_DMA1_INTMASK1_MSKBTC3                       *((volatile unsigned int*)(0x42A6024CUL))
#define bM4_DMA1_INTCLR0_CLRTRNERR0                     *((volatile unsigned int*)(0x42A60280UL))
#define bM4_DMA1_INTCLR0_CLRTRNERR1                     *((volatile unsigned int*)(0x42A60284UL))
#define bM4_DMA1_INTCLR0_CLRTRNERR2                     *((volatile unsigned int*)(0x42A60288UL))
