CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_DMA2_INTCLR1_CLRTC0                         *((volatile unsigned int*)(0x42A68300UL))
#define bM4_DMA2_INTCLR1_CLRTC1                         *((volatile unsigned int*)(0x42A68304UL))
#define bM4_DMA2_INTCLR1_CLRTC2                         *((volatile unsigned int*)(0x42A68308UL))
#define bM4_DMA2_INTCLR1_CLRTC3                         *((volatile unsigned int*)(0x42A6830CUL))
#define bM4_DMA2_INTCLR1_CLRBTC0                        *((volatile unsigned int*)(0x42A68340UL))
#define bM4_DMA2_INTCLR1_CLRBTC1                        *((volatile unsigned int*)(0x42A68344UL))
#define bM4_DMA2_INTCLR1_CLRBTC2                        *((volatile unsigned int*)(0x42A68348UL))
#define bM4_DMA2_INTCLR1_CLRBTC3                        *((volatile unsigned int*)(0x42A6834CUL))
#define bM4_DMA2_CHEN_CHEN0                             *((volatile unsigned int*)(0x42A68380UL))
#define bM4_DMA2_CHEN_CHEN1                             *((volatile unsigned int*)(0x42A68384UL))
#define bM4_DMA2_CHEN_CHEN2                             *((volatile unsigned int*)(0x42A68388UL))
#define bM4_DMA2_CHEN_CHEN3                             *((volatile unsigned int*)(0x42A6838CUL))
#define bM4_DMA2_CHSTAT_DMAACT                          *((volatile unsigned int*)(0x42A68480UL))
#define bM4_DMA2_CHSTAT_RCFGACT                         *((volatile unsigned int*)(0x42A68484UL))
#define bM4_DMA2_CHSTAT_CHACT0                          *((volatile unsigned int*)(0x42A684C0UL))
#define bM4_DMA2_CHSTAT_CHACT1                          *((volatile unsigned int*)(0x42A684C4UL))
#define bM4_DMA2_CHSTAT_CHACT2                          *((volatile unsigned int*)(0x42A684C8UL))
#define bM4_DMA2_CHSTAT_CHACT3                          *((volatile unsigned int*)(0x42A684CCUL))
#define bM4_DMA2_RCFGCTL_RCFGEN                         *((volatile unsigned int*)(0x42A68580UL))
#define bM4_DMA2_RCFGCTL_RCFGLLP                        *((volatile unsigned int*)(0x42A68584UL))
#define bM4_DMA2_RCFGCTL_RCFGCHS0                       *((volatile unsigned int*)(0x42A685A0UL))
#define bM4_DMA2_RCFGCTL_RCFGCHS1                       *((volatile unsigned int*)(0x42A685A4UL))
#define bM4_DMA2_RCFGCTL_RCFGCHS2                       *((volatile unsigned int*)(0x42A685A8UL))
#define bM4_DMA2_RCFGCTL_RCFGCHS3                       *((volatile unsigned int*)(0x42A685ACUL))
#define bM4_DMA2_RCFGCTL_SARMD0                         *((volatile unsigned int*)(0x42A685C0UL))
#define bM4_DMA2_RCFGCTL_SARMD1                         *((volatile unsigned int*)(0x42A685C4UL))
#define bM4_DMA2_RCFGCTL_DARMD0                         *((volatile unsigned int*)(0x42A685C8UL))
#define bM4_DMA2_RCFGCTL_DARMD1                         *((volatile unsigned int*)(0x42A685CCUL))
#define bM4_DMA2_RCFGCTL_CNTMD0                         *((volatile unsigned int*)(0x42A685D0UL))
#define bM4_DMA2_RCFGCTL_CNTMD1                         *((volatile unsigned int*)(0x42A685D4UL))
#define bM4_DMA2_DTCTL0_BLKSIZE0                        *((volatile unsigned int*)(0x42A68900UL))
#define bM4_DMA2_DTCTL0_BLKSIZE1                        *((volatile unsigned int*)(0x42A68904UL))
#define bM4_DMA2_DTCTL0_BLKSIZE2                        *((volatile unsigned int*)(0x42A68908UL))
#define bM4_DMA2_DTCTL0_BLKSIZE3                        *((volatile unsigned int*)(0x42A6890CUL))
#define bM4_DMA2_DTCTL0_BLKSIZE4                        *((volatile unsigned int*)(0x42A68910UL))
#define bM4_DMA2_DTCTL0_BLKSIZE5                        *((volatile unsigned int*)(0x42A68914UL))
#define bM4_DMA2_DTCTL0_BLKSIZE6                        *((volatile unsigned int*)(0x42A68918UL))
#define bM4_DMA2_DTCTL0_BLKSIZE7                        *((volatile unsigned int*)(0x42A6891CUL))
#define bM4_DMA2_DTCTL0_BLKSIZE8                        *((volatile unsigned int*)(0x42A68920UL))
#define bM4_DMA2_DTCTL0_BLKSIZE9                        *((volatile unsigned int*)(0x42A68924UL))
#define bM4_DMA2_DTCTL0_CNT0                            *((volatile unsigned int*)(0x42A68940UL))
#define bM4_DMA2_DTCTL0_CNT1                            *((volatile unsigned int*)(0x42A68944UL))
#define bM4_DMA2_DTCTL0_CNT2                            *((volatile unsigned int*)(0x42A68948UL))
#define bM4_DMA2_DTCTL0_CNT3                            *((volatile unsigned int*)(0x42A6894CUL))
#define bM4_DMA2_DTCTL0_CNT4                            *((volatile unsigned int*)(0x42A68950UL))
#define bM4_DMA2_DTCTL0_CNT5                            *((volatile unsigned int*)(0x42A68954UL))
#define bM4_DMA2_DTCTL0_CNT6                            *((volatile unsigned int*)(0x42A68958UL))
#define bM4_DMA2_DTCTL0_CNT7                            *((volatile unsigned int*)(0x42A6895CUL))
#define bM4_DMA2_DTCTL0_CNT8                            *((volatile unsigned int*)(0x42A68960UL))
#define bM4_DMA2_DTCTL0_CNT9                            *((volatile unsigned int*)(0x42A68964UL))
#define bM4_DMA2_DTCTL0_CNT10                           *((volatile unsigned int*)(0x42A68968UL))
#define bM4_DMA2_DTCTL0_CNT11                           *((volatile unsigned int*)(0x42A6896CUL))
#define bM4_DMA2_DTCTL0_CNT12                           *((volatile unsigned int*)(0x42A68970UL))
#define bM4_DMA2_DTCTL0_CNT13                           *((volatile unsigned int*)(0x42A68974UL))
#define bM4_DMA2_DTCTL0_CNT14                           *((volatile unsigned int*)(0x42A68978UL))
#define bM4_DMA2_DTCTL0_CNT15                           *((volatile unsigned int*)(0x42A6897CUL))
#define bM4_DMA2_RPT0_SRPT0                             *((volatile unsigned int*)(0x42A68980UL))
#define bM4_DMA2_RPT0_SRPT1                             *((volatile unsigned int*)(0x42A68984UL))
#define bM4_DMA2_RPT0_SRPT2                             *((volatile unsigned int*)(0x42A68988UL))
#define bM4_DMA2_RPT0_SRPT3                             *((volatile unsigned int*)(0x42A6898CUL))
#define bM4_DMA2_RPT0_SRPT4                             *((volatile unsigned int*)(0x42A68990UL))
#define bM4_DMA2_RPT0_SRPT5                             *((volatile unsigned int*)(0x42A68994UL))
#define bM4_DMA2_RPT0_SRPT6                             *((volatile unsigned int*)(0x42A68998UL))
#define bM4_DMA2_RPT0_SRPT7                             *((volatile unsigned int*)(0x42A6899CUL))
#define bM4_DMA2_RPT0_SRPT8                             *((volatile unsigned int*)(0x42A689A0UL))
#define bM4_DMA2_RPT0_SRPT9                             *((volatile unsigned int*)(0x42A689A4UL))
#define bM4_DMA2_RPT0_DRPT0                             *((volatile unsigned int*)(0x42A689C0UL))
#define bM4_DMA2_RPT0_DRPT1                             *((volatile unsigned int*)(0x42A689C4UL))
#define bM4_DMA2_RPT0_DRPT2                             *((volatile unsigned int*)(0x42A689C8UL))
#define bM4_DMA2_RPT0_DRPT3                             *((volatile unsigned int*)(0x42A689CCUL))
#define bM4_DMA2_RPT0_DRPT4                             *((volatile unsigned int*)(0x42A689D0UL))
#define bM4_DMA2_RPT0_DRPT5                             *((volatile unsigned int*)(0x42A689D4UL))
#define bM4_DMA2_RPT0_DRPT6                             *((volatile unsigned int*)(0x42A689D8UL))
#define bM4_DMA2_RPT0_DRPT7                             *((volatile unsigned int*)(0x42A689DCUL))
#define bM4_DMA2_RPT0_DRPT8                             *((volatile unsigned int*)(0x42A689E0UL))
#define bM4_DMA2_RPT0_DRPT9                             *((volatile unsigned int*)(0x42A689E4UL))
#define bM4_DMA2_RPTB0_SRPTB0                           *((volatile unsigned int*)(0x42A68980UL))
#define bM4_DMA2_RPTB0_SRPTB1                           *((volatile unsigned int*)(0x42A68984UL))
#define bM4_DMA2_RPTB0_SRPTB2                           *((volatile unsigned int*)(0x42A68988UL))
#define bM4_DMA2_RPTB0_SRPTB3                           *((volatile unsigned int*)(0x42A6898CUL))
#define bM4_DMA2_RPTB0_SRPTB4                           *((volatile unsigned int*)(0x42A68990UL))
#define bM4_DMA2_RPTB0_SRPTB5                           *((volatile unsigned int*)(0x42A68994UL))
#define bM4_DMA2_RPTB0_SRPTB6                           *((volatile unsigned int*)(0x42A68998UL))
#define bM4_DMA2_RPTB0_SRPTB7                           *((volatile unsigned int*)(0x42A6899CUL))
#define bM4_DMA2_RPTB0_SRPTB8                           *((volatile unsigned int*)(0x42A689A0UL))
#define bM4_DMA2_RPTB0_SRPTB9                           *((volatile unsigned int*)(0x42A689A4UL))
#define bM4_DMA2_RPTB0_DRPTB0                           *((volatile unsigned int*)(0x42A689C0UL))
#define bM4_DMA2_RPTB0_DRPTB1                           *((volatile unsigned int*)(0x42A689C4UL))
#define bM4_DMA2_RPTB0_DRPTB2                           *((volatile unsigned int*)(0x42A689C8UL))
#define bM4_DMA2_RPTB0_DRPTB3                           *((volatile unsigned int*)(0x42A689CCUL))
#define bM4_DMA2_RPTB0_DRPTB4                           *((volatile unsigned int*)(0x42A689D0UL))
#define bM4_DMA2_RPTB0_DRPTB5                           *((volatile unsigned int*)(0x42A689D4UL))
#define bM4_DMA2_RPTB0_DRPTB6                           *((volatile unsigned int*)(0x42A689D8UL))
#define bM4_DMA2_RPTB0_DRPTB7                           *((volatile unsigned int*)(0x42A689DCUL))
#define bM4_DMA2_RPTB0_DRPTB8                           *((volatile unsigned int*)(0x42A689E0UL))
#define bM4_DMA2_RPTB0_DRPTB9                           *((volatile unsigned int*)(0x42A689E4UL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET0                     *((volatile unsigned int*)(0x42A68A00UL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET1                     *((volatile unsigned int*)(0x42A68A04UL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET2                     *((volatile unsigned int*)(0x42A68A08UL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET3                     *((volatile unsigned int*)(0x42A68A0CUL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET4                     *((volatile unsigned int*)(0x42A68A10UL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET5                     *((volatile unsigned int*)(0x42A68A14UL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET6                     *((volatile unsigned int*)(0x42A68A18UL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET7                     *((volatile unsigned int*)(0x42A68A1CUL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET8                     *((volatile unsigned int*)(0x42A68A20UL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET9                     *((volatile unsigned int*)(0x42A68A24UL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET10                    *((volatile unsigned int*)(0x42A68A28UL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET11                    *((volatile unsigned int*)(0x42A68A2CUL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET12                    *((volatile unsigned int*)(0x42A68A30UL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET13                    *((volatile unsigned int*)(0x42A68A34UL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET14                    *((volatile unsigned int*)(0x42A68A38UL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET15                    *((volatile unsigned int*)(0x42A68A3CUL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET16                    *((volatile unsigned int*)(0x42A68A40UL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET17                    *((volatile unsigned int*)(0x42A68A44UL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET18                    *((volatile unsigned int*)(0x42A68A48UL))
#define bM4_DMA2_SNSEQCTL0_SOFFSET19                    *((volatile unsigned int*)(0x42A68A4CUL))
#define bM4_DMA2_SNSEQCTL0_SNSCNT0                      *((volatile unsigned int*)(0x42A68A50UL))
#define bM4_DMA2_SNSEQCTL0_SNSCNT1                      *((volatile unsigned int*)(0x42A68A54UL))
#define bM4_DMA2_SNSEQCTL0_SNSCNT2                      *((volatile unsigned int*)(0x42A68A58UL))
#define bM4_DMA2_SNSEQCTL0_SNSCNT3                      *((volatile unsigned int*)(0x42A68A5CUL))
#define bM4_DMA2_SNSEQCTL0_SNSCNT4                      *((volatile unsigned int*)(0x42A68A60UL))
#define bM4_DMA2_SNSEQCTL0_SNSCNT5                      *((volatile unsigned int*)(0x42A68A64UL))
#define bM4_DMA2_SNSEQCTL0_SNSCNT6                      *((volatile unsigned int*)(0x42A68A68UL))
#define bM4_DMA2_SNSEQCTL0_SNSCNT7                      *((volatile unsigned int*)(0x42A68A6CUL))
#define bM4_DMA2_SNSEQCTL0_SNSCNT8                      *((volatile unsigned int*)(0x42A68A70UL))
#define bM4_DMA2_SNSEQCTL0_SNSCNT9                      *((volatile unsigned int*)(0x42A68A74UL))
#define bM4_DMA2_SNSEQCTL0_SNSCNT10                     *((volatile unsigned int*)(0x42A68A78UL))
#define bM4_DMA2_SNSEQCTL0_SNSCNT11                     *((volatile unsigned int*)(0x42A68A7CUL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST0                    *((volatile unsigned int*)(0x42A68A00UL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST1                    *((volatile unsigned int*)(0x42A68A04UL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST2                    *((volatile unsigned int*)(0x42A68A08UL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST3                    *((volatile unsigned int*)(0x42A68A0CUL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST4                    *((volatile unsigned int*)(0x42A68A10UL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST5                    *((volatile unsigned int*)(0x42A68A14UL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST6                    *((volatile unsigned int*)(0x42A68A18UL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST7                    *((volatile unsigned int*)(0x42A68A1CUL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST8                    *((volatile unsigned int*)(0x42A68A20UL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST9                    *((volatile unsigned int*)(0x42A68A24UL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST10                   *((volatile unsigned int*)(0x42A68A28UL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST11                   *((volatile unsigned int*)(0x42A68A2CUL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST12                   *((volatile unsigned int*)(0x42A68A30UL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST13                   *((volatile unsigned int*)(0x42A68A34UL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST14                   *((volatile unsigned int*)(0x42A68A38UL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST15                   *((volatile unsigned int*)(0x42A68A3CUL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST16                   *((volatile unsigned int*)(0x42A68A40UL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST17                   *((volatile unsigned int*)(0x42A68A44UL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST18                   *((volatile unsigned int*)(0x42A68A48UL))
#define bM4_DMA2_SNSEQCTLB0_SNSDIST19                   *((volatile unsigned int*)(0x42A68A4CUL))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB0                    *((volatile unsigned int*)(0x42A68A50UL))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB1                    *((volatile unsigned int*)(0x42A68A54UL))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB2                    *((volatile unsigned int*)(0x42A68A58UL))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB3                    *((volatile unsigned int*)(0x42A68A5CUL))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB4                    *((volatile unsigned int*)(0x42A68A60UL))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB5                    *((volatile unsigned int*)(0x42A68A64UL))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB6                    *((volatile unsigned int*)(0x42A68A68UL))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB7                    *((volatile unsigned int*)(0x42A68A6CUL))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB8                    *((volatile unsigned int*)(0x42A68A70UL))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB9                    *((volatile unsigned int*)(0x42A68A74UL))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB10                   *((volatile unsigned int*)(0x42A68A78UL))
#define bM4_DMA2_SNSEQCTLB0_SNSCNTB11                   *((volatile unsigned int*)(0x42A68A7CUL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET0                     *((volatile unsigned int*)(0x42A68A80UL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET1                     *((volatile unsigned int*)(0x42A68A84UL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET2                     *((volatile unsigned int*)(0x42A68A88UL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET3                     *((volatile unsigned int*)(0x42A68A8CUL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET4                     *((volatile unsigned int*)(0x42A68A90UL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET5                     *((volatile unsigned int*)(0x42A68A94UL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET6                     *((volatile unsigned int*)(0x42A68A98UL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET7                     *((volatile unsigned int*)(0x42A68A9CUL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET8                     *((volatile unsigned int*)(0x42A68AA0UL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET9                     *((volatile unsigned int*)(0x42A68AA4UL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET10                    *((volatile unsigned int*)(0x42A68AA8UL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET11                    *((volatile unsigned int*)(0x42A68AACUL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET12                    *((volatile unsigned int*)(0x42A68AB0UL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET13                    *((volatile unsigned int*)(0x42A68AB4UL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET14                    *((volatile unsigned int*)(0x42A68AB8UL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET15                    *((volatile unsigned int*)(0x42A68ABCUL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET16                    *((volatile unsigned int*)(0x42A68AC0UL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET17                    *((volatile unsigned int*)(0x42A68AC4UL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET18                    *((volatile unsigned int*)(0x42A68AC8UL))
#define bM4_DMA2_DNSEQCTL0_DOFFSET19                    *((volatile unsigned int*)(0x42A68ACCUL))
#define bM4_DMA2_DNSEQCTL0_DNSCNT0                      *((volatile unsigned int*)(0x42A68AD0UL))
#define bM4_DMA2_DNSEQCTL0_DNSCNT1                      *((volatile unsigned int*)(0x42A68AD4UL))
#define bM4_DMA2_DNSEQCTL0_DNSCNT2                      *((volatile unsigned int*)(0x42A68AD8UL))
#define bM4_DMA2_DNSEQCTL0_DNSCNT3                      *((volatile unsigned int*)(0x42A68ADCUL))
#define bM4_DMA2_DNSEQCTL0_DNSCNT4                      *((volatile unsigned int*)(0x42A68AE0UL))
#define bM4_DMA2_DNSEQCTL0_DNSCNT5                      *((volatile unsigned int*)(0x42A68AE4UL))
#define bM4_DMA2_DNSEQCTL0_DNSCNT6                      *((volatile unsigned int*)(0x42A68AE8UL))
#define bM4_DMA2_DNSEQCTL0_DNSCNT7                      *((volatile unsigned int*)(0x42A68AECUL))
#define bM4_DMA2_DNSEQCTL0_DNSCNT8                      *((volatile unsigned int*)(0x42A68AF0UL))
#define bM4_DMA2_DNSEQCTL0_DNSCNT9                      *((volatile unsigned int*)(0x42A68AF4UL))
#define bM4_DMA2_DNSEQCTL0_DNSCNT10                     *((volatile unsigned int*)(0x42A68AF8UL))
#define bM4_DMA2_DNSEQCTL0_DNSCNT11                     *((volatile unsigned int*)(0x42A68AFCUL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST0                    *((volatile unsigned int*)(0x42A68A80UL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST1                    *((volatile unsigned int*)(0x42A68A84UL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST2                    *((volatile unsigned int*)(0x42A68A88UL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST3                    *((volatile unsigned int*)(0x42A68A8CUL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST4                    *((volatile unsigned int*)(0x42A68A90UL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST5                    *((volatile unsigned int*)(0x42A68A94UL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST6                    *((volatile unsigned int*)(0x42A68A98UL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST7                    *((volatile unsigned int*)(0x42A68A9CUL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST8                    *((volatile unsigned int*)(0x42A68AA0UL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST9                    *((volatile unsigned int*)(0x42A68AA4UL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST10                   *((volatile unsigned int*)(0x42A68AA8UL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST11                   *((volatile unsigned int*)(0x42A68AACUL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST12                   *((volatile unsigned int*)(0x42A68AB0UL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST13                   *((volatile unsigned int*)(0x42A68AB4UL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST14                   *((volatile unsigned int*)(0x42A68AB8UL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST15                   *((volatile unsigned int*)(0x42A68ABCUL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST16                   *((volatile unsigned int*)(0x42A68AC0UL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST17                   *((volatile unsigned int*)(0x42A68AC4UL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST18                   *((volatile unsigned int*)(0x42A68AC8UL))
#define bM4_DMA2_DNSEQCTLB0_DNSDIST19                   *((volatile unsigned int*)(0x42A68ACCUL))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB0                    *((volatile unsigned int*)(0x42A68AD0UL))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB1                    *((volatile unsigned int*)(0x42A68AD4UL))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB2                    *((volatile unsigned int*)(0x42A68AD8UL))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB3                    *((volatile unsigned int*)(0x42A68ADCUL))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB4                    *((volatile unsigned int*)(0x42A68AE0UL))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB5                    *((volatile unsigned int*)(0x42A68AE4UL))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB6                    *((volatile unsigned int*)(0x42A68AE8UL))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB7                    *((volatile unsigned int*)(0x42A68AECUL))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB8                    *((volatile unsigned int*)(0x42A68AF0UL))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB9                    *((volatile unsigned int*)(0x42A68AF4UL))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB10                   *((volatile unsigned int*)(0x42A68AF8UL))
#define bM4_DMA2_DNSEQCTLB0_DNSCNTB11                   *((volatile unsigned int*)(0x42A68AFCUL))
#define bM4_DMA2_LLP0_LLP0                              *((volatile unsigned int*)(0x42A68B08UL))
#define bM4_DMA2_LLP0_LLP1                              *((volatile unsigned int*)(0x42A68B0CUL))
#define bM4_DMA2_LLP0_LLP2                              *((volatile unsigned int*)(0x42A68B10UL))
#define bM4_DMA2_LLP0_LLP3                              *((volatile unsigned int*)(0x42A68B14UL))
#define bM4_DMA2_LLP0_LLP4                              *((volatile unsigned int*)(0x42A68B18UL))
#define bM4_DMA2_LLP0_LLP5                              *((volatile unsigned int*)(0x42A68B1CUL))
#define bM4_DMA2_LLP0_LLP6                              *((volatile unsigned int*)(0x42A68B20UL))
#define bM4_DMA2_LLP0_LLP7                              *((volatile unsigned int*)(0x42A68B24UL))
#define bM4_DMA2_LLP0_LLP8                              *((volatile unsigned int*)(0x42A68B28UL))
#define bM4_DMA2_LLP0_LLP9                              *((volatile unsigned int*)(0x42A68B2CUL))
#define bM4_DMA2_LLP0_LLP10                             *((volatile unsigned int*)(0x42A68B30UL))
#define bM4_DMA2_LLP0_LLP11                             *((volatile unsigned int*)(0x42A68B34UL))
#define bM4_DMA2_LLP0_LLP12                             *((volatile unsigned int*)(0x42A68B38UL))
#define bM4_DMA2_LLP0_LLP13                             *((volatile unsigned int*)(0x42A68B3CUL))
#define bM4_DMA2_LLP0_LLP14                             *((volatile unsigned int*)(0x42A68B40UL))
#define bM4_DMA2_LLP0_LLP15                             *((volatile unsigned int*)(0x42A68B44UL))
#define bM4_DMA2_LLP0_LLP16                             *((volatile unsigned int*)(0x42A68B48UL))
#define bM4_DMA2_LLP0_LLP17                             *((volatile unsigned int*)(0x42A68B4CUL))
#define bM4_DMA2_LLP0_LLP18                             *((volatile unsigned int*)(0x42A68B50UL))
#define bM4_DMA2_LLP0_LLP19                             *((volatile unsigned int*)(0x42A68B54UL))
