CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_DMA2_LLP0_LLP20                             *((volatile unsigned int*)(0x42A68B58UL))
#define bM4_DMA2_LLP0_LLP21                             *((volatile unsigned int*)(0x42A68B5CUL))
#define bM4_DMA2_LLP0_LLP22                             *((volatile unsigned int*)(0x42A68B60UL))
#define bM4_DMA2_LLP0_LLP23                             *((volatile unsigned int*)(0x42A68B64UL))
#define bM4_DMA2_LLP0_LLP24                             *((volatile unsigned int*)(0x42A68B68UL))
#define bM4_DMA2_LLP0_LLP25                             *((volatile unsigned int*)(0x42A68B6CUL))
#define bM4_DMA2_LLP0_LLP26                             *((volatile unsigned int*)(0x42A68B70UL))
#define bM4_DMA2_LLP0_LLP27                             *((volatile unsigned int*)(0x42A68B74UL))
#define bM4_DMA2_LLP0_LLP28                             *((volatile unsigned int*)(0x42A68B78UL))
#define bM4_DMA2_LLP0_LLP29                             *((volatile unsigned int*)(0x42A68B7CUL))
#define bM4_DMA2_CH0CTL_SINC0                           *((volatile unsigned int*)(0x42A68B80UL))
#define bM4_DMA2_CH0CTL_SINC1                           *((volatile unsigned int*)(0x42A68B84UL))
#define bM4_DMA2_CH0CTL_DINC0                           *((volatile unsigned int*)(0x42A68B88UL))
#define bM4_DMA2_CH0CTL_DINC1                           *((volatile unsigned int*)(0x42A68B8CUL))
#define bM4_DMA2_CH0CTL_SRTPEN                          *((volatile unsigned int*)(0x42A68B90UL))
#define bM4_DMA2_CH0CTL_DRPTEN                          *((volatile unsigned int*)(0x42A68B94UL))
#define bM4_DMA2_CH0CTL_SNSEQEN                         *((volatile unsigned int*)(0x42A68B98UL))
#define bM4_DMA2_CH0CTL_DNSEQEN                         *((volatile unsigned int*)(0x42A68B9CUL))
#define bM4_DMA2_CH0CTL_HSIZE0                          *((volatile unsigned int*)(0x42A68BA0UL))
#define bM4_DMA2_CH0CTL_HSIZE1                          *((volatile unsigned int*)(0x42A68BA4UL))
#define bM4_DMA2_CH0CTL_LLPEN                           *((volatile unsigned int*)(0x42A68BA8UL))
#define bM4_DMA2_CH0CTL_LLPRUN                          *((volatile unsigned int*)(0x42A68BACUL))
#define bM4_DMA2_CH0CTL_IE                              *((volatile unsigned int*)(0x42A68BB0UL))
#define bM4_DMA2_MONDTCTL0_BLKSIZE0                     *((volatile unsigned int*)(0x42A68D00UL))
#define bM4_DMA2_MONDTCTL0_BLKSIZE1                     *((volatile unsigned int*)(0x42A68D04UL))
#define bM4_DMA2_MONDTCTL0_BLKSIZE2                     *((volatile unsigned int*)(0x42A68D08UL))
#define bM4_DMA2_MONDTCTL0_BLKSIZE3                     *((volatile unsigned int*)(0x42A68D0CUL))
#define bM4_DMA2_MONDTCTL0_BLKSIZE4                     *((volatile unsigned int*)(0x42A68D10UL))
#define bM4_DMA2_MONDTCTL0_BLKSIZE5                     *((volatile unsigned int*)(0x42A68D14UL))
#define bM4_DMA2_MONDTCTL0_BLKSIZE6                     *((volatile unsigned int*)(0x42A68D18UL))
#define bM4_DMA2_MONDTCTL0_BLKSIZE7                     *((volatile unsigned int*)(0x42A68D1CUL))
#define bM4_DMA2_MONDTCTL0_BLKSIZE8                     *((volatile unsigned int*)(0x42A68D20UL))
#define bM4_DMA2_MONDTCTL0_BLKSIZE9                     *((volatile unsigned int*)(0x42A68D24UL))
#define bM4_DMA2_MONDTCTL0_CNT0                         *((volatile unsigned int*)(0x42A68D40UL))
#define bM4_DMA2_MONDTCTL0_CNT1                         *((volatile unsigned int*)(0x42A68D44UL))
#define bM4_DMA2_MONDTCTL0_CNT2                         *((volatile unsigned int*)(0x42A68D48UL))
#define bM4_DMA2_MONDTCTL0_CNT3                         *((volatile unsigned int*)(0x42A68D4CUL))
#define bM4_DMA2_MONDTCTL0_CNT4                         *((volatile unsigned int*)(0x42A68D50UL))
#define bM4_DMA2_MONDTCTL0_CNT5                         *((volatile unsigned int*)(0x42A68D54UL))
#define bM4_DMA2_MONDTCTL0_CNT6                         *((volatile unsigned int*)(0x42A68D58UL))
#define bM4_DMA2_MONDTCTL0_CNT7                         *((volatile unsigned int*)(0x42A68D5CUL))
#define bM4_DMA2_MONDTCTL0_CNT8                         *((volatile unsigned int*)(0x42A68D60UL))
#define bM4_DMA2_MONDTCTL0_CNT9                         *((volatile unsigned int*)(0x42A68D64UL))
#define bM4_DMA2_MONDTCTL0_CNT10                        *((volatile unsigned int*)(0x42A68D68UL))
#define bM4_DMA2_MONDTCTL0_CNT11                        *((volatile unsigned int*)(0x42A68D6CUL))
#define bM4_DMA2_MONDTCTL0_CNT12                        *((volatile unsigned int*)(0x42A68D70UL))
#define bM4_DMA2_MONDTCTL0_CNT13                        *((volatile unsigned int*)(0x42A68D74UL))
#define bM4_DMA2_MONDTCTL0_CNT14                        *((volatile unsigned int*)(0x42A68D78UL))
#define bM4_DMA2_MONDTCTL0_CNT15                        *((volatile unsigned int*)(0x42A68D7CUL))
#define bM4_DMA2_MONRPT0_SRPT0                          *((volatile unsigned int*)(0x42A68D80UL))
#define bM4_DMA2_MONRPT0_SRPT1                          *((volatile unsigned int*)(0x42A68D84UL))
#define bM4_DMA2_MONRPT0_SRPT2                          *((volatile unsigned int*)(0x42A68D88UL))
#define bM4_DMA2_MONRPT0_SRPT3                          *((volatile unsigned int*)(0x42A68D8CUL))
#define bM4_DMA2_MONRPT0_SRPT4                          *((volatile unsigned int*)(0x42A68D90UL))
#define bM4_DMA2_MONRPT0_SRPT5                          *((volatile unsigned int*)(0x42A68D94UL))
#define bM4_DMA2_MONRPT0_SRPT6                          *((volatile unsigned int*)(0x42A68D98UL))
#define bM4_DMA2_MONRPT0_SRPT7                          *((volatile unsigned int*)(0x42A68D9CUL))
#define bM4_DMA2_MONRPT0_SRPT8                          *((volatile unsigned int*)(0x42A68DA0UL))
#define bM4_DMA2_MONRPT0_SRPT9                          *((volatile unsigned int*)(0x42A68DA4UL))
#define bM4_DMA2_MONRPT0_DRPT0                          *((volatile unsigned int*)(0x42A68DC0UL))
#define bM4_DMA2_MONRPT0_DRPT1                          *((volatile unsigned int*)(0x42A68DC4UL))
#define bM4_DMA2_MONRPT0_DRPT2                          *((volatile unsigned int*)(0x42A68DC8UL))
#define bM4_DMA2_MONRPT0_DRPT3                          *((volatile unsigned int*)(0x42A68DCCUL))
#define bM4_DMA2_MONRPT0_DRPT4                          *((volatile unsigned int*)(0x42A68DD0UL))
#define bM4_DMA2_MONRPT0_DRPT5                          *((volatile unsigned int*)(0x42A68DD4UL))
#define bM4_DMA2_MONRPT0_DRPT6                          *((volatile unsigned int*)(0x42A68DD8UL))
#define bM4_DMA2_MONRPT0_DRPT7                          *((volatile unsigned int*)(0x42A68DDCUL))
#define bM4_DMA2_MONRPT0_DRPT8                          *((volatile unsigned int*)(0x42A68DE0UL))
#define bM4_DMA2_MONRPT0_DRPT9                          *((volatile unsigned int*)(0x42A68DE4UL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET0                  *((volatile unsigned int*)(0x42A68E00UL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET1                  *((volatile unsigned int*)(0x42A68E04UL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET2                  *((volatile unsigned int*)(0x42A68E08UL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET3                  *((volatile unsigned int*)(0x42A68E0CUL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET4                  *((volatile unsigned int*)(0x42A68E10UL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET5                  *((volatile unsigned int*)(0x42A68E14UL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET6                  *((volatile unsigned int*)(0x42A68E18UL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET7                  *((volatile unsigned int*)(0x42A68E1CUL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET8                  *((volatile unsigned int*)(0x42A68E20UL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET9                  *((volatile unsigned int*)(0x42A68E24UL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET10                 *((volatile unsigned int*)(0x42A68E28UL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET11                 *((volatile unsigned int*)(0x42A68E2CUL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET12                 *((volatile unsigned int*)(0x42A68E30UL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET13                 *((volatile unsigned int*)(0x42A68E34UL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET14                 *((volatile unsigned int*)(0x42A68E38UL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET15                 *((volatile unsigned int*)(0x42A68E3CUL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET16                 *((volatile unsigned int*)(0x42A68E40UL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET17                 *((volatile unsigned int*)(0x42A68E44UL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET18                 *((volatile unsigned int*)(0x42A68E48UL))
#define bM4_DMA2_MONSNSEQCTL0_SOFFSET19                 *((volatile unsigned int*)(0x42A68E4CUL))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT0                   *((volatile unsigned int*)(0x42A68E50UL))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT1                   *((volatile unsigned int*)(0x42A68E54UL))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT2                   *((volatile unsigned int*)(0x42A68E58UL))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT3                   *((volatile unsigned int*)(0x42A68E5CUL))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT4                   *((volatile unsigned int*)(0x42A68E60UL))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT5                   *((volatile unsigned int*)(0x42A68E64UL))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT6                   *((volatile unsigned int*)(0x42A68E68UL))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT7                   *((volatile unsigned int*)(0x42A68E6CUL))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT8                   *((volatile unsigned int*)(0x42A68E70UL))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT9                   *((volatile unsigned int*)(0x42A68E74UL))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT10                  *((volatile unsigned int*)(0x42A68E78UL))
#define bM4_DMA2_MONSNSEQCTL0_SNSCNT11                  *((volatile unsigned int*)(0x42A68E7CUL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET0                  *((volatile unsigned int*)(0x42A68E80UL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET1                  *((volatile unsigned int*)(0x42A68E84UL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET2                  *((volatile unsigned int*)(0x42A68E88UL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET3                  *((volatile unsigned int*)(0x42A68E8CUL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET4                  *((volatile unsigned int*)(0x42A68E90UL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET5                  *((volatile unsigned int*)(0x42A68E94UL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET6                  *((volatile unsigned int*)(0x42A68E98UL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET7                  *((volatile unsigned int*)(0x42A68E9CUL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET8                  *((volatile unsigned int*)(0x42A68EA0UL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET9                  *((volatile unsigned int*)(0x42A68EA4UL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET10                 *((volatile unsigned int*)(0x42A68EA8UL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET11                 *((volatile unsigned int*)(0x42A68EACUL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET12                 *((volatile unsigned int*)(0x42A68EB0UL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET13                 *((volatile unsigned int*)(0x42A68EB4UL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET14                 *((volatile unsigned int*)(0x42A68EB8UL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET15                 *((volatile unsigned int*)(0x42A68EBCUL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET16                 *((volatile unsigned int*)(0x42A68EC0UL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET17                 *((volatile unsigned int*)(0x42A68EC4UL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET18                 *((volatile unsigned int*)(0x42A68EC8UL))
#define bM4_DMA2_MONDNSEQCTL0_DOFFSET19                 *((volatile unsigned int*)(0x42A68ECCUL))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT0                   *((volatile unsigned int*)(0x42A68ED0UL))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT1                   *((volatile unsigned int*)(0x42A68ED4UL))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT2                   *((volatile unsigned int*)(0x42A68ED8UL))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT3                   *((volatile unsigned int*)(0x42A68EDCUL))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT4                   *((volatile unsigned int*)(0x42A68EE0UL))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT5                   *((volatile unsigned int*)(0x42A68EE4UL))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT6                   *((volatile unsigned int*)(0x42A68EE8UL))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT7                   *((volatile unsigned int*)(0x42A68EECUL))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT8                   *((volatile unsigned int*)(0x42A68EF0UL))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT9                   *((volatile unsigned int*)(0x42A68EF4UL))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT10                  *((volatile unsigned int*)(0x42A68EF8UL))
#define bM4_DMA2_MONDNSEQCTL0_DNSCNT11                  *((volatile unsigned int*)(0x42A68EFCUL))
#define bM4_DMA2_DTCTL1_BLKSIZE0                        *((volatile unsigned int*)(0x42A69100UL))
#define bM4_DMA2_DTCTL1_BLKSIZE1                        *((volatile unsigned int*)(0x42A69104UL))
#define bM4_DMA2_DTCTL1_BLKSIZE2                        *((volatile unsigned int*)(0x42A69108UL))
#define bM4_DMA2_DTCTL1_BLKSIZE3                        *((volatile unsigned int*)(0x42A6910CUL))
#define bM4_DMA2_DTCTL1_BLKSIZE4                        *((volatile unsigned int*)(0x42A69110UL))
#define bM4_DMA2_DTCTL1_BLKSIZE5                        *((volatile unsigned int*)(0x42A69114UL))
#define bM4_DMA2_DTCTL1_BLKSIZE6                        *((volatile unsigned int*)(0x42A69118UL))
#define bM4_DMA2_DTCTL1_BLKSIZE7                        *((volatile unsigned int*)(0x42A6911CUL))
#define bM4_DMA2_DTCTL1_BLKSIZE8                        *((volatile unsigned int*)(0x42A69120UL))
#define bM4_DMA2_DTCTL1_BLKSIZE9                        *((volatile unsigned int*)(0x42A69124UL))
#define bM4_DMA2_DTCTL1_CNT0                            *((volatile unsigned int*)(0x42A69140UL))
#define bM4_DMA2_DTCTL1_CNT1                            *((volatile unsigned int*)(0x42A69144UL))
#define bM4_DMA2_DTCTL1_CNT2                            *((volatile unsigned int*)(0x42A69148UL))
#define bM4_DMA2_DTCTL1_CNT3                            *((volatile unsigned int*)(0x42A6914CUL))
#define bM4_DMA2_DTCTL1_CNT4                            *((volatile unsigned int*)(0x42A69150UL))
#define bM4_DMA2_DTCTL1_CNT5                            *((volatile unsigned int*)(0x42A69154UL))
#define bM4_DMA2_DTCTL1_CNT6                            *((volatile unsigned int*)(0x42A69158UL))
#define bM4_DMA2_DTCTL1_CNT7                            *((volatile unsigned int*)(0x42A6915CUL))
#define bM4_DMA2_DTCTL1_CNT8                            *((volatile unsigned int*)(0x42A69160UL))
#define bM4_DMA2_DTCTL1_CNT9                            *((volatile unsigned int*)(0x42A69164UL))
#define bM4_DMA2_DTCTL1_CNT10                           *((volatile unsigned int*)(0x42A69168UL))
#define bM4_DMA2_DTCTL1_CNT11                           *((volatile unsigned int*)(0x42A6916CUL))
#define bM4_DMA2_DTCTL1_CNT12                           *((volatile unsigned int*)(0x42A69170UL))
#define bM4_DMA2_DTCTL1_CNT13                           *((volatile unsigned int*)(0x42A69174UL))
#define bM4_DMA2_DTCTL1_CNT14                           *((volatile unsigned int*)(0x42A69178UL))
#define bM4_DMA2_DTCTL1_CNT15                           *((volatile unsigned int*)(0x42A6917CUL))
#define bM4_DMA2_RPT1_SRPT0                             *((volatile unsigned int*)(0x42A69180UL))
#define bM4_DMA2_RPT1_SRPT1                             *((volatile unsigned int*)(0x42A69184UL))
#define bM4_DMA2_RPT1_SRPT2                             *((volatile unsigned int*)(0x42A69188UL))
#define bM4_DMA2_RPT1_SRPT3                             *((volatile unsigned int*)(0x42A6918CUL))
#define bM4_DMA2_RPT1_SRPT4                             *((volatile unsigned int*)(0x42A69190UL))
#define bM4_DMA2_RPT1_SRPT5                             *((volatile unsigned int*)(0x42A69194UL))
#define bM4_DMA2_RPT1_SRPT6                             *((volatile unsigned int*)(0x42A69198UL))
#define bM4_DMA2_RPT1_SRPT7                             *((volatile unsigned int*)(0x42A6919CUL))
#define bM4_DMA2_RPT1_SRPT8                             *((volatile unsigned int*)(0x42A691A0UL))
#define bM4_DMA2_RPT1_SRPT9                             *((volatile unsigned int*)(0x42A691A4UL))
#define bM4_DMA2_RPT1_DRPT0                             *((volatile unsigned int*)(0x42A691C0UL))
#define bM4_DMA2_RPT1_DRPT1                             *((volatile unsigned int*)(0x42A691C4UL))
#define bM4_DMA2_RPT1_DRPT2                             *((volatile unsigned int*)(0x42A691C8UL))
#define bM4_DMA2_RPT1_DRPT3                             *((volatile unsigned int*)(0x42A691CCUL))
#define bM4_DMA2_RPT1_DRPT4                             *((volatile unsigned int*)(0x42A691D0UL))
#define bM4_DMA2_RPT1_DRPT5                             *((volatile unsigned int*)(0x42A691D4UL))
#define bM4_DMA2_RPT1_DRPT6                             *((volatile unsigned int*)(0x42A691D8UL))
#define bM4_DMA2_RPT1_DRPT7                             *((volatile unsigned int*)(0x42A691DCUL))
#define bM4_DMA2_RPT1_DRPT8                             *((volatile unsigned int*)(0x42A691E0UL))
#define bM4_DMA2_RPT1_DRPT9                             *((volatile unsigned int*)(0x42A691E4UL))
#define bM4_DMA2_RPTB1_SRPTB0                           *((volatile unsigned int*)(0x42A69180UL))
#define bM4_DMA2_RPTB1_SRPTB1                           *((volatile unsigned int*)(0x42A69184UL))
#define bM4_DMA2_RPTB1_SRPTB2                           *((volatile unsigned int*)(0x42A69188UL))
#define bM4_DMA2_RPTB1_SRPTB3                           *((volatile unsigned int*)(0x42A6918CUL))
#define bM4_DMA2_RPTB1_SRPTB4                           *((volatile unsigned int*)(0x42A69190UL))
#define bM4_DMA2_RPTB1_SRPTB5                           *((volatile unsigned int*)(0x42A69194UL))
#define bM4_DMA2_RPTB1_SRPTB6                           *((volatile unsigned int*)(0x42A69198UL))
#define bM4_DMA2_RPTB1_SRPTB7                           *((volatile unsigned int*)(0x42A6919CUL))
#define bM4_DMA2_RPTB1_SRPTB8                           *((volatile unsigned int*)(0x42A691A0UL))
#define bM4_DMA2_RPTB1_SRPTB9                           *((volatile unsigned int*)(0x42A691A4UL))
#define bM4_DMA2_RPTB1_DRPTB0                           *((volatile unsigned int*)(0x42A691C0UL))
#define bM4_DMA2_RPTB1_DRPTB1                           *((volatile unsigned int*)(0x42A691C4UL))
#define bM4_DMA2_RPTB1_DRPTB2                           *((volatile unsigned int*)(0x42A691C8UL))
#define bM4_DMA2_RPTB1_DRPTB3                           *((volatile unsigned int*)(0x42A691CCUL))
#define bM4_DMA2_RPTB1_DRPTB4                           *((volatile unsigned int*)(0x42A691D0UL))
#define bM4_DMA2_RPTB1_DRPTB5                           *((volatile unsigned int*)(0x42A691D4UL))
#define bM4_DMA2_RPTB1_DRPTB6                           *((volatile unsigned int*)(0x42A691D8UL))
#define bM4_DMA2_RPTB1_DRPTB7                           *((volatile unsigned int*)(0x42A691DCUL))
#define bM4_DMA2_RPTB1_DRPTB8                           *((volatile unsigned int*)(0x42A691E0UL))
#define bM4_DMA2_RPTB1_DRPTB9                           *((volatile unsigned int*)(0x42A691E4UL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET0                     *((volatile unsigned int*)(0x42A69200UL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET1                     *((volatile unsigned int*)(0x42A69204UL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET2                     *((volatile unsigned int*)(0x42A69208UL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET3                     *((volatile unsigned int*)(0x42A6920CUL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET4                     *((volatile unsigned int*)(0x42A69210UL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET5                     *((volatile unsigned int*)(0x42A69214UL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET6                     *((volatile unsigned int*)(0x42A69218UL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET7                     *((volatile unsigned int*)(0x42A6921CUL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET8                     *((volatile unsigned int*)(0x42A69220UL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET9                     *((volatile unsigned int*)(0x42A69224UL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET10                    *((volatile unsigned int*)(0x42A69228UL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET11                    *((volatile unsigned int*)(0x42A6922CUL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET12                    *((volatile unsigned int*)(0x42A69230UL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET13                    *((volatile unsigned int*)(0x42A69234UL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET14                    *((volatile unsigned int*)(0x42A69238UL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET15                    *((volatile unsigned int*)(0x42A6923CUL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET16                    *((volatile unsigned int*)(0x42A69240UL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET17                    *((volatile unsigned int*)(0x42A69244UL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET18                    *((volatile unsigned int*)(0x42A69248UL))
#define bM4_DMA2_SNSEQCTL1_SOFFSET19                    *((volatile unsigned int*)(0x42A6924CUL))
#define bM4_DMA2_SNSEQCTL1_SNSCNT0                      *((volatile unsigned int*)(0x42A69250UL))
#define bM4_DMA2_SNSEQCTL1_SNSCNT1                      *((volatile unsigned int*)(0x42A69254UL))
#define bM4_DMA2_SNSEQCTL1_SNSCNT2                      *((volatile unsigned int*)(0x42A69258UL))
#define bM4_DMA2_SNSEQCTL1_SNSCNT3                      *((volatile unsigned int*)(0x42A6925CUL))
#define bM4_DMA2_SNSEQCTL1_SNSCNT4                      *((volatile unsigned int*)(0x42A69260UL))
#define bM4_DMA2_SNSEQCTL1_SNSCNT5                      *((volatile unsigned int*)(0x42A69264UL))
#define bM4_DMA2_SNSEQCTL1_SNSCNT6                      *((volatile unsigned int*)(0x42A69268UL))
#define bM4_DMA2_SNSEQCTL1_SNSCNT7                      *((volatile unsigned int*)(0x42A6926CUL))
#define bM4_DMA2_SNSEQCTL1_SNSCNT8                      *((volatile unsigned int*)(0x42A69270UL))
#define bM4_DMA2_SNSEQCTL1_SNSCNT9                      *((volatile unsigned int*)(0x42A69274UL))
#define bM4_DMA2_SNSEQCTL1_SNSCNT10                     *((volatile unsigned int*)(0x42A69278UL))
#define bM4_DMA2_SNSEQCTL1_SNSCNT11                     *((volatile unsigned int*)(0x42A6927CUL))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST0                    *((volatile unsigned int*)(0x42A69200UL))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST1                    *((volatile unsigned int*)(0x42A69204UL))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST2                    *((volatile unsigned int*)(0x42A69208UL))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST3                    *((volatile unsigned int*)(0x42A6920CUL))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST4                    *((volatile unsigned int*)(0x42A69210UL))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST5                    *((volatile unsigned int*)(0x42A69214UL))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST6                    *((volatile unsigned int*)(0x42A69218UL))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST7                    *((volatile unsigned int*)(0x42A6921CUL))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST8                    *((volatile unsigned int*)(0x42A69220UL))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST9                    *((volatile unsigned int*)(0x42A69224UL))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST10                   *((volatile unsigned int*)(0x42A69228UL))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST11                   *((volatile unsigned int*)(0x42A6922CUL))
#define bM4_DMA2_SNSEQCTLB1_SNSDIST12                   *((volatile unsigned int*)(0x42A69230UL))
