CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_DMA2_DNSEQCTL3_DOFFSET19                    *((volatile unsigned int*)(0x42A6A2CCUL))
#define bM4_DMA2_DNSEQCTL3_DNSCNT0                      *((volatile unsigned int*)(0x42A6A2D0UL))
#define bM4_DMA2_DNSEQCTL3_DNSCNT1                      *((volatile unsigned int*)(0x42A6A2D4UL))
#define bM4_DMA2_DNSEQCTL3_DNSCNT2                      *((volatile unsigned int*)(0x42A6A2D8UL))
#define bM4_DMA2_DNSEQCTL3_DNSCNT3                      *((volatile unsigned int*)(0x42A6A2DCUL))
#define bM4_DMA2_DNSEQCTL3_DNSCNT4                      *((volatile unsigned int*)(0x42A6A2E0UL))
#define bM4_DMA2_DNSEQCTL3_DNSCNT5                      *((volatile unsigned int*)(0x42A6A2E4UL))
#define bM4_DMA2_DNSEQCTL3_DNSCNT6                      *((volatile unsigned int*)(0x42A6A2E8UL))
#define bM4_DMA2_DNSEQCTL3_DNSCNT7                      *((volatile unsigned int*)(0x42A6A2ECUL))
#define bM4_DMA2_DNSEQCTL3_DNSCNT8                      *((volatile unsigned int*)(0x42A6A2F0UL))
#define bM4_DMA2_DNSEQCTL3_DNSCNT9                      *((volatile unsigned int*)(0x42A6A2F4UL))
#define bM4_DMA2_DNSEQCTL3_DNSCNT10                     *((volatile unsigned int*)(0x42A6A2F8UL))
#define bM4_DMA2_DNSEQCTL3_DNSCNT11                     *((volatile unsigned int*)(0x42A6A2FCUL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST0                    *((volatile unsigned int*)(0x42A6A280UL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST1                    *((volatile unsigned int*)(0x42A6A284UL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST2                    *((volatile unsigned int*)(0x42A6A288UL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST3                    *((volatile unsigned int*)(0x42A6A28CUL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST4                    *((volatile unsigned int*)(0x42A6A290UL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST5                    *((volatile unsigned int*)(0x42A6A294UL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST6                    *((volatile unsigned int*)(0x42A6A298UL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST7                    *((volatile unsigned int*)(0x42A6A29CUL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST8                    *((volatile unsigned int*)(0x42A6A2A0UL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST9                    *((volatile unsigned int*)(0x42A6A2A4UL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST10                   *((volatile unsigned int*)(0x42A6A2A8UL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST11                   *((volatile unsigned int*)(0x42A6A2ACUL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST12                   *((volatile unsigned int*)(0x42A6A2B0UL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST13                   *((volatile unsigned int*)(0x42A6A2B4UL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST14                   *((volatile unsigned int*)(0x42A6A2B8UL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST15                   *((volatile unsigned int*)(0x42A6A2BCUL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST16                   *((volatile unsigned int*)(0x42A6A2C0UL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST17                   *((volatile unsigned int*)(0x42A6A2C4UL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST18                   *((volatile unsigned int*)(0x42A6A2C8UL))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST19                   *((volatile unsigned int*)(0x42A6A2CCUL))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB0                    *((volatile unsigned int*)(0x42A6A2D0UL))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB1                    *((volatile unsigned int*)(0x42A6A2D4UL))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB2                    *((volatile unsigned int*)(0x42A6A2D8UL))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB3                    *((volatile unsigned int*)(0x42A6A2DCUL))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB4                    *((volatile unsigned int*)(0x42A6A2E0UL))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB5                    *((volatile unsigned int*)(0x42A6A2E4UL))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB6                    *((volatile unsigned int*)(0x42A6A2E8UL))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB7                    *((volatile unsigned int*)(0x42A6A2ECUL))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB8                    *((volatile unsigned int*)(0x42A6A2F0UL))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB9                    *((volatile unsigned int*)(0x42A6A2F4UL))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB10                   *((volatile unsigned int*)(0x42A6A2F8UL))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB11                   *((volatile unsigned int*)(0x42A6A2FCUL))
#define bM4_DMA2_LLP3_LLP0                              *((volatile unsigned int*)(0x42A6A308UL))
#define bM4_DMA2_LLP3_LLP1                              *((volatile unsigned int*)(0x42A6A30CUL))
#define bM4_DMA2_LLP3_LLP2                              *((volatile unsigned int*)(0x42A6A310UL))
#define bM4_DMA2_LLP3_LLP3                              *((volatile unsigned int*)(0x42A6A314UL))
#define bM4_DMA2_LLP3_LLP4                              *((volatile unsigned int*)(0x42A6A318UL))
#define bM4_DMA2_LLP3_LLP5                              *((volatile unsigned int*)(0x42A6A31CUL))
#define bM4_DMA2_LLP3_LLP6                              *((volatile unsigned int*)(0x42A6A320UL))
#define bM4_DMA2_LLP3_LLP7                              *((volatile unsigned int*)(0x42A6A324UL))
#define bM4_DMA2_LLP3_LLP8                              *((volatile unsigned int*)(0x42A6A328UL))
#define bM4_DMA2_LLP3_LLP9                              *((volatile unsigned int*)(0x42A6A32CUL))
#define bM4_DMA2_LLP3_LLP10                             *((volatile unsigned int*)(0x42A6A330UL))
#define bM4_DMA2_LLP3_LLP11                             *((volatile unsigned int*)(0x42A6A334UL))
#define bM4_DMA2_LLP3_LLP12                             *((volatile unsigned int*)(0x42A6A338UL))
#define bM4_DMA2_LLP3_LLP13                             *((volatile unsigned int*)(0x42A6A33CUL))
#define bM4_DMA2_LLP3_LLP14                             *((volatile unsigned int*)(0x42A6A340UL))
#define bM4_DMA2_LLP3_LLP15                             *((volatile unsigned int*)(0x42A6A344UL))
#define bM4_DMA2_LLP3_LLP16                             *((volatile unsigned int*)(0x42A6A348UL))
#define bM4_DMA2_LLP3_LLP17                             *((volatile unsigned int*)(0x42A6A34CUL))
#define bM4_DMA2_LLP3_LLP18                             *((volatile unsigned int*)(0x42A6A350UL))
#define bM4_DMA2_LLP3_LLP19                             *((volatile unsigned int*)(0x42A6A354UL))
#define bM4_DMA2_LLP3_LLP20                             *((volatile unsigned int*)(0x42A6A358UL))
#define bM4_DMA2_LLP3_LLP21                             *((volatile unsigned int*)(0x42A6A35CUL))
#define bM4_DMA2_LLP3_LLP22                             *((volatile unsigned int*)(0x42A6A360UL))
#define bM4_DMA2_LLP3_LLP23                             *((volatile unsigned int*)(0x42A6A364UL))
#define bM4_DMA2_LLP3_LLP24                             *((volatile unsigned int*)(0x42A6A368UL))
#define bM4_DMA2_LLP3_LLP25                             *((volatile unsigned int*)(0x42A6A36CUL))
#define bM4_DMA2_LLP3_LLP26                             *((volatile unsigned int*)(0x42A6A370UL))
#define bM4_DMA2_LLP3_LLP27                             *((volatile unsigned int*)(0x42A6A374UL))
#define bM4_DMA2_LLP3_LLP28                             *((volatile unsigned int*)(0x42A6A378UL))
#define bM4_DMA2_LLP3_LLP29                             *((volatile unsigned int*)(0x42A6A37CUL))
#define bM4_DMA2_CH3CTL_SINC0                           *((volatile unsigned int*)(0x42A6A380UL))
#define bM4_DMA2_CH3CTL_SINC1                           *((volatile unsigned int*)(0x42A6A384UL))
#define bM4_DMA2_CH3CTL_DINC0                           *((volatile unsigned int*)(0x42A6A388UL))
#define bM4_DMA2_CH3CTL_DINC1                           *((volatile unsigned int*)(0x42A6A38CUL))
#define bM4_DMA2_CH3CTL_SRTPEN                          *((volatile unsigned int*)(0x42A6A390UL))
#define bM4_DMA2_CH3CTL_DRPTEN                          *((volatile unsigned int*)(0x42A6A394UL))
#define bM4_DMA2_CH3CTL_SNSEQEN                         *((volatile unsigned int*)(0x42A6A398UL))
#define bM4_DMA2_CH3CTL_DNSEQEN                         *((volatile unsigned int*)(0x42A6A39CUL))
#define bM4_DMA2_CH3CTL_HSIZE0                          *((volatile unsigned int*)(0x42A6A3A0UL))
#define bM4_DMA2_CH3CTL_HSIZE1                          *((volatile unsigned int*)(0x42A6A3A4UL))
#define bM4_DMA2_CH3CTL_LLPEN                           *((volatile unsigned int*)(0x42A6A3A8UL))
#define bM4_DMA2_CH3CTL_LLPRUN                          *((volatile unsigned int*)(0x42A6A3ACUL))
#define bM4_DMA2_CH3CTL_IE                              *((volatile unsigned int*)(0x42A6A3B0UL))
#define bM4_DMA2_MONDTCTL3_BLKSIZE0                     *((volatile unsigned int*)(0x42A6A500UL))
#define bM4_DMA2_MONDTCTL3_BLKSIZE1                     *((volatile unsigned int*)(0x42A6A504UL))
#define bM4_DMA2_MONDTCTL3_BLKSIZE2                     *((volatile unsigned int*)(0x42A6A508UL))
#define bM4_DMA2_MONDTCTL3_BLKSIZE3                     *((volatile unsigned int*)(0x42A6A50CUL))
#define bM4_DMA2_MONDTCTL3_BLKSIZE4                     *((volatile unsigned int*)(0x42A6A510UL))
#define bM4_DMA2_MONDTCTL3_BLKSIZE5                     *((volatile unsigned int*)(0x42A6A514UL))
#define bM4_DMA2_MONDTCTL3_BLKSIZE6                     *((volatile unsigned int*)(0x42A6A518UL))
#define bM4_DMA2_MONDTCTL3_BLKSIZE7                     *((volatile unsigned int*)(0x42A6A51CUL))
#define bM4_DMA2_MONDTCTL3_BLKSIZE8                     *((volatile unsigned int*)(0x42A6A520UL))
#define bM4_DMA2_MONDTCTL3_BLKSIZE9                     *((volatile unsigned int*)(0x42A6A524UL))
#define bM4_DMA2_MONDTCTL3_CNT0                         *((volatile unsigned int*)(0x42A6A540UL))
#define bM4_DMA2_MONDTCTL3_CNT1                         *((volatile unsigned int*)(0x42A6A544UL))
#define bM4_DMA2_MONDTCTL3_CNT2                         *((volatile unsigned int*)(0x42A6A548UL))
#define bM4_DMA2_MONDTCTL3_CNT3                         *((volatile unsigned int*)(0x42A6A54CUL))
#define bM4_DMA2_MONDTCTL3_CNT4                         *((volatile unsigned int*)(0x42A6A550UL))
#define bM4_DMA2_MONDTCTL3_CNT5                         *((volatile unsigned int*)(0x42A6A554UL))
#define bM4_DMA2_MONDTCTL3_CNT6                         *((volatile unsigned int*)(0x42A6A558UL))
#define bM4_DMA2_MONDTCTL3_CNT7                         *((volatile unsigned int*)(0x42A6A55CUL))
#define bM4_DMA2_MONDTCTL3_CNT8                         *((volatile unsigned int*)(0x42A6A560UL))
#define bM4_DMA2_MONDTCTL3_CNT9                         *((volatile unsigned int*)(0x42A6A564UL))
#define bM4_DMA2_MONDTCTL3_CNT10                        *((volatile unsigned int*)(0x42A6A568UL))
#define bM4_DMA2_MONDTCTL3_CNT11                        *((volatile unsigned int*)(0x42A6A56CUL))
#define bM4_DMA2_MONDTCTL3_CNT12                        *((volatile unsigned int*)(0x42A6A570UL))
#define bM4_DMA2_MONDTCTL3_CNT13                        *((volatile unsigned int*)(0x42A6A574UL))
#define bM4_DMA2_MONDTCTL3_CNT14                        *((volatile unsigned int*)(0x42A6A578UL))
#define bM4_DMA2_MONDTCTL3_CNT15                        *((volatile unsigned int*)(0x42A6A57CUL))
#define bM4_DMA2_MONRPT3_SRPT0                          *((volatile unsigned int*)(0x42A6A580UL))
#define bM4_DMA2_MONRPT3_SRPT1                          *((volatile unsigned int*)(0x42A6A584UL))
#define bM4_DMA2_MONRPT3_SRPT2                          *((volatile unsigned int*)(0x42A6A588UL))
#define bM4_DMA2_MONRPT3_SRPT3                          *((volatile unsigned int*)(0x42A6A58CUL))
#define bM4_DMA2_MONRPT3_SRPT4                          *((volatile unsigned int*)(0x42A6A590UL))
#define bM4_DMA2_MONRPT3_SRPT5                          *((volatile unsigned int*)(0x42A6A594UL))
#define bM4_DMA2_MONRPT3_SRPT6                          *((volatile unsigned int*)(0x42A6A598UL))
#define bM4_DMA2_MONRPT3_SRPT7                          *((volatile unsigned int*)(0x42A6A59CUL))
#define bM4_DMA2_MONRPT3_SRPT8                          *((volatile unsigned int*)(0x42A6A5A0UL))
#define bM4_DMA2_MONRPT3_SRPT9                          *((volatile unsigned int*)(0x42A6A5A4UL))
#define bM4_DMA2_MONRPT3_DRPT0                          *((volatile unsigned int*)(0x42A6A5C0UL))
#define bM4_DMA2_MONRPT3_DRPT1                          *((volatile unsigned int*)(0x42A6A5C4UL))
#define bM4_DMA2_MONRPT3_DRPT2                          *((volatile unsigned int*)(0x42A6A5C8UL))
#define bM4_DMA2_MONRPT3_DRPT3                          *((volatile unsigned int*)(0x42A6A5CCUL))
#define bM4_DMA2_MONRPT3_DRPT4                          *((volatile unsigned int*)(0x42A6A5D0UL))
#define bM4_DMA2_MONRPT3_DRPT5                          *((volatile unsigned int*)(0x42A6A5D4UL))
#define bM4_DMA2_MONRPT3_DRPT6                          *((volatile unsigned int*)(0x42A6A5D8UL))
#define bM4_DMA2_MONRPT3_DRPT7                          *((volatile unsigned int*)(0x42A6A5DCUL))
#define bM4_DMA2_MONRPT3_DRPT8                          *((volatile unsigned int*)(0x42A6A5E0UL))
#define bM4_DMA2_MONRPT3_DRPT9                          *((volatile unsigned int*)(0x42A6A5E4UL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET0                  *((volatile unsigned int*)(0x42A6A600UL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET1                  *((volatile unsigned int*)(0x42A6A604UL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET2                  *((volatile unsigned int*)(0x42A6A608UL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET3                  *((volatile unsigned int*)(0x42A6A60CUL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET4                  *((volatile unsigned int*)(0x42A6A610UL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET5                  *((volatile unsigned int*)(0x42A6A614UL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET6                  *((volatile unsigned int*)(0x42A6A618UL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET7                  *((volatile unsigned int*)(0x42A6A61CUL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET8                  *((volatile unsigned int*)(0x42A6A620UL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET9                  *((volatile unsigned int*)(0x42A6A624UL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET10                 *((volatile unsigned int*)(0x42A6A628UL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET11                 *((volatile unsigned int*)(0x42A6A62CUL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET12                 *((volatile unsigned int*)(0x42A6A630UL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET13                 *((volatile unsigned int*)(0x42A6A634UL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET14                 *((volatile unsigned int*)(0x42A6A638UL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET15                 *((volatile unsigned int*)(0x42A6A63CUL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET16                 *((volatile unsigned int*)(0x42A6A640UL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET17                 *((volatile unsigned int*)(0x42A6A644UL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET18                 *((volatile unsigned int*)(0x42A6A648UL))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET19                 *((volatile unsigned int*)(0x42A6A64CUL))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT0                   *((volatile unsigned int*)(0x42A6A650UL))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT1                   *((volatile unsigned int*)(0x42A6A654UL))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT2                   *((volatile unsigned int*)(0x42A6A658UL))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT3                   *((volatile unsigned int*)(0x42A6A65CUL))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT4                   *((volatile unsigned int*)(0x42A6A660UL))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT5                   *((volatile unsigned int*)(0x42A6A664UL))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT6                   *((volatile unsigned int*)(0x42A6A668UL))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT7                   *((volatile unsigned int*)(0x42A6A66CUL))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT8                   *((volatile unsigned int*)(0x42A6A670UL))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT9                   *((volatile unsigned int*)(0x42A6A674UL))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT10                  *((volatile unsigned int*)(0x42A6A678UL))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT11                  *((volatile unsigned int*)(0x42A6A67CUL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET0                  *((volatile unsigned int*)(0x42A6A680UL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET1                  *((volatile unsigned int*)(0x42A6A684UL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET2                  *((volatile unsigned int*)(0x42A6A688UL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET3                  *((volatile unsigned int*)(0x42A6A68CUL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET4                  *((volatile unsigned int*)(0x42A6A690UL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET5                  *((volatile unsigned int*)(0x42A6A694UL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET6                  *((volatile unsigned int*)(0x42A6A698UL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET7                  *((volatile unsigned int*)(0x42A6A69CUL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET8                  *((volatile unsigned int*)(0x42A6A6A0UL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET9                  *((volatile unsigned int*)(0x42A6A6A4UL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET10                 *((volatile unsigned int*)(0x42A6A6A8UL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET11                 *((volatile unsigned int*)(0x42A6A6ACUL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET12                 *((volatile unsigned int*)(0x42A6A6B0UL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET13                 *((volatile unsigned int*)(0x42A6A6B4UL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET14                 *((volatile unsigned int*)(0x42A6A6B8UL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET15                 *((volatile unsigned int*)(0x42A6A6BCUL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET16                 *((volatile unsigned int*)(0x42A6A6C0UL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET17                 *((volatile unsigned int*)(0x42A6A6C4UL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET18                 *((volatile unsigned int*)(0x42A6A6C8UL))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET19                 *((volatile unsigned int*)(0x42A6A6CCUL))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT0                   *((volatile unsigned int*)(0x42A6A6D0UL))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT1                   *((volatile unsigned int*)(0x42A6A6D4UL))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT2                   *((volatile unsigned int*)(0x42A6A6D8UL))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT3                   *((volatile unsigned int*)(0x42A6A6DCUL))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT4                   *((volatile unsigned int*)(0x42A6A6E0UL))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT5                   *((volatile unsigned int*)(0x42A6A6E4UL))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT6                   *((volatile unsigned int*)(0x42A6A6E8UL))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT7                   *((volatile unsigned int*)(0x42A6A6ECUL))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT8                   *((volatile unsigned int*)(0x42A6A6F0UL))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT9                   *((volatile unsigned int*)(0x42A6A6F4UL))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT10                  *((volatile unsigned int*)(0x42A6A6F8UL))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT11                  *((volatile unsigned int*)(0x42A6A6FCUL))
#define bM4_EFM_FAPRT_FAPRT0                            *((volatile unsigned int*)(0x42208000UL))
#define bM4_EFM_FAPRT_FAPRT1                            *((volatile unsigned int*)(0x42208004UL))
#define bM4_EFM_FAPRT_FAPRT2                            *((volatile unsigned int*)(0x42208008UL))
#define bM4_EFM_FAPRT_FAPRT3                            *((volatile unsigned int*)(0x4220800CUL))
#define bM4_EFM_FAPRT_FAPRT4                            *((volatile unsigned int*)(0x42208010UL))
#define bM4_EFM_FAPRT_FAPRT5                            *((volatile unsigned int*)(0x42208014UL))
#define bM4_EFM_FAPRT_FAPRT6                            *((volatile unsigned int*)(0x42208018UL))
#define bM4_EFM_FAPRT_FAPRT7                            *((volatile unsigned int*)(0x4220801CUL))
#define bM4_EFM_FAPRT_FAPRT8                            *((volatile unsigned int*)(0x42208020UL))
#define bM4_EFM_FAPRT_FAPRT9                            *((volatile unsigned int*)(0x42208024UL))
#define bM4_EFM_FAPRT_FAPRT10                           *((volatile unsigned int*)(0x42208028UL))
#define bM4_EFM_FAPRT_FAPRT11                           *((volatile unsigned int*)(0x4220802CUL))
#define bM4_EFM_FAPRT_FAPRT12                           *((volatile unsigned int*)(0x42208030UL))
#define bM4_EFM_FAPRT_FAPRT13                           *((volatile unsigned int*)(0x42208034UL))
#define bM4_EFM_FAPRT_FAPRT14                           *((volatile unsigned int*)(0x42208038UL))
#define bM4_EFM_FAPRT_FAPRT15                           *((volatile unsigned int*)(0x4220803CUL))
#define bM4_EFM_FSTP_FSTP                               *((volatile unsigned int*)(0x42208080UL))
#define bM4_EFM_FRMC_SLPMD                              *((volatile unsigned int*)(0x42208100UL))
#define bM4_EFM_FRMC_FLWT0                              *((volatile unsigned int*)(0x42208110UL))
#define bM4_EFM_FRMC_FLWT1                              *((volatile unsigned int*)(0x42208114UL))
#define bM4_EFM_FRMC_FLWT2                              *((volatile unsigned int*)(0x42208118UL))
#define bM4_EFM_FRMC_FLWT3                              *((volatile unsigned int*)(0x4220811CUL))
#define bM4_EFM_FRMC_LVM                                *((volatile unsigned int*)(0x42208120UL))
#define bM4_EFM_FRMC_CACHE                              *((volatile unsigned int*)(0x42208140UL))
#define bM4_EFM_FRMC_CRST                               *((volatile unsigned int*)(0x42208160UL))
#define bM4_EFM_FWMC_PEMODE                             *((volatile unsigned int*)(0x42208180UL))
#define bM4_EFM_FWMC_PEMOD0                             *((volatile unsigned int*)(0x42208190UL))
#define bM4_EFM_FWMC_PEMOD1                             *((volatile unsigned int*)(0x42208194UL))
#define bM4_EFM_FWMC_PEMOD2                             *((volatile unsigned int*)(0x42208198UL))
#define bM4_EFM_FWMC_BUSHLDCTL                          *((volatile unsigned int*)(0x422081A0UL))
#define bM4_EFM_FSR_PEWERR                              *((volatile unsigned int*)(0x42208200UL))
#define bM4_EFM_FSR_PEPRTERR                            *((volatile unsigned int*)(0x42208204UL))
#define bM4_EFM_FSR_PGSZERR                             *((volatile unsigned int*)(0x42208208UL))
#define bM4_EFM_FSR_PGMISMTCH                           *((volatile unsigned int*)(0x4220820CUL))
#define bM4_EFM_FSR_OPTEND                              *((volatile unsigned int*)(0x42208210UL))
#define bM4_EFM_FSR_RDCOLERR                            *((volatile unsigned int*)(0x42208214UL))
#define bM4_EFM_FSR_RDY                                 *((volatile unsigned int*)(0x42208220UL))
#define bM4_EFM_FSCLR_PEWERRCLR                         *((volatile unsigned int*)(0x42208280UL))
#define bM4_EFM_FSCLR_PEPRTERRCLR                       *((volatile unsigned int*)(0x42208284UL))
#define bM4_EFM_FSCLR_PGSZERRCLR                        *((volatile unsigned int*)(0x42208288UL))
#define bM4_EFM_FSCLR_PGMISMTCHCLR                      *((volatile unsigned int*)(0x4220828CUL))
#define bM4_EFM_FSCLR_OPTENDCLR                         *((volatile unsigned int*)(0x42208290UL))
#define bM4_EFM_FSCLR_RDCOLERRCLR                       *((volatile unsigned int*)(0x42208294UL))
#define bM4_EFM_FITE_PEERRITE                           *((volatile unsigned int*)(0x42208300UL))
#define bM4_EFM_FITE_OPTENDITE                          *((volatile unsigned int*)(0x42208304UL))
#define bM4_EFM_FITE_RDCOLERRITE                        *((volatile unsigned int*)(0x42208308UL))
