CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_FCM_UVR_UVR5                                *((volatile unsigned int*)(0x42908094UL))
#define bM4_FCM_UVR_UVR6                                *((volatile unsigned int*)(0x42908098UL))
#define bM4_FCM_UVR_UVR7                                *((volatile unsigned int*)(0x4290809CUL))
#define bM4_FCM_UVR_UVR8                                *((volatile unsigned int*)(0x429080A0UL))
#define bM4_FCM_UVR_UVR9                                *((volatile unsigned int*)(0x429080A4UL))
#define bM4_FCM_UVR_UVR10                               *((volatile unsigned int*)(0x429080A8UL))
#define bM4_FCM_UVR_UVR11                               *((volatile unsigned int*)(0x429080ACUL))
#define bM4_FCM_UVR_UVR12                               *((volatile unsigned int*)(0x429080B0UL))
#define bM4_FCM_UVR_UVR13                               *((volatile unsigned int*)(0x429080B4UL))
#define bM4_FCM_UVR_UVR14                               *((volatile unsigned int*)(0x429080B8UL))
#define bM4_FCM_UVR_UVR15                               *((volatile unsigned int*)(0x429080BCUL))
#define bM4_FCM_CNTR_CNTR0                              *((volatile unsigned int*)(0x42908100UL))
#define bM4_FCM_CNTR_CNTR1                              *((volatile unsigned int*)(0x42908104UL))
#define bM4_FCM_CNTR_CNTR2                              *((volatile unsigned int*)(0x42908108UL))
#define bM4_FCM_CNTR_CNTR3                              *((volatile unsigned int*)(0x4290810CUL))
#define bM4_FCM_CNTR_CNTR4                              *((volatile unsigned int*)(0x42908110UL))
#define bM4_FCM_CNTR_CNTR5                              *((volatile unsigned int*)(0x42908114UL))
#define bM4_FCM_CNTR_CNTR6                              *((volatile unsigned int*)(0x42908118UL))
#define bM4_FCM_CNTR_CNTR7                              *((volatile unsigned int*)(0x4290811CUL))
#define bM4_FCM_CNTR_CNTR8                              *((volatile unsigned int*)(0x42908120UL))
#define bM4_FCM_CNTR_CNTR9                              *((volatile unsigned int*)(0x42908124UL))
#define bM4_FCM_CNTR_CNTR10                             *((volatile unsigned int*)(0x42908128UL))
#define bM4_FCM_CNTR_CNTR11                             *((volatile unsigned int*)(0x4290812CUL))
#define bM4_FCM_CNTR_CNTR12                             *((volatile unsigned int*)(0x42908130UL))
#define bM4_FCM_CNTR_CNTR13                             *((volatile unsigned int*)(0x42908134UL))
#define bM4_FCM_CNTR_CNTR14                             *((volatile unsigned int*)(0x42908138UL))
#define bM4_FCM_CNTR_CNTR15                             *((volatile unsigned int*)(0x4290813CUL))
#define bM4_FCM_STR_START                               *((volatile unsigned int*)(0x42908180UL))
#define bM4_FCM_MCCR_MDIVS0                             *((volatile unsigned int*)(0x42908200UL))
#define bM4_FCM_MCCR_MDIVS1                             *((volatile unsigned int*)(0x42908204UL))
#define bM4_FCM_MCCR_MCKS0                              *((volatile unsigned int*)(0x42908210UL))
#define bM4_FCM_MCCR_MCKS1                              *((volatile unsigned int*)(0x42908214UL))
#define bM4_FCM_MCCR_MCKS2                              *((volatile unsigned int*)(0x42908218UL))
#define bM4_FCM_MCCR_MCKS3                              *((volatile unsigned int*)(0x4290821CUL))
#define bM4_FCM_RCCR_RDIVS0                             *((volatile unsigned int*)(0x42908280UL))
#define bM4_FCM_RCCR_RDIVS1                             *((volatile unsigned int*)(0x42908284UL))
#define bM4_FCM_RCCR_RCKS0                              *((volatile unsigned int*)(0x4290828CUL))
#define bM4_FCM_RCCR_RCKS1                              *((volatile unsigned int*)(0x42908290UL))
#define bM4_FCM_RCCR_RCKS2                              *((volatile unsigned int*)(0x42908294UL))
#define bM4_FCM_RCCR_RCKS3                              *((volatile unsigned int*)(0x42908298UL))
#define bM4_FCM_RCCR_INEXS                              *((volatile unsigned int*)(0x4290829CUL))
#define bM4_FCM_RCCR_DNFS0                              *((volatile unsigned int*)(0x429082A0UL))
#define bM4_FCM_RCCR_DNFS1                              *((volatile unsigned int*)(0x429082A4UL))
#define bM4_FCM_RCCR_EDGES0                             *((volatile unsigned int*)(0x429082B0UL))
#define bM4_FCM_RCCR_EDGES1                             *((volatile unsigned int*)(0x429082B4UL))
#define bM4_FCM_RCCR_EXREFE                             *((volatile unsigned int*)(0x429082BCUL))
#define bM4_FCM_RIER_ERRIE                              *((volatile unsigned int*)(0x42908300UL))
#define bM4_FCM_RIER_MENDIE                             *((volatile unsigned int*)(0x42908304UL))
#define bM4_FCM_RIER_OVFIE                              *((volatile unsigned int*)(0x42908308UL))
#define bM4_FCM_RIER_ERRINTRS                           *((volatile unsigned int*)(0x42908310UL))
#define bM4_FCM_RIER_ERRE                               *((volatile unsigned int*)(0x4290831CUL))
#define bM4_FCM_SR_ERRF                                 *((volatile unsigned int*)(0x42908380UL))
#define bM4_FCM_SR_MENDF                                *((volatile unsigned int*)(0x42908384UL))
#define bM4_FCM_SR_OVF                                  *((volatile unsigned int*)(0x42908388UL))
#define bM4_FCM_CLR_ERRFCLR                             *((volatile unsigned int*)(0x42908400UL))
#define bM4_FCM_CLR_MENDFCLR                            *((volatile unsigned int*)(0x42908404UL))
#define bM4_FCM_CLR_OVFCLR                              *((volatile unsigned int*)(0x42908408UL))
#define bM4_HASH_CR_START                               *((volatile unsigned int*)(0x42108000UL))
#define bM4_HASH_CR_FST_GRP                             *((volatile unsigned int*)(0x42108004UL))
#define bM4_I2C1_CR1_PE                                 *((volatile unsigned int*)(0x429C0000UL))
#define bM4_I2C1_CR1_SMBUS                              *((volatile unsigned int*)(0x429C0004UL))
#define bM4_I2C1_CR1_SMBALRTEN                          *((volatile unsigned int*)(0x429C0008UL))
#define bM4_I2C1_CR1_SMBDEFAULTEN                       *((volatile unsigned int*)(0x429C000CUL))
#define bM4_I2C1_CR1_SMBHOSTEN                          *((volatile unsigned int*)(0x429C0010UL))
#define bM4_I2C1_CR1_ENGC                               *((volatile unsigned int*)(0x429C0018UL))
#define bM4_I2C1_CR1_RESTART                            *((volatile unsigned int*)(0x429C001CUL))
#define bM4_I2C1_CR1_START                              *((volatile unsigned int*)(0x429C0020UL))
#define bM4_I2C1_CR1_STOP                               *((volatile unsigned int*)(0x429C0024UL))
#define bM4_I2C1_CR1_ACK                                *((volatile unsigned int*)(0x429C0028UL))
#define bM4_I2C1_CR1_SWRST                              *((volatile unsigned int*)(0x429C003CUL))
#define bM4_I2C1_CR2_STARTIE                            *((volatile unsigned int*)(0x429C0080UL))
#define bM4_I2C1_CR2_SLADDR0IE                          *((volatile unsigned int*)(0x429C0084UL))
#define bM4_I2C1_CR2_SLADDR1IE                          *((volatile unsigned int*)(0x429C0088UL))
#define bM4_I2C1_CR2_TENDIE                             *((volatile unsigned int*)(0x429C008CUL))
#define bM4_I2C1_CR2_STOPIE                             *((volatile unsigned int*)(0x429C0090UL))
#define bM4_I2C1_CR2_RFULLIE                            *((volatile unsigned int*)(0x429C0098UL))
#define bM4_I2C1_CR2_TEMPTYIE                           *((volatile unsigned int*)(0x429C009CUL))
#define bM4_I2C1_CR2_ARLOIE                             *((volatile unsigned int*)(0x429C00A4UL))
#define bM4_I2C1_CR2_NACKIE                             *((volatile unsigned int*)(0x429C00B0UL))
#define bM4_I2C1_CR2_TMOUTIE                            *((volatile unsigned int*)(0x429C00B8UL))
#define bM4_I2C1_CR2_GENCALLIE                          *((volatile unsigned int*)(0x429C00D0UL))
#define bM4_I2C1_CR2_SMBDEFAULTIE                       *((volatile unsigned int*)(0x429C00D4UL))
#define bM4_I2C1_CR2_SMHOSTIE                           *((volatile unsigned int*)(0x429C00D8UL))
#define bM4_I2C1_CR2_SMBALRTIE                          *((volatile unsigned int*)(0x429C00DCUL))
#define bM4_I2C1_CR3_TMOUTEN                            *((volatile unsigned int*)(0x429C0100UL))
#define bM4_I2C1_CR3_LTMOUT                             *((volatile unsigned int*)(0x429C0104UL))
#define bM4_I2C1_CR3_HTMOUT                             *((volatile unsigned int*)(0x429C0108UL))
#define bM4_I2C1_CR3_FACKEN                             *((volatile unsigned int*)(0x429C011CUL))
#define bM4_I2C1_SLR0_SLADDR00                          *((volatile unsigned int*)(0x429C0200UL))
#define bM4_I2C1_SLR0_SLADDR01                          *((volatile unsigned int*)(0x429C0204UL))
#define bM4_I2C1_SLR0_SLADDR02                          *((volatile unsigned int*)(0x429C0208UL))
#define bM4_I2C1_SLR0_SLADDR03                          *((volatile unsigned int*)(0x429C020CUL))
#define bM4_I2C1_SLR0_SLADDR04                          *((volatile unsigned int*)(0x429C0210UL))
#define bM4_I2C1_SLR0_SLADDR05                          *((volatile unsigned int*)(0x429C0214UL))
#define bM4_I2C1_SLR0_SLADDR06                          *((volatile unsigned int*)(0x429C0218UL))
#define bM4_I2C1_SLR0_SLADDR07                          *((volatile unsigned int*)(0x429C021CUL))
#define bM4_I2C1_SLR0_SLADDR08                          *((volatile unsigned int*)(0x429C0220UL))
#define bM4_I2C1_SLR0_SLADDR09                          *((volatile unsigned int*)(0x429C0224UL))
#define bM4_I2C1_SLR0_SLADDR0EN                         *((volatile unsigned int*)(0x429C0230UL))
#define bM4_I2C1_SLR0_ADDRMOD0                          *((volatile unsigned int*)(0x429C023CUL))
#define bM4_I2C1_SLR1_SLADDR10                          *((volatile unsigned int*)(0x429C0280UL))
#define bM4_I2C1_SLR1_SLADDR11                          *((volatile unsigned int*)(0x429C0284UL))
#define bM4_I2C1_SLR1_SLADDR12                          *((volatile unsigned int*)(0x429C0288UL))
#define bM4_I2C1_SLR1_SLADDR13                          *((volatile unsigned int*)(0x429C028CUL))
#define bM4_I2C1_SLR1_SLADDR14                          *((volatile unsigned int*)(0x429C0290UL))
#define bM4_I2C1_SLR1_SLADDR15                          *((volatile unsigned int*)(0x429C0294UL))
#define bM4_I2C1_SLR1_SLADDR16                          *((volatile unsigned int*)(0x429C0298UL))
#define bM4_I2C1_SLR1_SLADDR17                          *((volatile unsigned int*)(0x429C029CUL))
#define bM4_I2C1_SLR1_SLADDR18                          *((volatile unsigned int*)(0x429C02A0UL))
#define bM4_I2C1_SLR1_SLADDR19                          *((volatile unsigned int*)(0x429C02A4UL))
#define bM4_I2C1_SLR1_SLADDR1EN                         *((volatile unsigned int*)(0x429C02B0UL))
#define bM4_I2C1_SLR1_ADDRMOD1                          *((volatile unsigned int*)(0x429C02BCUL))
#define bM4_I2C1_SLTR_TOUTLOW0                          *((volatile unsigned int*)(0x429C0300UL))
#define bM4_I2C1_SLTR_TOUTLOW1                          *((volatile unsigned int*)(0x429C0304UL))
#define bM4_I2C1_SLTR_TOUTLOW2                          *((volatile unsigned int*)(0x429C0308UL))
#define bM4_I2C1_SLTR_TOUTLOW3                          *((volatile unsigned int*)(0x429C030CUL))
#define bM4_I2C1_SLTR_TOUTLOW4                          *((volatile unsigned int*)(0x429C0310UL))
#define bM4_I2C1_SLTR_TOUTLOW5                          *((volatile unsigned int*)(0x429C0314UL))
#define bM4_I2C1_SLTR_TOUTLOW6                          *((volatile unsigned int*)(0x429C0318UL))
#define bM4_I2C1_SLTR_TOUTLOW7                          *((volatile unsigned int*)(0x429C031CUL))
#define bM4_I2C1_SLTR_TOUTLOW8                          *((volatile unsigned int*)(0x429C0320UL))
#define bM4_I2C1_SLTR_TOUTLOW9                          *((volatile unsigned int*)(0x429C0324UL))
#define bM4_I2C1_SLTR_TOUTLOW10                         *((volatile unsigned int*)(0x429C0328UL))
#define bM4_I2C1_SLTR_TOUTLOW11                         *((volatile unsigned int*)(0x429C032CUL))
#define bM4_I2C1_SLTR_TOUTLOW12                         *((volatile unsigned int*)(0x429C0330UL))
#define bM4_I2C1_SLTR_TOUTLOW13                         *((volatile unsigned int*)(0x429C0334UL))
#define bM4_I2C1_SLTR_TOUTLOW14                         *((volatile unsigned int*)(0x429C0338UL))
#define bM4_I2C1_SLTR_TOUTLOW15                         *((volatile unsigned int*)(0x429C033CUL))
#define bM4_I2C1_SLTR_TOUTHIGH0                         *((volatile unsigned int*)(0x429C0340UL))
#define bM4_I2C1_SLTR_TOUTHIGH1                         *((volatile unsigned int*)(0x429C0344UL))
#define bM4_I2C1_SLTR_TOUTHIGH2                         *((volatile unsigned int*)(0x429C0348UL))
#define bM4_I2C1_SLTR_TOUTHIGH3                         *((volatile unsigned int*)(0x429C034CUL))
#define bM4_I2C1_SLTR_TOUTHIGH4                         *((volatile unsigned int*)(0x429C0350UL))
#define bM4_I2C1_SLTR_TOUTHIGH5                         *((volatile unsigned int*)(0x429C0354UL))
#define bM4_I2C1_SLTR_TOUTHIGH6                         *((volatile unsigned int*)(0x429C0358UL))
#define bM4_I2C1_SLTR_TOUTHIGH7                         *((volatile unsigned int*)(0x429C035CUL))
#define bM4_I2C1_SLTR_TOUTHIGH8                         *((volatile unsigned int*)(0x429C0360UL))
#define bM4_I2C1_SLTR_TOUTHIGH9                         *((volatile unsigned int*)(0x429C0364UL))
#define bM4_I2C1_SLTR_TOUTHIGH10                        *((volatile unsigned int*)(0x429C0368UL))
#define bM4_I2C1_SLTR_TOUTHIGH11                        *((volatile unsigned int*)(0x429C036CUL))
#define bM4_I2C1_SLTR_TOUTHIGH12                        *((volatile unsigned int*)(0x429C0370UL))
#define bM4_I2C1_SLTR_TOUTHIGH13                        *((volatile unsigned int*)(0x429C0374UL))
#define bM4_I2C1_SLTR_TOUTHIGH14                        *((volatile unsigned int*)(0x429C0378UL))
#define bM4_I2C1_SLTR_TOUTHIGH15                        *((volatile unsigned int*)(0x429C037CUL))
#define bM4_I2C1_SR_STARTF                              *((volatile unsigned int*)(0x429C0380UL))
#define bM4_I2C1_SR_SLADDR0F                            *((volatile unsigned int*)(0x429C0384UL))
#define bM4_I2C1_SR_SLADDR1F                            *((volatile unsigned int*)(0x429C0388UL))
#define bM4_I2C1_SR_TENDF                               *((volatile unsigned int*)(0x429C038CUL))
#define bM4_I2C1_SR_STOPF                               *((volatile unsigned int*)(0x429C0390UL))
#define bM4_I2C1_SR_RFULLF                              *((volatile unsigned int*)(0x429C0398UL))
#define bM4_I2C1_SR_TEMPTYF                             *((volatile unsigned int*)(0x429C039CUL))
#define bM4_I2C1_SR_ARLOF                               *((volatile unsigned int*)(0x429C03A4UL))
#define bM4_I2C1_SR_ACKRF                               *((volatile unsigned int*)(0x429C03A8UL))
#define bM4_I2C1_SR_NACKF                               *((volatile unsigned int*)(0x429C03B0UL))
#define bM4_I2C1_SR_TMOUTF                              *((volatile unsigned int*)(0x429C03B8UL))
#define bM4_I2C1_SR_MSL                                 *((volatile unsigned int*)(0x429C03C0UL))
#define bM4_I2C1_SR_BUSY                                *((volatile unsigned int*)(0x429C03C4UL))
#define bM4_I2C1_SR_TRA                                 *((volatile unsigned int*)(0x429C03C8UL))
#define bM4_I2C1_SR_GENCALLF                            *((volatile unsigned int*)(0x429C03D0UL))
#define bM4_I2C1_SR_SMBDEFAULTF                         *((volatile unsigned int*)(0x429C03D4UL))
#define bM4_I2C1_SR_SMBHOSTF                            *((volatile unsigned int*)(0x429C03D8UL))
#define bM4_I2C1_SR_SMBALRTF                            *((volatile unsigned int*)(0x429C03DCUL))
#define bM4_I2C1_CLR_STARTFCLR                          *((volatile unsigned int*)(0x429C0400UL))
#define bM4_I2C1_CLR_SLADDR0FCLR                        *((volatile unsigned int*)(0x429C0404UL))
#define bM4_I2C1_CLR_SLADDR1FCLR                        *((volatile unsigned int*)(0x429C0408UL))
#define bM4_I2C1_CLR_TENDFCLR                           *((volatile unsigned int*)(0x429C040CUL))
#define bM4_I2C1_CLR_STOPFCLR                           *((volatile unsigned int*)(0x429C0410UL))
#define bM4_I2C1_CLR_RFULLFCLR                          *((volatile unsigned int*)(0x429C0418UL))
#define bM4_I2C1_CLR_TEMPTYFCLR                         *((volatile unsigned int*)(0x429C041CUL))
#define bM4_I2C1_CLR_ARLOFCLR                           *((volatile unsigned int*)(0x429C0424UL))
#define bM4_I2C1_CLR_NACKFCLR                           *((volatile unsigned int*)(0x429C0430UL))
#define bM4_I2C1_CLR_TMOUTFCLR                          *((volatile unsigned int*)(0x429C0438UL))
#define bM4_I2C1_CLR_GENCALLFCLR                        *((volatile unsigned int*)(0x429C0450UL))
#define bM4_I2C1_CLR_SMBDEFAULTFCLR                     *((volatile unsigned int*)(0x429C0454UL))
#define bM4_I2C1_CLR_SMBHOSTFCLR                        *((volatile unsigned int*)(0x429C0458UL))
#define bM4_I2C1_CLR_SMBALRTFCLR                        *((volatile unsigned int*)(0x429C045CUL))
#define bM4_I2C1_DTR_DT0                                *((volatile unsigned int*)(0x429C0480UL))
#define bM4_I2C1_DTR_DT1                                *((volatile unsigned int*)(0x429C0484UL))
#define bM4_I2C1_DTR_DT2                                *((volatile unsigned int*)(0x429C0488UL))
#define bM4_I2C1_DTR_DT3                                *((volatile unsigned int*)(0x429C048CUL))
#define bM4_I2C1_DTR_DT4                                *((volatile unsigned int*)(0x429C0490UL))
#define bM4_I2C1_DTR_DT5                                *((volatile unsigned int*)(0x429C0494UL))
#define bM4_I2C1_DTR_DT6                                *((volatile unsigned int*)(0x429C0498UL))
#define bM4_I2C1_DTR_DT7                                *((volatile unsigned int*)(0x429C049CUL))
#define bM4_I2C1_DRR_DR0                                *((volatile unsigned int*)(0x429C0500UL))
#define bM4_I2C1_DRR_DR1                                *((volatile unsigned int*)(0x429C0504UL))
#define bM4_I2C1_DRR_DR2                                *((volatile unsigned int*)(0x429C0508UL))
#define bM4_I2C1_DRR_DR3                                *((volatile unsigned int*)(0x429C050CUL))
#define bM4_I2C1_DRR_DR4                                *((volatile unsigned int*)(0x429C0510UL))
#define bM4_I2C1_DRR_DR5                                *((volatile unsigned int*)(0x429C0514UL))
#define bM4_I2C1_DRR_DR6                                *((volatile unsigned int*)(0x429C0518UL))
#define bM4_I2C1_DRR_DR7                                *((volatile unsigned int*)(0x429C051CUL))
#define bM4_I2C1_CCR_SLOWW0                             *((volatile unsigned int*)(0x429C0580UL))
#define bM4_I2C1_CCR_SLOWW1                             *((volatile unsigned int*)(0x429C0584UL))
#define bM4_I2C1_CCR_SLOWW2                             *((volatile unsigned int*)(0x429C0588UL))
#define bM4_I2C1_CCR_SLOWW3                             *((volatile unsigned int*)(0x429C058CUL))
#define bM4_I2C1_CCR_SLOWW4                             *((volatile unsigned int*)(0x429C0590UL))
#define bM4_I2C1_CCR_SHIGHW0                            *((volatile unsigned int*)(0x429C05A0UL))
#define bM4_I2C1_CCR_SHIGHW1                            *((volatile unsigned int*)(0x429C05A4UL))
#define bM4_I2C1_CCR_SHIGHW2                            *((volatile unsigned int*)(0x429C05A8UL))
#define bM4_I2C1_CCR_SHIGHW3                            *((volatile unsigned int*)(0x429C05ACUL))
#define bM4_I2C1_CCR_SHIGHW4                            *((volatile unsigned int*)(0x429C05B0UL))
#define bM4_I2C1_CCR_FREQ0                              *((volatile unsigned int*)(0x429C05C0UL))
#define bM4_I2C1_CCR_FREQ1                              *((volatile unsigned int*)(0x429C05C4UL))
#define bM4_I2C1_CCR_FREQ2                              *((volatile unsigned int*)(0x429C05C8UL))
#define bM4_I2C1_FLTR_DNF0                              *((volatile unsigned int*)(0x429C0600UL))
#define bM4_I2C1_FLTR_DNF1                              *((volatile unsigned int*)(0x429C0604UL))
#define bM4_I2C1_FLTR_DNFEN                             *((volatile unsigned int*)(0x429C0610UL))
#define bM4_I2C1_FLTR_ANFEN                             *((volatile unsigned int*)(0x429C0614UL))
#define bM4_I2C2_CR1_PE                                 *((volatile unsigned int*)(0x429C8000UL))
#define bM4_I2C2_CR1_SMBUS                              *((volatile unsigned int*)(0x429C8004UL))
#define bM4_I2C2_CR1_SMBALRTEN                          *((volatile unsigned int*)(0x429C8008UL))
#define bM4_I2C2_CR1_SMBDEFAULTEN                       *((volatile unsigned int*)(0x429C800CUL))
#define bM4_I2C2_CR1_SMBHOSTEN                          *((volatile unsigned int*)(0x429C8010UL))
#define bM4_I2C2_CR1_ENGC                               *((volatile unsigned int*)(0x429C8018UL))
#define bM4_I2C2_CR1_RESTART                            *((volatile unsigned int*)(0x429C801CUL))
#define bM4_I2C2_CR1_START                              *((volatile unsigned int*)(0x429C8020UL))
#define bM4_I2C2_CR1_STOP                               *((volatile unsigned int*)(0x429C8024UL))
#define bM4_I2C2_CR1_ACK                                *((volatile unsigned int*)(0x429C8028UL))
#define bM4_I2C2_CR1_SWRST                              *((volatile unsigned int*)(0x429C803CUL))
#define bM4_I2C2_CR2_STARTIE                            *((volatile unsigned int*)(0x429C8080UL))
#define bM4_I2C2_CR2_SLADDR0IE                          *((volatile unsigned int*)(0x429C8084UL))
#define bM4_I2C2_CR2_SLADDR1IE                          *((volatile unsigned int*)(0x429C8088UL))
#define bM4_I2C2_CR2_TENDIE                             *((volatile unsigned int*)(0x429C808CUL))
#define bM4_I2C2_CR2_STOPIE                             *((volatile unsigned int*)(0x429C8090UL))
#define bM4_I2C2_CR2_RFULLIE                            *((volatile unsigned int*)(0x429C8098UL))
#define bM4_I2C2_CR2_TEMPTYIE                           *((volatile unsigned int*)(0x429C809CUL))
#define bM4_I2C2_CR2_ARLOIE                             *((volatile unsigned int*)(0x429C80A4UL))
#define bM4_I2C2_CR2_NACKIE                             *((volatile unsigned int*)(0x429C80B0UL))
#define bM4_I2C2_CR2_TMOUTIE                            *((volatile unsigned int*)(0x429C80B8UL))
#define bM4_I2C2_CR2_GENCALLIE                          *((volatile unsigned int*)(0x429C80D0UL))
#define bM4_I2C2_CR2_SMBDEFAULTIE                       *((volatile unsigned int*)(0x429C80D4UL))
#define bM4_I2C2_CR2_SMHOSTIE                           *((volatile unsigned int*)(0x429C80D8UL))
#define bM4_I2C2_CR2_SMBALRTIE                          *((volatile unsigned int*)(0x429C80DCUL))
#define bM4_I2C2_CR3_TMOUTEN                            *((volatile unsigned int*)(0x429C8100UL))
#define bM4_I2C2_CR3_LTMOUT                             *((volatile unsigned int*)(0x429C8104UL))
#define bM4_I2C2_CR3_HTMOUT                             *((volatile unsigned int*)(0x429C8108UL))
#define bM4_I2C2_CR3_FACKEN                             *((volatile unsigned int*)(0x429C811CUL))
#define bM4_I2C2_SLR0_SLADDR00                          *((volatile unsigned int*)(0x429C8200UL))
#define bM4_I2C2_SLR0_SLADDR01                          *((volatile unsigned int*)(0x429C8204UL))
#define bM4_I2C2_SLR0_SLADDR02                          *((volatile unsigned int*)(0x429C8208UL))
#define bM4_I2C2_SLR0_SLADDR03                          *((volatile unsigned int*)(0x429C820CUL))
#define bM4_I2C2_SLR0_SLADDR04                          *((volatile unsigned int*)(0x429C8210UL))
#define bM4_I2C2_SLR0_SLADDR05                          *((volatile unsigned int*)(0x429C8214UL))
