CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_I2C2_SLR0_SLADDR06                          *((volatile unsigned int*)(0x429C8218UL))
#define bM4_I2C2_SLR0_SLADDR07                          *((volatile unsigned int*)(0x429C821CUL))
#define bM4_I2C2_SLR0_SLADDR08                          *((volatile unsigned int*)(0x429C8220UL))
#define bM4_I2C2_SLR0_SLADDR09                          *((volatile unsigned int*)(0x429C8224UL))
#define bM4_I2C2_SLR0_SLADDR0EN                         *((volatile unsigned int*)(0x429C8230UL))
#define bM4_I2C2_SLR0_ADDRMOD0                          *((volatile unsigned int*)(0x429C823CUL))
#define bM4_I2C2_SLR1_SLADDR10                          *((volatile unsigned int*)(0x429C8280UL))
#define bM4_I2C2_SLR1_SLADDR11                          *((volatile unsigned int*)(0x429C8284UL))
#define bM4_I2C2_SLR1_SLADDR12                          *((volatile unsigned int*)(0x429C8288UL))
#define bM4_I2C2_SLR1_SLADDR13                          *((volatile unsigned int*)(0x429C828CUL))
#define bM4_I2C2_SLR1_SLADDR14                          *((volatile unsigned int*)(0x429C8290UL))
#define bM4_I2C2_SLR1_SLADDR15                          *((volatile unsigned int*)(0x429C8294UL))
#define bM4_I2C2_SLR1_SLADDR16                          *((volatile unsigned int*)(0x429C8298UL))
#define bM4_I2C2_SLR1_SLADDR17                          *((volatile unsigned int*)(0x429C829CUL))
#define bM4_I2C2_SLR1_SLADDR18                          *((volatile unsigned int*)(0x429C82A0UL))
#define bM4_I2C2_SLR1_SLADDR19                          *((volatile unsigned int*)(0x429C82A4UL))
#define bM4_I2C2_SLR1_SLADDR1EN                         *((volatile unsigned int*)(0x429C82B0UL))
#define bM4_I2C2_SLR1_ADDRMOD1                          *((volatile unsigned int*)(0x429C82BCUL))
#define bM4_I2C2_SLTR_TOUTLOW0                          *((volatile unsigned int*)(0x429C8300UL))
#define bM4_I2C2_SLTR_TOUTLOW1                          *((volatile unsigned int*)(0x429C8304UL))
#define bM4_I2C2_SLTR_TOUTLOW2                          *((volatile unsigned int*)(0x429C8308UL))
#define bM4_I2C2_SLTR_TOUTLOW3                          *((volatile unsigned int*)(0x429C830CUL))
#define bM4_I2C2_SLTR_TOUTLOW4                          *((volatile unsigned int*)(0x429C8310UL))
#define bM4_I2C2_SLTR_TOUTLOW5                          *((volatile unsigned int*)(0x429C8314UL))
#define bM4_I2C2_SLTR_TOUTLOW6                          *((volatile unsigned int*)(0x429C8318UL))
#define bM4_I2C2_SLTR_TOUTLOW7                          *((volatile unsigned int*)(0x429C831CUL))
#define bM4_I2C2_SLTR_TOUTLOW8                          *((volatile unsigned int*)(0x429C8320UL))
#define bM4_I2C2_SLTR_TOUTLOW9                          *((volatile unsigned int*)(0x429C8324UL))
#define bM4_I2C2_SLTR_TOUTLOW10                         *((volatile unsigned int*)(0x429C8328UL))
#define bM4_I2C2_SLTR_TOUTLOW11                         *((volatile unsigned int*)(0x429C832CUL))
#define bM4_I2C2_SLTR_TOUTLOW12                         *((volatile unsigned int*)(0x429C8330UL))
#define bM4_I2C2_SLTR_TOUTLOW13                         *((volatile unsigned int*)(0x429C8334UL))
#define bM4_I2C2_SLTR_TOUTLOW14                         *((volatile unsigned int*)(0x429C8338UL))
#define bM4_I2C2_SLTR_TOUTLOW15                         *((volatile unsigned int*)(0x429C833CUL))
#define bM4_I2C2_SLTR_TOUTHIGH0                         *((volatile unsigned int*)(0x429C8340UL))
#define bM4_I2C2_SLTR_TOUTHIGH1                         *((volatile unsigned int*)(0x429C8344UL))
#define bM4_I2C2_SLTR_TOUTHIGH2                         *((volatile unsigned int*)(0x429C8348UL))
#define bM4_I2C2_SLTR_TOUTHIGH3                         *((volatile unsigned int*)(0x429C834CUL))
#define bM4_I2C2_SLTR_TOUTHIGH4                         *((volatile unsigned int*)(0x429C8350UL))
#define bM4_I2C2_SLTR_TOUTHIGH5                         *((volatile unsigned int*)(0x429C8354UL))
#define bM4_I2C2_SLTR_TOUTHIGH6                         *((volatile unsigned int*)(0x429C8358UL))
#define bM4_I2C2_SLTR_TOUTHIGH7                         *((volatile unsigned int*)(0x429C835CUL))
#define bM4_I2C2_SLTR_TOUTHIGH8                         *((volatile unsigned int*)(0x429C8360UL))
#define bM4_I2C2_SLTR_TOUTHIGH9                         *((volatile unsigned int*)(0x429C8364UL))
#define bM4_I2C2_SLTR_TOUTHIGH10                        *((volatile unsigned int*)(0x429C8368UL))
#define bM4_I2C2_SLTR_TOUTHIGH11                        *((volatile unsigned int*)(0x429C836CUL))
#define bM4_I2C2_SLTR_TOUTHIGH12                        *((volatile unsigned int*)(0x429C8370UL))
#define bM4_I2C2_SLTR_TOUTHIGH13                        *((volatile unsigned int*)(0x429C8374UL))
#define bM4_I2C2_SLTR_TOUTHIGH14                        *((volatile unsigned int*)(0x429C8378UL))
#define bM4_I2C2_SLTR_TOUTHIGH15                        *((volatile unsigned int*)(0x429C837CUL))
#define bM4_I2C2_SR_STARTF                              *((volatile unsigned int*)(0x429C8380UL))
#define bM4_I2C2_SR_SLADDR0F                            *((volatile unsigned int*)(0x429C8384UL))
#define bM4_I2C2_SR_SLADDR1F                            *((volatile unsigned int*)(0x429C8388UL))
#define bM4_I2C2_SR_TENDF                               *((volatile unsigned int*)(0x429C838CUL))
#define bM4_I2C2_SR_STOPF                               *((volatile unsigned int*)(0x429C8390UL))
#define bM4_I2C2_SR_RFULLF                              *((volatile unsigned int*)(0x429C8398UL))
#define bM4_I2C2_SR_TEMPTYF                             *((volatile unsigned int*)(0x429C839CUL))
#define bM4_I2C2_SR_ARLOF                               *((volatile unsigned int*)(0x429C83A4UL))
#define bM4_I2C2_SR_ACKRF                               *((volatile unsigned int*)(0x429C83A8UL))
#define bM4_I2C2_SR_NACKF                               *((volatile unsigned int*)(0x429C83B0UL))
#define bM4_I2C2_SR_TMOUTF                              *((volatile unsigned int*)(0x429C83B8UL))
#define bM4_I2C2_SR_MSL                                 *((volatile unsigned int*)(0x429C83C0UL))
#define bM4_I2C2_SR_BUSY                                *((volatile unsigned int*)(0x429C83C4UL))
#define bM4_I2C2_SR_TRA                                 *((volatile unsigned int*)(0x429C83C8UL))
#define bM4_I2C2_SR_GENCALLF                            *((volatile unsigned int*)(0x429C83D0UL))
#define bM4_I2C2_SR_SMBDEFAULTF                         *((volatile unsigned int*)(0x429C83D4UL))
#define bM4_I2C2_SR_SMBHOSTF                            *((volatile unsigned int*)(0x429C83D8UL))
#define bM4_I2C2_SR_SMBALRTF                            *((volatile unsigned int*)(0x429C83DCUL))
#define bM4_I2C2_CLR_STARTFCLR                          *((volatile unsigned int*)(0x429C8400UL))
#define bM4_I2C2_CLR_SLADDR0FCLR                        *((volatile unsigned int*)(0x429C8404UL))
#define bM4_I2C2_CLR_SLADDR1FCLR                        *((volatile unsigned int*)(0x429C8408UL))
#define bM4_I2C2_CLR_TENDFCLR                           *((volatile unsigned int*)(0x429C840CUL))
#define bM4_I2C2_CLR_STOPFCLR                           *((volatile unsigned int*)(0x429C8410UL))
#define bM4_I2C2_CLR_RFULLFCLR                          *((volatile unsigned int*)(0x429C8418UL))
#define bM4_I2C2_CLR_TEMPTYFCLR                         *((volatile unsigned int*)(0x429C841CUL))
#define bM4_I2C2_CLR_ARLOFCLR                           *((volatile unsigned int*)(0x429C8424UL))
#define bM4_I2C2_CLR_NACKFCLR                           *((volatile unsigned int*)(0x429C8430UL))
#define bM4_I2C2_CLR_TMOUTFCLR                          *((volatile unsigned int*)(0x429C8438UL))
#define bM4_I2C2_CLR_GENCALLFCLR                        *((volatile unsigned int*)(0x429C8450UL))
#define bM4_I2C2_CLR_SMBDEFAULTFCLR                     *((volatile unsigned int*)(0x429C8454UL))
#define bM4_I2C2_CLR_SMBHOSTFCLR                        *((volatile unsigned int*)(0x429C8458UL))
#define bM4_I2C2_CLR_SMBALRTFCLR                        *((volatile unsigned int*)(0x429C845CUL))
#define bM4_I2C2_DTR_DT0                                *((volatile unsigned int*)(0x429C8480UL))
#define bM4_I2C2_DTR_DT1                                *((volatile unsigned int*)(0x429C8484UL))
#define bM4_I2C2_DTR_DT2                                *((volatile unsigned int*)(0x429C8488UL))
#define bM4_I2C2_DTR_DT3                                *((volatile unsigned int*)(0x429C848CUL))
#define bM4_I2C2_DTR_DT4                                *((volatile unsigned int*)(0x429C8490UL))
#define bM4_I2C2_DTR_DT5                                *((volatile unsigned int*)(0x429C8494UL))
#define bM4_I2C2_DTR_DT6                                *((volatile unsigned int*)(0x429C8498UL))
#define bM4_I2C2_DTR_DT7                                *((volatile unsigned int*)(0x429C849CUL))
#define bM4_I2C2_DRR_DR0                                *((volatile unsigned int*)(0x429C8500UL))
#define bM4_I2C2_DRR_DR1                                *((volatile unsigned int*)(0x429C8504UL))
#define bM4_I2C2_DRR_DR2                                *((volatile unsigned int*)(0x429C8508UL))
#define bM4_I2C2_DRR_DR3                                *((volatile unsigned int*)(0x429C850CUL))
#define bM4_I2C2_DRR_DR4                                *((volatile unsigned int*)(0x429C8510UL))
#define bM4_I2C2_DRR_DR5                                *((volatile unsigned int*)(0x429C8514UL))
#define bM4_I2C2_DRR_DR6                                *((volatile unsigned int*)(0x429C8518UL))
#define bM4_I2C2_DRR_DR7                                *((volatile unsigned int*)(0x429C851CUL))
#define bM4_I2C2_CCR_SLOWW0                             *((volatile unsigned int*)(0x429C8580UL))
#define bM4_I2C2_CCR_SLOWW1                             *((volatile unsigned int*)(0x429C8584UL))
#define bM4_I2C2_CCR_SLOWW2                             *((volatile unsigned int*)(0x429C8588UL))
#define bM4_I2C2_CCR_SLOWW3                             *((volatile unsigned int*)(0x429C858CUL))
#define bM4_I2C2_CCR_SLOWW4                             *((volatile unsigned int*)(0x429C8590UL))
#define bM4_I2C2_CCR_SHIGHW0                            *((volatile unsigned int*)(0x429C85A0UL))
#define bM4_I2C2_CCR_SHIGHW1                            *((volatile unsigned int*)(0x429C85A4UL))
#define bM4_I2C2_CCR_SHIGHW2                            *((volatile unsigned int*)(0x429C85A8UL))
#define bM4_I2C2_CCR_SHIGHW3                            *((volatile unsigned int*)(0x429C85ACUL))
#define bM4_I2C2_CCR_SHIGHW4                            *((volatile unsigned int*)(0x429C85B0UL))
#define bM4_I2C2_CCR_FREQ0                              *((volatile unsigned int*)(0x429C85C0UL))
#define bM4_I2C2_CCR_FREQ1                              *((volatile unsigned int*)(0x429C85C4UL))
#define bM4_I2C2_CCR_FREQ2                              *((volatile unsigned int*)(0x429C85C8UL))
#define bM4_I2C2_FLTR_DNF0                              *((volatile unsigned int*)(0x429C8600UL))
#define bM4_I2C2_FLTR_DNF1                              *((volatile unsigned int*)(0x429C8604UL))
#define bM4_I2C2_FLTR_DNFEN                             *((volatile unsigned int*)(0x429C8610UL))
#define bM4_I2C2_FLTR_ANFEN                             *((volatile unsigned int*)(0x429C8614UL))
#define bM4_I2C3_CR1_PE                                 *((volatile unsigned int*)(0x429D0000UL))
#define bM4_I2C3_CR1_SMBUS                              *((volatile unsigned int*)(0x429D0004UL))
#define bM4_I2C3_CR1_SMBALRTEN                          *((volatile unsigned int*)(0x429D0008UL))
#define bM4_I2C3_CR1_SMBDEFAULTEN                       *((volatile unsigned int*)(0x429D000CUL))
#define bM4_I2C3_CR1_SMBHOSTEN                          *((volatile unsigned int*)(0x429D0010UL))
#define bM4_I2C3_CR1_ENGC                               *((volatile unsigned int*)(0x429D0018UL))
#define bM4_I2C3_CR1_RESTART                            *((volatile unsigned int*)(0x429D001CUL))
#define bM4_I2C3_CR1_START                              *((volatile unsigned int*)(0x429D0020UL))
#define bM4_I2C3_CR1_STOP                               *((volatile unsigned int*)(0x429D0024UL))
#define bM4_I2C3_CR1_ACK                                *((volatile unsigned int*)(0x429D0028UL))
#define bM4_I2C3_CR1_SWRST                              *((volatile unsigned int*)(0x429D003CUL))
#define bM4_I2C3_CR2_STARTIE                            *((volatile unsigned int*)(0x429D0080UL))
#define bM4_I2C3_CR2_SLADDR0IE                          *((volatile unsigned int*)(0x429D0084UL))
#define bM4_I2C3_CR2_SLADDR1IE                          *((volatile unsigned int*)(0x429D0088UL))
#define bM4_I2C3_CR2_TENDIE                             *((volatile unsigned int*)(0x429D008CUL))
#define bM4_I2C3_CR2_STOPIE                             *((volatile unsigned int*)(0x429D0090UL))
#define bM4_I2C3_CR2_RFULLIE                            *((volatile unsigned int*)(0x429D0098UL))
#define bM4_I2C3_CR2_TEMPTYIE                           *((volatile unsigned int*)(0x429D009CUL))
#define bM4_I2C3_CR2_ARLOIE                             *((volatile unsigned int*)(0x429D00A4UL))
#define bM4_I2C3_CR2_NACKIE                             *((volatile unsigned int*)(0x429D00B0UL))
#define bM4_I2C3_CR2_TMOUTIE                            *((volatile unsigned int*)(0x429D00B8UL))
#define bM4_I2C3_CR2_GENCALLIE                          *((volatile unsigned int*)(0x429D00D0UL))
#define bM4_I2C3_CR2_SMBDEFAULTIE                       *((volatile unsigned int*)(0x429D00D4UL))
#define bM4_I2C3_CR2_SMHOSTIE                           *((volatile unsigned int*)(0x429D00D8UL))
#define bM4_I2C3_CR2_SMBALRTIE                          *((volatile unsigned int*)(0x429D00DCUL))
#define bM4_I2C3_CR3_TMOUTEN                            *((volatile unsigned int*)(0x429D0100UL))
#define bM4_I2C3_CR3_LTMOUT                             *((volatile unsigned int*)(0x429D0104UL))
#define bM4_I2C3_CR3_HTMOUT                             *((volatile unsigned int*)(0x429D0108UL))
#define bM4_I2C3_CR3_FACKEN                             *((volatile unsigned int*)(0x429D011CUL))
#define bM4_I2C3_SLR0_SLADDR00                          *((volatile unsigned int*)(0x429D0200UL))
#define bM4_I2C3_SLR0_SLADDR01                          *((volatile unsigned int*)(0x429D0204UL))
#define bM4_I2C3_SLR0_SLADDR02                          *((volatile unsigned int*)(0x429D0208UL))
#define bM4_I2C3_SLR0_SLADDR03                          *((volatile unsigned int*)(0x429D020CUL))
#define bM4_I2C3_SLR0_SLADDR04                          *((volatile unsigned int*)(0x429D0210UL))
#define bM4_I2C3_SLR0_SLADDR05                          *((volatile unsigned int*)(0x429D0214UL))
#define bM4_I2C3_SLR0_SLADDR06                          *((volatile unsigned int*)(0x429D0218UL))
#define bM4_I2C3_SLR0_SLADDR07                          *((volatile unsigned int*)(0x429D021CUL))
#define bM4_I2C3_SLR0_SLADDR08                          *((volatile unsigned int*)(0x429D0220UL))
#define bM4_I2C3_SLR0_SLADDR09                          *((volatile unsigned int*)(0x429D0224UL))
#define bM4_I2C3_SLR0_SLADDR0EN                         *((volatile unsigned int*)(0x429D0230UL))
#define bM4_I2C3_SLR0_ADDRMOD0                          *((volatile unsigned int*)(0x429D023CUL))
#define bM4_I2C3_SLR1_SLADDR10                          *((volatile unsigned int*)(0x429D0280UL))
#define bM4_I2C3_SLR1_SLADDR11                          *((volatile unsigned int*)(0x429D0284UL))
#define bM4_I2C3_SLR1_SLADDR12                          *((volatile unsigned int*)(0x429D0288UL))
#define bM4_I2C3_SLR1_SLADDR13                          *((volatile unsigned int*)(0x429D028CUL))
#define bM4_I2C3_SLR1_SLADDR14                          *((volatile unsigned int*)(0x429D0290UL))
#define bM4_I2C3_SLR1_SLADDR15                          *((volatile unsigned int*)(0x429D0294UL))
#define bM4_I2C3_SLR1_SLADDR16                          *((volatile unsigned int*)(0x429D0298UL))
#define bM4_I2C3_SLR1_SLADDR17                          *((volatile unsigned int*)(0x429D029CUL))
#define bM4_I2C3_SLR1_SLADDR18                          *((volatile unsigned int*)(0x429D02A0UL))
#define bM4_I2C3_SLR1_SLADDR19                          *((volatile unsigned int*)(0x429D02A4UL))
#define bM4_I2C3_SLR1_SLADDR1EN                         *((volatile unsigned int*)(0x429D02B0UL))
#define bM4_I2C3_SLR1_ADDRMOD1                          *((volatile unsigned int*)(0x429D02BCUL))
#define bM4_I2C3_SLTR_TOUTLOW0                          *((volatile unsigned int*)(0x429D0300UL))
#define bM4_I2C3_SLTR_TOUTLOW1                          *((volatile unsigned int*)(0x429D0304UL))
#define bM4_I2C3_SLTR_TOUTLOW2                          *((volatile unsigned int*)(0x429D0308UL))
#define bM4_I2C3_SLTR_TOUTLOW3                          *((volatile unsigned int*)(0x429D030CUL))
#define bM4_I2C3_SLTR_TOUTLOW4                          *((volatile unsigned int*)(0x429D0310UL))
#define bM4_I2C3_SLTR_TOUTLOW5                          *((volatile unsigned int*)(0x429D0314UL))
#define bM4_I2C3_SLTR_TOUTLOW6                          *((volatile unsigned int*)(0x429D0318UL))
#define bM4_I2C3_SLTR_TOUTLOW7                          *((volatile unsigned int*)(0x429D031CUL))
#define bM4_I2C3_SLTR_TOUTLOW8                          *((volatile unsigned int*)(0x429D0320UL))
#define bM4_I2C3_SLTR_TOUTLOW9                          *((volatile unsigned int*)(0x429D0324UL))
#define bM4_I2C3_SLTR_TOUTLOW10                         *((volatile unsigned int*)(0x429D0328UL))
#define bM4_I2C3_SLTR_TOUTLOW11                         *((volatile unsigned int*)(0x429D032CUL))
#define bM4_I2C3_SLTR_TOUTLOW12                         *((volatile unsigned int*)(0x429D0330UL))
#define bM4_I2C3_SLTR_TOUTLOW13                         *((volatile unsigned int*)(0x429D0334UL))
#define bM4_I2C3_SLTR_TOUTLOW14                         *((volatile unsigned int*)(0x429D0338UL))
#define bM4_I2C3_SLTR_TOUTLOW15                         *((volatile unsigned int*)(0x429D033CUL))
#define bM4_I2C3_SLTR_TOUTHIGH0                         *((volatile unsigned int*)(0x429D0340UL))
#define bM4_I2C3_SLTR_TOUTHIGH1                         *((volatile unsigned int*)(0x429D0344UL))
#define bM4_I2C3_SLTR_TOUTHIGH2                         *((volatile unsigned int*)(0x429D0348UL))
#define bM4_I2C3_SLTR_TOUTHIGH3                         *((volatile unsigned int*)(0x429D034CUL))
#define bM4_I2C3_SLTR_TOUTHIGH4                         *((volatile unsigned int*)(0x429D0350UL))
#define bM4_I2C3_SLTR_TOUTHIGH5                         *((volatile unsigned int*)(0x429D0354UL))
#define bM4_I2C3_SLTR_TOUTHIGH6                         *((volatile unsigned int*)(0x429D0358UL))
#define bM4_I2C3_SLTR_TOUTHIGH7                         *((volatile unsigned int*)(0x429D035CUL))
#define bM4_I2C3_SLTR_TOUTHIGH8                         *((volatile unsigned int*)(0x429D0360UL))
#define bM4_I2C3_SLTR_TOUTHIGH9                         *((volatile unsigned int*)(0x429D0364UL))
#define bM4_I2C3_SLTR_TOUTHIGH10                        *((volatile unsigned int*)(0x429D0368UL))
#define bM4_I2C3_SLTR_TOUTHIGH11                        *((volatile unsigned int*)(0x429D036CUL))
#define bM4_I2C3_SLTR_TOUTHIGH12                        *((volatile unsigned int*)(0x429D0370UL))
#define bM4_I2C3_SLTR_TOUTHIGH13                        *((volatile unsigned int*)(0x429D0374UL))
#define bM4_I2C3_SLTR_TOUTHIGH14                        *((volatile unsigned int*)(0x429D0378UL))
#define bM4_I2C3_SLTR_TOUTHIGH15                        *((volatile unsigned int*)(0x429D037CUL))
#define bM4_I2C3_SR_STARTF                              *((volatile unsigned int*)(0x429D0380UL))
#define bM4_I2C3_SR_SLADDR0F                            *((volatile unsigned int*)(0x429D0384UL))
#define bM4_I2C3_SR_SLADDR1F                            *((volatile unsigned int*)(0x429D0388UL))
#define bM4_I2C3_SR_TENDF                               *((volatile unsigned int*)(0x429D038CUL))
#define bM4_I2C3_SR_STOPF                               *((volatile unsigned int*)(0x429D0390UL))
#define bM4_I2C3_SR_RFULLF                              *((volatile unsigned int*)(0x429D0398UL))
#define bM4_I2C3_SR_TEMPTYF                             *((volatile unsigned int*)(0x429D039CUL))
#define bM4_I2C3_SR_ARLOF                               *((volatile unsigned int*)(0x429D03A4UL))
#define bM4_I2C3_SR_ACKRF                               *((volatile unsigned int*)(0x429D03A8UL))
#define bM4_I2C3_SR_NACKF                               *((volatile unsigned int*)(0x429D03B0UL))
#define bM4_I2C3_SR_TMOUTF                              *((volatile unsigned int*)(0x429D03B8UL))
#define bM4_I2C3_SR_MSL                                 *((volatile unsigned int*)(0x429D03C0UL))
#define bM4_I2C3_SR_BUSY                                *((volatile unsigned int*)(0x429D03C4UL))
#define bM4_I2C3_SR_TRA                                 *((volatile unsigned int*)(0x429D03C8UL))
#define bM4_I2C3_SR_GENCALLF                            *((volatile unsigned int*)(0x429D03D0UL))
#define bM4_I2C3_SR_SMBDEFAULTF                         *((volatile unsigned int*)(0x429D03D4UL))
#define bM4_I2C3_SR_SMBHOSTF                            *((volatile unsigned int*)(0x429D03D8UL))
#define bM4_I2C3_SR_SMBALRTF                            *((volatile unsigned int*)(0x429D03DCUL))
#define bM4_I2C3_CLR_STARTFCLR                          *((volatile unsigned int*)(0x429D0400UL))
#define bM4_I2C3_CLR_SLADDR0FCLR                        *((volatile unsigned int*)(0x429D0404UL))
#define bM4_I2C3_CLR_SLADDR1FCLR                        *((volatile unsigned int*)(0x429D0408UL))
#define bM4_I2C3_CLR_TENDFCLR                           *((volatile unsigned int*)(0x429D040CUL))
#define bM4_I2C3_CLR_STOPFCLR                           *((volatile unsigned int*)(0x429D0410UL))
#define bM4_I2C3_CLR_RFULLFCLR                          *((volatile unsigned int*)(0x429D0418UL))
#define bM4_I2C3_CLR_TEMPTYFCLR                         *((volatile unsigned int*)(0x429D041CUL))
#define bM4_I2C3_CLR_ARLOFCLR                           *((volatile unsigned int*)(0x429D0424UL))
#define bM4_I2C3_CLR_NACKFCLR                           *((volatile unsigned int*)(0x429D0430UL))
#define bM4_I2C3_CLR_TMOUTFCLR                          *((volatile unsigned int*)(0x429D0438UL))
#define bM4_I2C3_CLR_GENCALLFCLR                        *((volatile unsigned int*)(0x429D0450UL))
#define bM4_I2C3_CLR_SMBDEFAULTFCLR                     *((volatile unsigned int*)(0x429D0454UL))
#define bM4_I2C3_CLR_SMBHOSTFCLR                        *((volatile unsigned int*)(0x429D0458UL))
#define bM4_I2C3_CLR_SMBALRTFCLR                        *((volatile unsigned int*)(0x429D045CUL))
#define bM4_I2C3_DTR_DT0                                *((volatile unsigned int*)(0x429D0480UL))
#define bM4_I2C3_DTR_DT1                                *((volatile unsigned int*)(0x429D0484UL))
#define bM4_I2C3_DTR_DT2                                *((volatile unsigned int*)(0x429D0488UL))
#define bM4_I2C3_DTR_DT3                                *((volatile unsigned int*)(0x429D048CUL))
#define bM4_I2C3_DTR_DT4                                *((volatile unsigned int*)(0x429D0490UL))
#define bM4_I2C3_DTR_DT5                                *((volatile unsigned int*)(0x429D0494UL))
#define bM4_I2C3_DTR_DT6                                *((volatile unsigned int*)(0x429D0498UL))
#define bM4_I2C3_DTR_DT7                                *((volatile unsigned int*)(0x429D049CUL))
#define bM4_I2C3_DRR_DR0                                *((volatile unsigned int*)(0x429D0500UL))
#define bM4_I2C3_DRR_DR1                                *((volatile unsigned int*)(0x429D0504UL))
#define bM4_I2C3_DRR_DR2                                *((volatile unsigned int*)(0x429D0508UL))
#define bM4_I2C3_DRR_DR3                                *((volatile unsigned int*)(0x429D050CUL))
