CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_INTC_SEL13_INTSEL3                          *((volatile unsigned int*)(0x42A2120CUL))
#define bM4_INTC_SEL13_INTSEL4                          *((volatile unsigned int*)(0x42A21210UL))
#define bM4_INTC_SEL13_INTSEL5                          *((volatile unsigned int*)(0x42A21214UL))
#define bM4_INTC_SEL13_INTSEL6                          *((volatile unsigned int*)(0x42A21218UL))
#define bM4_INTC_SEL13_INTSEL7                          *((volatile unsigned int*)(0x42A2121CUL))
#define bM4_INTC_SEL13_INTSEL8                          *((volatile unsigned int*)(0x42A21220UL))
#define bM4_INTC_SEL14_INTSEL0                          *((volatile unsigned int*)(0x42A21280UL))
#define bM4_INTC_SEL14_INTSEL1                          *((volatile unsigned int*)(0x42A21284UL))
#define bM4_INTC_SEL14_INTSEL2                          *((volatile unsigned int*)(0x42A21288UL))
#define bM4_INTC_SEL14_INTSEL3                          *((volatile unsigned int*)(0x42A2128CUL))
#define bM4_INTC_SEL14_INTSEL4                          *((volatile unsigned int*)(0x42A21290UL))
#define bM4_INTC_SEL14_INTSEL5                          *((volatile unsigned int*)(0x42A21294UL))
#define bM4_INTC_SEL14_INTSEL6                          *((volatile unsigned int*)(0x42A21298UL))
#define bM4_INTC_SEL14_INTSEL7                          *((volatile unsigned int*)(0x42A2129CUL))
#define bM4_INTC_SEL14_INTSEL8                          *((volatile unsigned int*)(0x42A212A0UL))
#define bM4_INTC_SEL15_INTSEL0                          *((volatile unsigned int*)(0x42A21300UL))
#define bM4_INTC_SEL15_INTSEL1                          *((volatile unsigned int*)(0x42A21304UL))
#define bM4_INTC_SEL15_INTSEL2                          *((volatile unsigned int*)(0x42A21308UL))
#define bM4_INTC_SEL15_INTSEL3                          *((volatile unsigned int*)(0x42A2130CUL))
#define bM4_INTC_SEL15_INTSEL4                          *((volatile unsigned int*)(0x42A21310UL))
#define bM4_INTC_SEL15_INTSEL5                          *((volatile unsigned int*)(0x42A21314UL))
#define bM4_INTC_SEL15_INTSEL6                          *((volatile unsigned int*)(0x42A21318UL))
#define bM4_INTC_SEL15_INTSEL7                          *((volatile unsigned int*)(0x42A2131CUL))
#define bM4_INTC_SEL15_INTSEL8                          *((volatile unsigned int*)(0x42A21320UL))
#define bM4_INTC_SEL16_INTSEL0                          *((volatile unsigned int*)(0x42A21380UL))
#define bM4_INTC_SEL16_INTSEL1                          *((volatile unsigned int*)(0x42A21384UL))
#define bM4_INTC_SEL16_INTSEL2                          *((volatile unsigned int*)(0x42A21388UL))
#define bM4_INTC_SEL16_INTSEL3                          *((volatile unsigned int*)(0x42A2138CUL))
#define bM4_INTC_SEL16_INTSEL4                          *((volatile unsigned int*)(0x42A21390UL))
#define bM4_INTC_SEL16_INTSEL5                          *((volatile unsigned int*)(0x42A21394UL))
#define bM4_INTC_SEL16_INTSEL6                          *((volatile unsigned int*)(0x42A21398UL))
#define bM4_INTC_SEL16_INTSEL7                          *((volatile unsigned int*)(0x42A2139CUL))
#define bM4_INTC_SEL16_INTSEL8                          *((volatile unsigned int*)(0x42A213A0UL))
#define bM4_INTC_SEL17_INTSEL0                          *((volatile unsigned int*)(0x42A21400UL))
#define bM4_INTC_SEL17_INTSEL1                          *((volatile unsigned int*)(0x42A21404UL))
#define bM4_INTC_SEL17_INTSEL2                          *((volatile unsigned int*)(0x42A21408UL))
#define bM4_INTC_SEL17_INTSEL3                          *((volatile unsigned int*)(0x42A2140CUL))
#define bM4_INTC_SEL17_INTSEL4                          *((volatile unsigned int*)(0x42A21410UL))
#define bM4_INTC_SEL17_INTSEL5                          *((volatile unsigned int*)(0x42A21414UL))
#define bM4_INTC_SEL17_INTSEL6                          *((volatile unsigned int*)(0x42A21418UL))
#define bM4_INTC_SEL17_INTSEL7                          *((volatile unsigned int*)(0x42A2141CUL))
#define bM4_INTC_SEL17_INTSEL8                          *((volatile unsigned int*)(0x42A21420UL))
#define bM4_INTC_SEL18_INTSEL0                          *((volatile unsigned int*)(0x42A21480UL))
#define bM4_INTC_SEL18_INTSEL1                          *((volatile unsigned int*)(0x42A21484UL))
#define bM4_INTC_SEL18_INTSEL2                          *((volatile unsigned int*)(0x42A21488UL))
#define bM4_INTC_SEL18_INTSEL3                          *((volatile unsigned int*)(0x42A2148CUL))
#define bM4_INTC_SEL18_INTSEL4                          *((volatile unsigned int*)(0x42A21490UL))
#define bM4_INTC_SEL18_INTSEL5                          *((volatile unsigned int*)(0x42A21494UL))
#define bM4_INTC_SEL18_INTSEL6                          *((volatile unsigned int*)(0x42A21498UL))
#define bM4_INTC_SEL18_INTSEL7                          *((volatile unsigned int*)(0x42A2149CUL))
#define bM4_INTC_SEL18_INTSEL8                          *((volatile unsigned int*)(0x42A214A0UL))
#define bM4_INTC_SEL19_INTSEL0                          *((volatile unsigned int*)(0x42A21500UL))
#define bM4_INTC_SEL19_INTSEL1                          *((volatile unsigned int*)(0x42A21504UL))
#define bM4_INTC_SEL19_INTSEL2                          *((volatile unsigned int*)(0x42A21508UL))
#define bM4_INTC_SEL19_INTSEL3                          *((volatile unsigned int*)(0x42A2150CUL))
#define bM4_INTC_SEL19_INTSEL4                          *((volatile unsigned int*)(0x42A21510UL))
#define bM4_INTC_SEL19_INTSEL5                          *((volatile unsigned int*)(0x42A21514UL))
#define bM4_INTC_SEL19_INTSEL6                          *((volatile unsigned int*)(0x42A21518UL))
#define bM4_INTC_SEL19_INTSEL7                          *((volatile unsigned int*)(0x42A2151CUL))
#define bM4_INTC_SEL19_INTSEL8                          *((volatile unsigned int*)(0x42A21520UL))
#define bM4_INTC_SEL20_INTSEL0                          *((volatile unsigned int*)(0x42A21580UL))
#define bM4_INTC_SEL20_INTSEL1                          *((volatile unsigned int*)(0x42A21584UL))
#define bM4_INTC_SEL20_INTSEL2                          *((volatile unsigned int*)(0x42A21588UL))
#define bM4_INTC_SEL20_INTSEL3                          *((volatile unsigned int*)(0x42A2158CUL))
#define bM4_INTC_SEL20_INTSEL4                          *((volatile unsigned int*)(0x42A21590UL))
#define bM4_INTC_SEL20_INTSEL5                          *((volatile unsigned int*)(0x42A21594UL))
#define bM4_INTC_SEL20_INTSEL6                          *((volatile unsigned int*)(0x42A21598UL))
#define bM4_INTC_SEL20_INTSEL7                          *((volatile unsigned int*)(0x42A2159CUL))
#define bM4_INTC_SEL20_INTSEL8                          *((volatile unsigned int*)(0x42A215A0UL))
#define bM4_INTC_SEL21_INTSEL0                          *((volatile unsigned int*)(0x42A21600UL))
#define bM4_INTC_SEL21_INTSEL1                          *((volatile unsigned int*)(0x42A21604UL))
#define bM4_INTC_SEL21_INTSEL2                          *((volatile unsigned int*)(0x42A21608UL))
#define bM4_INTC_SEL21_INTSEL3                          *((volatile unsigned int*)(0x42A2160CUL))
#define bM4_INTC_SEL21_INTSEL4                          *((volatile unsigned int*)(0x42A21610UL))
#define bM4_INTC_SEL21_INTSEL5                          *((volatile unsigned int*)(0x42A21614UL))
#define bM4_INTC_SEL21_INTSEL6                          *((volatile unsigned int*)(0x42A21618UL))
#define bM4_INTC_SEL21_INTSEL7                          *((volatile unsigned int*)(0x42A2161CUL))
#define bM4_INTC_SEL21_INTSEL8                          *((volatile unsigned int*)(0x42A21620UL))
#define bM4_INTC_SEL22_INTSEL0                          *((volatile unsigned int*)(0x42A21680UL))
#define bM4_INTC_SEL22_INTSEL1                          *((volatile unsigned int*)(0x42A21684UL))
#define bM4_INTC_SEL22_INTSEL2                          *((volatile unsigned int*)(0x42A21688UL))
#define bM4_INTC_SEL22_INTSEL3                          *((volatile unsigned int*)(0x42A2168CUL))
#define bM4_INTC_SEL22_INTSEL4                          *((volatile unsigned int*)(0x42A21690UL))
#define bM4_INTC_SEL22_INTSEL5                          *((volatile unsigned int*)(0x42A21694UL))
#define bM4_INTC_SEL22_INTSEL6                          *((volatile unsigned int*)(0x42A21698UL))
#define bM4_INTC_SEL22_INTSEL7                          *((volatile unsigned int*)(0x42A2169CUL))
#define bM4_INTC_SEL22_INTSEL8                          *((volatile unsigned int*)(0x42A216A0UL))
#define bM4_INTC_SEL23_INTSEL0                          *((volatile unsigned int*)(0x42A21700UL))
#define bM4_INTC_SEL23_INTSEL1                          *((volatile unsigned int*)(0x42A21704UL))
#define bM4_INTC_SEL23_INTSEL2                          *((volatile unsigned int*)(0x42A21708UL))
#define bM4_INTC_SEL23_INTSEL3                          *((volatile unsigned int*)(0x42A2170CUL))
#define bM4_INTC_SEL23_INTSEL4                          *((volatile unsigned int*)(0x42A21710UL))
#define bM4_INTC_SEL23_INTSEL5                          *((volatile unsigned int*)(0x42A21714UL))
#define bM4_INTC_SEL23_INTSEL6                          *((volatile unsigned int*)(0x42A21718UL))
#define bM4_INTC_SEL23_INTSEL7                          *((volatile unsigned int*)(0x42A2171CUL))
#define bM4_INTC_SEL23_INTSEL8                          *((volatile unsigned int*)(0x42A21720UL))
#define bM4_INTC_SEL24_INTSEL0                          *((volatile unsigned int*)(0x42A21780UL))
#define bM4_INTC_SEL24_INTSEL1                          *((volatile unsigned int*)(0x42A21784UL))
#define bM4_INTC_SEL24_INTSEL2                          *((volatile unsigned int*)(0x42A21788UL))
#define bM4_INTC_SEL24_INTSEL3                          *((volatile unsigned int*)(0x42A2178CUL))
#define bM4_INTC_SEL24_INTSEL4                          *((volatile unsigned int*)(0x42A21790UL))
#define bM4_INTC_SEL24_INTSEL5                          *((volatile unsigned int*)(0x42A21794UL))
#define bM4_INTC_SEL24_INTSEL6                          *((volatile unsigned int*)(0x42A21798UL))
#define bM4_INTC_SEL24_INTSEL7                          *((volatile unsigned int*)(0x42A2179CUL))
#define bM4_INTC_SEL24_INTSEL8                          *((volatile unsigned int*)(0x42A217A0UL))
#define bM4_INTC_SEL25_INTSEL0                          *((volatile unsigned int*)(0x42A21800UL))
#define bM4_INTC_SEL25_INTSEL1                          *((volatile unsigned int*)(0x42A21804UL))
#define bM4_INTC_SEL25_INTSEL2                          *((volatile unsigned int*)(0x42A21808UL))
#define bM4_INTC_SEL25_INTSEL3                          *((volatile unsigned int*)(0x42A2180CUL))
#define bM4_INTC_SEL25_INTSEL4                          *((volatile unsigned int*)(0x42A21810UL))
#define bM4_INTC_SEL25_INTSEL5                          *((volatile unsigned int*)(0x42A21814UL))
#define bM4_INTC_SEL25_INTSEL6                          *((volatile unsigned int*)(0x42A21818UL))
#define bM4_INTC_SEL25_INTSEL7                          *((volatile unsigned int*)(0x42A2181CUL))
#define bM4_INTC_SEL25_INTSEL8                          *((volatile unsigned int*)(0x42A21820UL))
#define bM4_INTC_SEL26_INTSEL0                          *((volatile unsigned int*)(0x42A21880UL))
#define bM4_INTC_SEL26_INTSEL1                          *((volatile unsigned int*)(0x42A21884UL))
#define bM4_INTC_SEL26_INTSEL2                          *((volatile unsigned int*)(0x42A21888UL))
#define bM4_INTC_SEL26_INTSEL3                          *((volatile unsigned int*)(0x42A2188CUL))
#define bM4_INTC_SEL26_INTSEL4                          *((volatile unsigned int*)(0x42A21890UL))
#define bM4_INTC_SEL26_INTSEL5                          *((volatile unsigned int*)(0x42A21894UL))
#define bM4_INTC_SEL26_INTSEL6                          *((volatile unsigned int*)(0x42A21898UL))
#define bM4_INTC_SEL26_INTSEL7                          *((volatile unsigned int*)(0x42A2189CUL))
#define bM4_INTC_SEL26_INTSEL8                          *((volatile unsigned int*)(0x42A218A0UL))
#define bM4_INTC_SEL27_INTSEL0                          *((volatile unsigned int*)(0x42A21900UL))
#define bM4_INTC_SEL27_INTSEL1                          *((volatile unsigned int*)(0x42A21904UL))
#define bM4_INTC_SEL27_INTSEL2                          *((volatile unsigned int*)(0x42A21908UL))
#define bM4_INTC_SEL27_INTSEL3                          *((volatile unsigned int*)(0x42A2190CUL))
#define bM4_INTC_SEL27_INTSEL4                          *((volatile unsigned int*)(0x42A21910UL))
#define bM4_INTC_SEL27_INTSEL5                          *((volatile unsigned int*)(0x42A21914UL))
#define bM4_INTC_SEL27_INTSEL6                          *((volatile unsigned int*)(0x42A21918UL))
#define bM4_INTC_SEL27_INTSEL7                          *((volatile unsigned int*)(0x42A2191CUL))
#define bM4_INTC_SEL27_INTSEL8                          *((volatile unsigned int*)(0x42A21920UL))
#define bM4_INTC_SEL28_INTSEL0                          *((volatile unsigned int*)(0x42A21980UL))
#define bM4_INTC_SEL28_INTSEL1                          *((volatile unsigned int*)(0x42A21984UL))
#define bM4_INTC_SEL28_INTSEL2                          *((volatile unsigned int*)(0x42A21988UL))
#define bM4_INTC_SEL28_INTSEL3                          *((volatile unsigned int*)(0x42A2198CUL))
#define bM4_INTC_SEL28_INTSEL4                          *((volatile unsigned int*)(0x42A21990UL))
#define bM4_INTC_SEL28_INTSEL5                          *((volatile unsigned int*)(0x42A21994UL))
#define bM4_INTC_SEL28_INTSEL6                          *((volatile unsigned int*)(0x42A21998UL))
#define bM4_INTC_SEL28_INTSEL7                          *((volatile unsigned int*)(0x42A2199CUL))
#define bM4_INTC_SEL28_INTSEL8                          *((volatile unsigned int*)(0x42A219A0UL))
#define bM4_INTC_SEL29_INTSEL0                          *((volatile unsigned int*)(0x42A21A00UL))
#define bM4_INTC_SEL29_INTSEL1                          *((volatile unsigned int*)(0x42A21A04UL))
#define bM4_INTC_SEL29_INTSEL2                          *((volatile unsigned int*)(0x42A21A08UL))
#define bM4_INTC_SEL29_INTSEL3                          *((volatile unsigned int*)(0x42A21A0CUL))
#define bM4_INTC_SEL29_INTSEL4                          *((volatile unsigned int*)(0x42A21A10UL))
#define bM4_INTC_SEL29_INTSEL5                          *((volatile unsigned int*)(0x42A21A14UL))
#define bM4_INTC_SEL29_INTSEL6                          *((volatile unsigned int*)(0x42A21A18UL))
#define bM4_INTC_SEL29_INTSEL7                          *((volatile unsigned int*)(0x42A21A1CUL))
#define bM4_INTC_SEL29_INTSEL8                          *((volatile unsigned int*)(0x42A21A20UL))
#define bM4_INTC_SEL30_INTSEL0                          *((volatile unsigned int*)(0x42A21A80UL))
#define bM4_INTC_SEL30_INTSEL1                          *((volatile unsigned int*)(0x42A21A84UL))
#define bM4_INTC_SEL30_INTSEL2                          *((volatile unsigned int*)(0x42A21A88UL))
#define bM4_INTC_SEL30_INTSEL3                          *((volatile unsigned int*)(0x42A21A8CUL))
#define bM4_INTC_SEL30_INTSEL4                          *((volatile unsigned int*)(0x42A21A90UL))
#define bM4_INTC_SEL30_INTSEL5                          *((volatile unsigned int*)(0x42A21A94UL))
#define bM4_INTC_SEL30_INTSEL6                          *((volatile unsigned int*)(0x42A21A98UL))
#define bM4_INTC_SEL30_INTSEL7                          *((volatile unsigned int*)(0x42A21A9CUL))
#define bM4_INTC_SEL30_INTSEL8                          *((volatile unsigned int*)(0x42A21AA0UL))
#define bM4_INTC_SEL31_INTSEL0                          *((volatile unsigned int*)(0x42A21B00UL))
#define bM4_INTC_SEL31_INTSEL1                          *((volatile unsigned int*)(0x42A21B04UL))
#define bM4_INTC_SEL31_INTSEL2                          *((volatile unsigned int*)(0x42A21B08UL))
#define bM4_INTC_SEL31_INTSEL3                          *((volatile unsigned int*)(0x42A21B0CUL))
#define bM4_INTC_SEL31_INTSEL4                          *((volatile unsigned int*)(0x42A21B10UL))
#define bM4_INTC_SEL31_INTSEL5                          *((volatile unsigned int*)(0x42A21B14UL))
#define bM4_INTC_SEL31_INTSEL6                          *((volatile unsigned int*)(0x42A21B18UL))
#define bM4_INTC_SEL31_INTSEL7                          *((volatile unsigned int*)(0x42A21B1CUL))
#define bM4_INTC_SEL31_INTSEL8                          *((volatile unsigned int*)(0x42A21B20UL))
#define bM4_INTC_SEL32_INTSEL0                          *((volatile unsigned int*)(0x42A21B80UL))
#define bM4_INTC_SEL32_INTSEL1                          *((volatile unsigned int*)(0x42A21B84UL))
#define bM4_INTC_SEL32_INTSEL2                          *((volatile unsigned int*)(0x42A21B88UL))
#define bM4_INTC_SEL32_INTSEL3                          *((volatile unsigned int*)(0x42A21B8CUL))
#define bM4_INTC_SEL32_INTSEL4                          *((volatile unsigned int*)(0x42A21B90UL))
#define bM4_INTC_SEL32_INTSEL5                          *((volatile unsigned int*)(0x42A21B94UL))
#define bM4_INTC_SEL32_INTSEL6                          *((volatile unsigned int*)(0x42A21B98UL))
#define bM4_INTC_SEL32_INTSEL7                          *((volatile unsigned int*)(0x42A21B9CUL))
#define bM4_INTC_SEL32_INTSEL8                          *((volatile unsigned int*)(0x42A21BA0UL))
#define bM4_INTC_SEL33_INTSEL0                          *((volatile unsigned int*)(0x42A21C00UL))
#define bM4_INTC_SEL33_INTSEL1                          *((volatile unsigned int*)(0x42A21C04UL))
#define bM4_INTC_SEL33_INTSEL2                          *((volatile unsigned int*)(0x42A21C08UL))
#define bM4_INTC_SEL33_INTSEL3                          *((volatile unsigned int*)(0x42A21C0CUL))
#define bM4_INTC_SEL33_INTSEL4                          *((volatile unsigned int*)(0x42A21C10UL))
#define bM4_INTC_SEL33_INTSEL5                          *((volatile unsigned int*)(0x42A21C14UL))
#define bM4_INTC_SEL33_INTSEL6                          *((volatile unsigned int*)(0x42A21C18UL))
#define bM4_INTC_SEL33_INTSEL7                          *((volatile unsigned int*)(0x42A21C1CUL))
#define bM4_INTC_SEL33_INTSEL8                          *((volatile unsigned int*)(0x42A21C20UL))
#define bM4_INTC_SEL34_INTSEL0                          *((volatile unsigned int*)(0x42A21C80UL))
#define bM4_INTC_SEL34_INTSEL1                          *((volatile unsigned int*)(0x42A21C84UL))
#define bM4_INTC_SEL34_INTSEL2                          *((volatile unsigned int*)(0x42A21C88UL))
#define bM4_INTC_SEL34_INTSEL3                          *((volatile unsigned int*)(0x42A21C8CUL))
#define bM4_INTC_SEL34_INTSEL4                          *((volatile unsigned int*)(0x42A21C90UL))
#define bM4_INTC_SEL34_INTSEL5                          *((volatile unsigned int*)(0x42A21C94UL))
#define bM4_INTC_SEL34_INTSEL6                          *((volatile unsigned int*)(0x42A21C98UL))
#define bM4_INTC_SEL34_INTSEL7                          *((volatile unsigned int*)(0x42A21C9CUL))
#define bM4_INTC_SEL34_INTSEL8                          *((volatile unsigned int*)(0x42A21CA0UL))
#define bM4_INTC_SEL35_INTSEL0                          *((volatile unsigned int*)(0x42A21D00UL))
#define bM4_INTC_SEL35_INTSEL1                          *((volatile unsigned int*)(0x42A21D04UL))
#define bM4_INTC_SEL35_INTSEL2                          *((volatile unsigned int*)(0x42A21D08UL))
#define bM4_INTC_SEL35_INTSEL3                          *((volatile unsigned int*)(0x42A21D0CUL))
#define bM4_INTC_SEL35_INTSEL4                          *((volatile unsigned int*)(0x42A21D10UL))
#define bM4_INTC_SEL35_INTSEL5                          *((volatile unsigned int*)(0x42A21D14UL))
#define bM4_INTC_SEL35_INTSEL6                          *((volatile unsigned int*)(0x42A21D18UL))
#define bM4_INTC_SEL35_INTSEL7                          *((volatile unsigned int*)(0x42A21D1CUL))
#define bM4_INTC_SEL35_INTSEL8                          *((volatile unsigned int*)(0x42A21D20UL))
#define bM4_INTC_SEL36_INTSEL0                          *((volatile unsigned int*)(0x42A21D80UL))
#define bM4_INTC_SEL36_INTSEL1                          *((volatile unsigned int*)(0x42A21D84UL))
#define bM4_INTC_SEL36_INTSEL2                          *((volatile unsigned int*)(0x42A21D88UL))
#define bM4_INTC_SEL36_INTSEL3                          *((volatile unsigned int*)(0x42A21D8CUL))
#define bM4_INTC_SEL36_INTSEL4                          *((volatile unsigned int*)(0x42A21D90UL))
#define bM4_INTC_SEL36_INTSEL5                          *((volatile unsigned int*)(0x42A21D94UL))
#define bM4_INTC_SEL36_INTSEL6                          *((volatile unsigned int*)(0x42A21D98UL))
#define bM4_INTC_SEL36_INTSEL7                          *((volatile unsigned int*)(0x42A21D9CUL))
#define bM4_INTC_SEL36_INTSEL8                          *((volatile unsigned int*)(0x42A21DA0UL))
#define bM4_INTC_SEL37_INTSEL0                          *((volatile unsigned int*)(0x42A21E00UL))
#define bM4_INTC_SEL37_INTSEL1                          *((volatile unsigned int*)(0x42A21E04UL))
#define bM4_INTC_SEL37_INTSEL2                          *((volatile unsigned int*)(0x42A21E08UL))
#define bM4_INTC_SEL37_INTSEL3                          *((volatile unsigned int*)(0x42A21E0CUL))
#define bM4_INTC_SEL37_INTSEL4                          *((volatile unsigned int*)(0x42A21E10UL))
#define bM4_INTC_SEL37_INTSEL5                          *((volatile unsigned int*)(0x42A21E14UL))
#define bM4_INTC_SEL37_INTSEL6                          *((volatile unsigned int*)(0x42A21E18UL))
#define bM4_INTC_SEL37_INTSEL7                          *((volatile unsigned int*)(0x42A21E1CUL))
#define bM4_INTC_SEL37_INTSEL8                          *((volatile unsigned int*)(0x42A21E20UL))
#define bM4_INTC_SEL38_INTSEL0                          *((volatile unsigned int*)(0x42A21E80UL))
#define bM4_INTC_SEL38_INTSEL1                          *((volatile unsigned int*)(0x42A21E84UL))
#define bM4_INTC_SEL38_INTSEL2                          *((volatile unsigned int*)(0x42A21E88UL))
#define bM4_INTC_SEL38_INTSEL3                          *((volatile unsigned int*)(0x42A21E8CUL))
#define bM4_INTC_SEL38_INTSEL4                          *((volatile unsigned int*)(0x42A21E90UL))
#define bM4_INTC_SEL38_INTSEL5                          *((volatile unsigned int*)(0x42A21E94UL))
#define bM4_INTC_SEL38_INTSEL6                          *((volatile unsigned int*)(0x42A21E98UL))
#define bM4_INTC_SEL38_INTSEL7                          *((volatile unsigned int*)(0x42A21E9CUL))
#define bM4_INTC_SEL38_INTSEL8                          *((volatile unsigned int*)(0x42A21EA0UL))
#define bM4_INTC_SEL39_INTSEL0                          *((volatile unsigned int*)(0x42A21F00UL))
#define bM4_INTC_SEL39_INTSEL1                          *((volatile unsigned int*)(0x42A21F04UL))
#define bM4_INTC_SEL39_INTSEL2                          *((volatile unsigned int*)(0x42A21F08UL))
#define bM4_INTC_SEL39_INTSEL3                          *((volatile unsigned int*)(0x42A21F0CUL))
#define bM4_INTC_SEL39_INTSEL4                          *((volatile unsigned int*)(0x42A21F10UL))
#define bM4_INTC_SEL39_INTSEL5                          *((volatile unsigned int*)(0x42A21F14UL))
#define bM4_INTC_SEL39_INTSEL6                          *((volatile unsigned int*)(0x42A21F18UL))
#define bM4_INTC_SEL39_INTSEL7                          *((volatile unsigned int*)(0x42A21F1CUL))
#define bM4_INTC_SEL39_INTSEL8                          *((volatile unsigned int*)(0x42A21F20UL))
#define bM4_INTC_SEL40_INTSEL0                          *((volatile unsigned int*)(0x42A21F80UL))
#define bM4_INTC_SEL40_INTSEL1                          *((volatile unsigned int*)(0x42A21F84UL))
#define bM4_INTC_SEL40_INTSEL2                          *((volatile unsigned int*)(0x42A21F88UL))
#define bM4_INTC_SEL40_INTSEL3                          *((volatile unsigned int*)(0x42A21F8CUL))
