CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_INTC_SEL121_INTSEL7                         *((volatile unsigned int*)(0x42A2481CUL))
#define bM4_INTC_SEL121_INTSEL8                         *((volatile unsigned int*)(0x42A24820UL))
#define bM4_INTC_SEL122_INTSEL0                         *((volatile unsigned int*)(0x42A24880UL))
#define bM4_INTC_SEL122_INTSEL1                         *((volatile unsigned int*)(0x42A24884UL))
#define bM4_INTC_SEL122_INTSEL2                         *((volatile unsigned int*)(0x42A24888UL))
#define bM4_INTC_SEL122_INTSEL3                         *((volatile unsigned int*)(0x42A2488CUL))
#define bM4_INTC_SEL122_INTSEL4                         *((volatile unsigned int*)(0x42A24890UL))
#define bM4_INTC_SEL122_INTSEL5                         *((volatile unsigned int*)(0x42A24894UL))
#define bM4_INTC_SEL122_INTSEL6                         *((volatile unsigned int*)(0x42A24898UL))
#define bM4_INTC_SEL122_INTSEL7                         *((volatile unsigned int*)(0x42A2489CUL))
#define bM4_INTC_SEL122_INTSEL8                         *((volatile unsigned int*)(0x42A248A0UL))
#define bM4_INTC_SEL123_INTSEL0                         *((volatile unsigned int*)(0x42A24900UL))
#define bM4_INTC_SEL123_INTSEL1                         *((volatile unsigned int*)(0x42A24904UL))
#define bM4_INTC_SEL123_INTSEL2                         *((volatile unsigned int*)(0x42A24908UL))
#define bM4_INTC_SEL123_INTSEL3                         *((volatile unsigned int*)(0x42A2490CUL))
#define bM4_INTC_SEL123_INTSEL4                         *((volatile unsigned int*)(0x42A24910UL))
#define bM4_INTC_SEL123_INTSEL5                         *((volatile unsigned int*)(0x42A24914UL))
#define bM4_INTC_SEL123_INTSEL6                         *((volatile unsigned int*)(0x42A24918UL))
#define bM4_INTC_SEL123_INTSEL7                         *((volatile unsigned int*)(0x42A2491CUL))
#define bM4_INTC_SEL123_INTSEL8                         *((volatile unsigned int*)(0x42A24920UL))
#define bM4_INTC_SEL124_INTSEL0                         *((volatile unsigned int*)(0x42A24980UL))
#define bM4_INTC_SEL124_INTSEL1                         *((volatile unsigned int*)(0x42A24984UL))
#define bM4_INTC_SEL124_INTSEL2                         *((volatile unsigned int*)(0x42A24988UL))
#define bM4_INTC_SEL124_INTSEL3                         *((volatile unsigned int*)(0x42A2498CUL))
#define bM4_INTC_SEL124_INTSEL4                         *((volatile unsigned int*)(0x42A24990UL))
#define bM4_INTC_SEL124_INTSEL5                         *((volatile unsigned int*)(0x42A24994UL))
#define bM4_INTC_SEL124_INTSEL6                         *((volatile unsigned int*)(0x42A24998UL))
#define bM4_INTC_SEL124_INTSEL7                         *((volatile unsigned int*)(0x42A2499CUL))
#define bM4_INTC_SEL124_INTSEL8                         *((volatile unsigned int*)(0x42A249A0UL))
#define bM4_INTC_SEL125_INTSEL0                         *((volatile unsigned int*)(0x42A24A00UL))
#define bM4_INTC_SEL125_INTSEL1                         *((volatile unsigned int*)(0x42A24A04UL))
#define bM4_INTC_SEL125_INTSEL2                         *((volatile unsigned int*)(0x42A24A08UL))
#define bM4_INTC_SEL125_INTSEL3                         *((volatile unsigned int*)(0x42A24A0CUL))
#define bM4_INTC_SEL125_INTSEL4                         *((volatile unsigned int*)(0x42A24A10UL))
#define bM4_INTC_SEL125_INTSEL5                         *((volatile unsigned int*)(0x42A24A14UL))
#define bM4_INTC_SEL125_INTSEL6                         *((volatile unsigned int*)(0x42A24A18UL))
#define bM4_INTC_SEL125_INTSEL7                         *((volatile unsigned int*)(0x42A24A1CUL))
#define bM4_INTC_SEL125_INTSEL8                         *((volatile unsigned int*)(0x42A24A20UL))
#define bM4_INTC_SEL126_INTSEL0                         *((volatile unsigned int*)(0x42A24A80UL))
#define bM4_INTC_SEL126_INTSEL1                         *((volatile unsigned int*)(0x42A24A84UL))
#define bM4_INTC_SEL126_INTSEL2                         *((volatile unsigned int*)(0x42A24A88UL))
#define bM4_INTC_SEL126_INTSEL3                         *((volatile unsigned int*)(0x42A24A8CUL))
#define bM4_INTC_SEL126_INTSEL4                         *((volatile unsigned int*)(0x42A24A90UL))
#define bM4_INTC_SEL126_INTSEL5                         *((volatile unsigned int*)(0x42A24A94UL))
#define bM4_INTC_SEL126_INTSEL6                         *((volatile unsigned int*)(0x42A24A98UL))
#define bM4_INTC_SEL126_INTSEL7                         *((volatile unsigned int*)(0x42A24A9CUL))
#define bM4_INTC_SEL126_INTSEL8                         *((volatile unsigned int*)(0x42A24AA0UL))
#define bM4_INTC_SEL127_INTSEL0                         *((volatile unsigned int*)(0x42A24B00UL))
#define bM4_INTC_SEL127_INTSEL1                         *((volatile unsigned int*)(0x42A24B04UL))
#define bM4_INTC_SEL127_INTSEL2                         *((volatile unsigned int*)(0x42A24B08UL))
#define bM4_INTC_SEL127_INTSEL3                         *((volatile unsigned int*)(0x42A24B0CUL))
#define bM4_INTC_SEL127_INTSEL4                         *((volatile unsigned int*)(0x42A24B10UL))
#define bM4_INTC_SEL127_INTSEL5                         *((volatile unsigned int*)(0x42A24B14UL))
#define bM4_INTC_SEL127_INTSEL6                         *((volatile unsigned int*)(0x42A24B18UL))
#define bM4_INTC_SEL127_INTSEL7                         *((volatile unsigned int*)(0x42A24B1CUL))
#define bM4_INTC_SEL127_INTSEL8                         *((volatile unsigned int*)(0x42A24B20UL))
#define bM4_INTC_VSSEL128_VSEL0                         *((volatile unsigned int*)(0x42A24B80UL))
#define bM4_INTC_VSSEL128_VSEL1                         *((volatile unsigned int*)(0x42A24B84UL))
#define bM4_INTC_VSSEL128_VSEL2                         *((volatile unsigned int*)(0x42A24B88UL))
#define bM4_INTC_VSSEL128_VSEL3                         *((volatile unsigned int*)(0x42A24B8CUL))
#define bM4_INTC_VSSEL128_VSEL4                         *((volatile unsigned int*)(0x42A24B90UL))
#define bM4_INTC_VSSEL128_VSEL5                         *((volatile unsigned int*)(0x42A24B94UL))
#define bM4_INTC_VSSEL128_VSEL6                         *((volatile unsigned int*)(0x42A24B98UL))
#define bM4_INTC_VSSEL128_VSEL7                         *((volatile unsigned int*)(0x42A24B9CUL))
#define bM4_INTC_VSSEL128_VSEL8                         *((volatile unsigned int*)(0x42A24BA0UL))
#define bM4_INTC_VSSEL128_VSEL9                         *((volatile unsigned int*)(0x42A24BA4UL))
#define bM4_INTC_VSSEL128_VSEL10                        *((volatile unsigned int*)(0x42A24BA8UL))
#define bM4_INTC_VSSEL128_VSEL11                        *((volatile unsigned int*)(0x42A24BACUL))
#define bM4_INTC_VSSEL128_VSEL12                        *((volatile unsigned int*)(0x42A24BB0UL))
#define bM4_INTC_VSSEL128_VSEL13                        *((volatile unsigned int*)(0x42A24BB4UL))
#define bM4_INTC_VSSEL128_VSEL14                        *((volatile unsigned int*)(0x42A24BB8UL))
#define bM4_INTC_VSSEL128_VSEL15                        *((volatile unsigned int*)(0x42A24BBCUL))
#define bM4_INTC_VSSEL128_VSEL16                        *((volatile unsigned int*)(0x42A24BC0UL))
#define bM4_INTC_VSSEL128_VSEL17                        *((volatile unsigned int*)(0x42A24BC4UL))
#define bM4_INTC_VSSEL128_VSEL18                        *((volatile unsigned int*)(0x42A24BC8UL))
#define bM4_INTC_VSSEL128_VSEL19                        *((volatile unsigned int*)(0x42A24BCCUL))
#define bM4_INTC_VSSEL128_VSEL20                        *((volatile unsigned int*)(0x42A24BD0UL))
#define bM4_INTC_VSSEL128_VSEL21                        *((volatile unsigned int*)(0x42A24BD4UL))
#define bM4_INTC_VSSEL128_VSEL22                        *((volatile unsigned int*)(0x42A24BD8UL))
#define bM4_INTC_VSSEL128_VSEL23                        *((volatile unsigned int*)(0x42A24BDCUL))
#define bM4_INTC_VSSEL128_VSEL24                        *((volatile unsigned int*)(0x42A24BE0UL))
#define bM4_INTC_VSSEL128_VSEL25                        *((volatile unsigned int*)(0x42A24BE4UL))
#define bM4_INTC_VSSEL128_VSEL26                        *((volatile unsigned int*)(0x42A24BE8UL))
#define bM4_INTC_VSSEL128_VSEL27                        *((volatile unsigned int*)(0x42A24BECUL))
#define bM4_INTC_VSSEL128_VSEL28                        *((volatile unsigned int*)(0x42A24BF0UL))
#define bM4_INTC_VSSEL128_VSEL29                        *((volatile unsigned int*)(0x42A24BF4UL))
#define bM4_INTC_VSSEL128_VSEL30                        *((volatile unsigned int*)(0x42A24BF8UL))
#define bM4_INTC_VSSEL128_VSEL31                        *((volatile unsigned int*)(0x42A24BFCUL))
#define bM4_INTC_VSSEL129_VSEL0                         *((volatile unsigned int*)(0x42A24C00UL))
#define bM4_INTC_VSSEL129_VSEL1                         *((volatile unsigned int*)(0x42A24C04UL))
#define bM4_INTC_VSSEL129_VSEL2                         *((volatile unsigned int*)(0x42A24C08UL))
#define bM4_INTC_VSSEL129_VSEL3                         *((volatile unsigned int*)(0x42A24C0CUL))
#define bM4_INTC_VSSEL129_VSEL4                         *((volatile unsigned int*)(0x42A24C10UL))
#define bM4_INTC_VSSEL129_VSEL5                         *((volatile unsigned int*)(0x42A24C14UL))
#define bM4_INTC_VSSEL129_VSEL6                         *((volatile unsigned int*)(0x42A24C18UL))
#define bM4_INTC_VSSEL129_VSEL7                         *((volatile unsigned int*)(0x42A24C1CUL))
#define bM4_INTC_VSSEL129_VSEL8                         *((volatile unsigned int*)(0x42A24C20UL))
#define bM4_INTC_VSSEL129_VSEL9                         *((volatile unsigned int*)(0x42A24C24UL))
#define bM4_INTC_VSSEL129_VSEL10                        *((volatile unsigned int*)(0x42A24C28UL))
#define bM4_INTC_VSSEL129_VSEL11                        *((volatile unsigned int*)(0x42A24C2CUL))
#define bM4_INTC_VSSEL129_VSEL12                        *((volatile unsigned int*)(0x42A24C30UL))
#define bM4_INTC_VSSEL129_VSEL13                        *((volatile unsigned int*)(0x42A24C34UL))
#define bM4_INTC_VSSEL129_VSEL14                        *((volatile unsigned int*)(0x42A24C38UL))
#define bM4_INTC_VSSEL129_VSEL15                        *((volatile unsigned int*)(0x42A24C3CUL))
#define bM4_INTC_VSSEL129_VSEL16                        *((volatile unsigned int*)(0x42A24C40UL))
#define bM4_INTC_VSSEL129_VSEL17                        *((volatile unsigned int*)(0x42A24C44UL))
#define bM4_INTC_VSSEL129_VSEL18                        *((volatile unsigned int*)(0x42A24C48UL))
#define bM4_INTC_VSSEL129_VSEL19                        *((volatile unsigned int*)(0x42A24C4CUL))
#define bM4_INTC_VSSEL129_VSEL20                        *((volatile unsigned int*)(0x42A24C50UL))
#define bM4_INTC_VSSEL129_VSEL21                        *((volatile unsigned int*)(0x42A24C54UL))
#define bM4_INTC_VSSEL129_VSEL22                        *((volatile unsigned int*)(0x42A24C58UL))
#define bM4_INTC_VSSEL129_VSEL23                        *((volatile unsigned int*)(0x42A24C5CUL))
#define bM4_INTC_VSSEL129_VSEL24                        *((volatile unsigned int*)(0x42A24C60UL))
#define bM4_INTC_VSSEL129_VSEL25                        *((volatile unsigned int*)(0x42A24C64UL))
#define bM4_INTC_VSSEL129_VSEL26                        *((volatile unsigned int*)(0x42A24C68UL))
#define bM4_INTC_VSSEL129_VSEL27                        *((volatile unsigned int*)(0x42A24C6CUL))
#define bM4_INTC_VSSEL129_VSEL28                        *((volatile unsigned int*)(0x42A24C70UL))
#define bM4_INTC_VSSEL129_VSEL29                        *((volatile unsigned int*)(0x42A24C74UL))
#define bM4_INTC_VSSEL129_VSEL30                        *((volatile unsigned int*)(0x42A24C78UL))
#define bM4_INTC_VSSEL129_VSEL31                        *((volatile unsigned int*)(0x42A24C7CUL))
#define bM4_INTC_VSSEL130_VSEL0                         *((volatile unsigned int*)(0x42A24C80UL))
#define bM4_INTC_VSSEL130_VSEL1                         *((volatile unsigned int*)(0x42A24C84UL))
#define bM4_INTC_VSSEL130_VSEL2                         *((volatile unsigned int*)(0x42A24C88UL))
#define bM4_INTC_VSSEL130_VSEL3                         *((volatile unsigned int*)(0x42A24C8CUL))
#define bM4_INTC_VSSEL130_VSEL4                         *((volatile unsigned int*)(0x42A24C90UL))
#define bM4_INTC_VSSEL130_VSEL5                         *((volatile unsigned int*)(0x42A24C94UL))
#define bM4_INTC_VSSEL130_VSEL6                         *((volatile unsigned int*)(0x42A24C98UL))
#define bM4_INTC_VSSEL130_VSEL7                         *((volatile unsigned int*)(0x42A24C9CUL))
#define bM4_INTC_VSSEL130_VSEL8                         *((volatile unsigned int*)(0x42A24CA0UL))
#define bM4_INTC_VSSEL130_VSEL9                         *((volatile unsigned int*)(0x42A24CA4UL))
#define bM4_INTC_VSSEL130_VSEL10                        *((volatile unsigned int*)(0x42A24CA8UL))
#define bM4_INTC_VSSEL130_VSEL11                        *((volatile unsigned int*)(0x42A24CACUL))
#define bM4_INTC_VSSEL130_VSEL12                        *((volatile unsigned int*)(0x42A24CB0UL))
#define bM4_INTC_VSSEL130_VSEL13                        *((volatile unsigned int*)(0x42A24CB4UL))
#define bM4_INTC_VSSEL130_VSEL14                        *((volatile unsigned int*)(0x42A24CB8UL))
#define bM4_INTC_VSSEL130_VSEL15                        *((volatile unsigned int*)(0x42A24CBCUL))
#define bM4_INTC_VSSEL130_VSEL16                        *((volatile unsigned int*)(0x42A24CC0UL))
#define bM4_INTC_VSSEL130_VSEL17                        *((volatile unsigned int*)(0x42A24CC4UL))
#define bM4_INTC_VSSEL130_VSEL18                        *((volatile unsigned int*)(0x42A24CC8UL))
#define bM4_INTC_VSSEL130_VSEL19                        *((volatile unsigned int*)(0x42A24CCCUL))
#define bM4_INTC_VSSEL130_VSEL20                        *((volatile unsigned int*)(0x42A24CD0UL))
#define bM4_INTC_VSSEL130_VSEL21                        *((volatile unsigned int*)(0x42A24CD4UL))
#define bM4_INTC_VSSEL130_VSEL22                        *((volatile unsigned int*)(0x42A24CD8UL))
#define bM4_INTC_VSSEL130_VSEL23                        *((volatile unsigned int*)(0x42A24CDCUL))
#define bM4_INTC_VSSEL130_VSEL24                        *((volatile unsigned int*)(0x42A24CE0UL))
#define bM4_INTC_VSSEL130_VSEL25                        *((volatile unsigned int*)(0x42A24CE4UL))
#define bM4_INTC_VSSEL130_VSEL26                        *((volatile unsigned int*)(0x42A24CE8UL))
#define bM4_INTC_VSSEL130_VSEL27                        *((volatile unsigned int*)(0x42A24CECUL))
#define bM4_INTC_VSSEL130_VSEL28                        *((volatile unsigned int*)(0x42A24CF0UL))
#define bM4_INTC_VSSEL130_VSEL29                        *((volatile unsigned int*)(0x42A24CF4UL))
#define bM4_INTC_VSSEL130_VSEL30                        *((volatile unsigned int*)(0x42A24CF8UL))
#define bM4_INTC_VSSEL130_VSEL31                        *((volatile unsigned int*)(0x42A24CFCUL))
#define bM4_INTC_VSSEL131_VSEL0                         *((volatile unsigned int*)(0x42A24D00UL))
#define bM4_INTC_VSSEL131_VSEL1                         *((volatile unsigned int*)(0x42A24D04UL))
#define bM4_INTC_VSSEL131_VSEL2                         *((volatile unsigned int*)(0x42A24D08UL))
#define bM4_INTC_VSSEL131_VSEL3                         *((volatile unsigned int*)(0x42A24D0CUL))
#define bM4_INTC_VSSEL131_VSEL4                         *((volatile unsigned int*)(0x42A24D10UL))
#define bM4_INTC_VSSEL131_VSEL5                         *((volatile unsigned int*)(0x42A24D14UL))
#define bM4_INTC_VSSEL131_VSEL6                         *((volatile unsigned int*)(0x42A24D18UL))
#define bM4_INTC_VSSEL131_VSEL7                         *((volatile unsigned int*)(0x42A24D1CUL))
#define bM4_INTC_VSSEL131_VSEL8                         *((volatile unsigned int*)(0x42A24D20UL))
#define bM4_INTC_VSSEL131_VSEL9                         *((volatile unsigned int*)(0x42A24D24UL))
#define bM4_INTC_VSSEL131_VSEL10                        *((volatile unsigned int*)(0x42A24D28UL))
#define bM4_INTC_VSSEL131_VSEL11                        *((volatile unsigned int*)(0x42A24D2CUL))
#define bM4_INTC_VSSEL131_VSEL12                        *((volatile unsigned int*)(0x42A24D30UL))
#define bM4_INTC_VSSEL131_VSEL13                        *((volatile unsigned int*)(0x42A24D34UL))
#define bM4_INTC_VSSEL131_VSEL14                        *((volatile unsigned int*)(0x42A24D38UL))
#define bM4_INTC_VSSEL131_VSEL15                        *((volatile unsigned int*)(0x42A24D3CUL))
#define bM4_INTC_VSSEL131_VSEL16                        *((volatile unsigned int*)(0x42A24D40UL))
#define bM4_INTC_VSSEL131_VSEL17                        *((volatile unsigned int*)(0x42A24D44UL))
#define bM4_INTC_VSSEL131_VSEL18                        *((volatile unsigned int*)(0x42A24D48UL))
#define bM4_INTC_VSSEL131_VSEL19                        *((volatile unsigned int*)(0x42A24D4CUL))
#define bM4_INTC_VSSEL131_VSEL20                        *((volatile unsigned int*)(0x42A24D50UL))
#define bM4_INTC_VSSEL131_VSEL21                        *((volatile unsigned int*)(0x42A24D54UL))
#define bM4_INTC_VSSEL131_VSEL22                        *((volatile unsigned int*)(0x42A24D58UL))
#define bM4_INTC_VSSEL131_VSEL23                        *((volatile unsigned int*)(0x42A24D5CUL))
#define bM4_INTC_VSSEL131_VSEL24                        *((volatile unsigned int*)(0x42A24D60UL))
#define bM4_INTC_VSSEL131_VSEL25                        *((volatile unsigned int*)(0x42A24D64UL))
#define bM4_INTC_VSSEL131_VSEL26                        *((volatile unsigned int*)(0x42A24D68UL))
#define bM4_INTC_VSSEL131_VSEL27                        *((volatile unsigned int*)(0x42A24D6CUL))
#define bM4_INTC_VSSEL131_VSEL28                        *((volatile unsigned int*)(0x42A24D70UL))
#define bM4_INTC_VSSEL131_VSEL29                        *((volatile unsigned int*)(0x42A24D74UL))
#define bM4_INTC_VSSEL131_VSEL30                        *((volatile unsigned int*)(0x42A24D78UL))
#define bM4_INTC_VSSEL131_VSEL31                        *((volatile unsigned int*)(0x42A24D7CUL))
#define bM4_INTC_VSSEL132_VSEL0                         *((volatile unsigned int*)(0x42A24D80UL))
#define bM4_INTC_VSSEL132_VSEL1                         *((volatile unsigned int*)(0x42A24D84UL))
#define bM4_INTC_VSSEL132_VSEL2                         *((volatile unsigned int*)(0x42A24D88UL))
#define bM4_INTC_VSSEL132_VSEL3                         *((volatile unsigned int*)(0x42A24D8CUL))
#define bM4_INTC_VSSEL132_VSEL4                         *((volatile unsigned int*)(0x42A24D90UL))
#define bM4_INTC_VSSEL132_VSEL5                         *((volatile unsigned int*)(0x42A24D94UL))
#define bM4_INTC_VSSEL132_VSEL6                         *((volatile unsigned int*)(0x42A24D98UL))
#define bM4_INTC_VSSEL132_VSEL7                         *((volatile unsigned int*)(0x42A24D9CUL))
#define bM4_INTC_VSSEL132_VSEL8                         *((volatile unsigned int*)(0x42A24DA0UL))
#define bM4_INTC_VSSEL132_VSEL9                         *((volatile unsigned int*)(0x42A24DA4UL))
#define bM4_INTC_VSSEL132_VSEL10                        *((volatile unsigned int*)(0x42A24DA8UL))
#define bM4_INTC_VSSEL132_VSEL11                        *((volatile unsigned int*)(0x42A24DACUL))
#define bM4_INTC_VSSEL132_VSEL12                        *((volatile unsigned int*)(0x42A24DB0UL))
#define bM4_INTC_VSSEL132_VSEL13                        *((volatile unsigned int*)(0x42A24DB4UL))
#define bM4_INTC_VSSEL132_VSEL14                        *((volatile unsigned int*)(0x42A24DB8UL))
#define bM4_INTC_VSSEL132_VSEL15                        *((volatile unsigned int*)(0x42A24DBCUL))
#define bM4_INTC_VSSEL132_VSEL16                        *((volatile unsigned int*)(0x42A24DC0UL))
#define bM4_INTC_VSSEL132_VSEL17                        *((volatile unsigned int*)(0x42A24DC4UL))
#define bM4_INTC_VSSEL132_VSEL18                        *((volatile unsigned int*)(0x42A24DC8UL))
#define bM4_INTC_VSSEL132_VSEL19                        *((volatile unsigned int*)(0x42A24DCCUL))
#define bM4_INTC_VSSEL132_VSEL20                        *((volatile unsigned int*)(0x42A24DD0UL))
#define bM4_INTC_VSSEL132_VSEL21                        *((volatile unsigned int*)(0x42A24DD4UL))
#define bM4_INTC_VSSEL132_VSEL22                        *((volatile unsigned int*)(0x42A24DD8UL))
#define bM4_INTC_VSSEL132_VSEL23                        *((volatile unsigned int*)(0x42A24DDCUL))
#define bM4_INTC_VSSEL132_VSEL24                        *((volatile unsigned int*)(0x42A24DE0UL))
#define bM4_INTC_VSSEL132_VSEL25                        *((volatile unsigned int*)(0x42A24DE4UL))
#define bM4_INTC_VSSEL132_VSEL26                        *((volatile unsigned int*)(0x42A24DE8UL))
#define bM4_INTC_VSSEL132_VSEL27                        *((volatile unsigned int*)(0x42A24DECUL))
#define bM4_INTC_VSSEL132_VSEL28                        *((volatile unsigned int*)(0x42A24DF0UL))
#define bM4_INTC_VSSEL132_VSEL29                        *((volatile unsigned int*)(0x42A24DF4UL))
#define bM4_INTC_VSSEL132_VSEL30                        *((volatile unsigned int*)(0x42A24DF8UL))
#define bM4_INTC_VSSEL132_VSEL31                        *((volatile unsigned int*)(0x42A24DFCUL))
#define bM4_INTC_VSSEL133_VSEL0                         *((volatile unsigned int*)(0x42A24E00UL))
#define bM4_INTC_VSSEL133_VSEL1                         *((volatile unsigned int*)(0x42A24E04UL))
#define bM4_INTC_VSSEL133_VSEL2                         *((volatile unsigned int*)(0x42A24E08UL))
#define bM4_INTC_VSSEL133_VSEL3                         *((volatile unsigned int*)(0x42A24E0CUL))
#define bM4_INTC_VSSEL133_VSEL4                         *((volatile unsigned int*)(0x42A24E10UL))
#define bM4_INTC_VSSEL133_VSEL5                         *((volatile unsigned int*)(0x42A24E14UL))
#define bM4_INTC_VSSEL133_VSEL6                         *((volatile unsigned int*)(0x42A24E18UL))
#define bM4_INTC_VSSEL133_VSEL7                         *((volatile unsigned int*)(0x42A24E1CUL))
#define bM4_INTC_VSSEL133_VSEL8                         *((volatile unsigned int*)(0x42A24E20UL))
#define bM4_INTC_VSSEL133_VSEL9                         *((volatile unsigned int*)(0x42A24E24UL))
#define bM4_INTC_VSSEL133_VSEL10                        *((volatile unsigned int*)(0x42A24E28UL))
#define bM4_INTC_VSSEL133_VSEL11                        *((volatile unsigned int*)(0x42A24E2CUL))
#define bM4_INTC_VSSEL133_VSEL12                        *((volatile unsigned int*)(0x42A24E30UL))
#define bM4_INTC_VSSEL133_VSEL13                        *((volatile unsigned int*)(0x42A24E34UL))
#define bM4_INTC_VSSEL133_VSEL14                        *((volatile unsigned int*)(0x42A24E38UL))
#define bM4_INTC_VSSEL133_VSEL15                        *((volatile unsigned int*)(0x42A24E3CUL))
#define bM4_INTC_VSSEL133_VSEL16                        *((volatile unsigned int*)(0x42A24E40UL))
#define bM4_INTC_VSSEL133_VSEL17                        *((volatile unsigned int*)(0x42A24E44UL))
#define bM4_INTC_VSSEL133_VSEL18                        *((volatile unsigned int*)(0x42A24E48UL))
#define bM4_INTC_VSSEL133_VSEL19                        *((volatile unsigned int*)(0x42A24E4CUL))
#define bM4_INTC_VSSEL133_VSEL20                        *((volatile unsigned int*)(0x42A24E50UL))
#define bM4_INTC_VSSEL133_VSEL21                        *((volatile unsigned int*)(0x42A24E54UL))
#define bM4_INTC_VSSEL133_VSEL22                        *((volatile unsigned int*)(0x42A24E58UL))
#define bM4_INTC_VSSEL133_VSEL23                        *((volatile unsigned int*)(0x42A24E5CUL))
#define bM4_INTC_VSSEL133_VSEL24                        *((volatile unsigned int*)(0x42A24E60UL))
#define bM4_INTC_VSSEL133_VSEL25                        *((volatile unsigned int*)(0x42A24E64UL))
#define bM4_INTC_VSSEL133_VSEL26                        *((volatile unsigned int*)(0x42A24E68UL))
#define bM4_INTC_VSSEL133_VSEL27                        *((volatile unsigned int*)(0x42A24E6CUL))
