CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_MPU_RGD1_MPURG1SIZE3                        *((volatile unsigned int*)(0x42A0008CUL))
#define bM4_MPU_RGD1_MPURG1SIZE4                        *((volatile unsigned int*)(0x42A00090UL))
#define bM4_MPU_RGD1_MPURG1ADDR0                        *((volatile unsigned int*)(0x42A00094UL))
#define bM4_MPU_RGD1_MPURG1ADDR1                        *((volatile unsigned int*)(0x42A00098UL))
#define bM4_MPU_RGD1_MPURG1ADDR2                        *((volatile unsigned int*)(0x42A0009CUL))
#define bM4_MPU_RGD1_MPURG1ADDR3                        *((volatile unsigned int*)(0x42A000A0UL))
#define bM4_MPU_RGD1_MPURG1ADDR4                        *((volatile unsigned int*)(0x42A000A4UL))
#define bM4_MPU_RGD1_MPURG1ADDR5                        *((volatile unsigned int*)(0x42A000A8UL))
#define bM4_MPU_RGD1_MPURG1ADDR6                        *((volatile unsigned int*)(0x42A000ACUL))
#define bM4_MPU_RGD1_MPURG1ADDR7                        *((volatile unsigned int*)(0x42A000B0UL))
#define bM4_MPU_RGD1_MPURG1ADDR8                        *((volatile unsigned int*)(0x42A000B4UL))
#define bM4_MPU_RGD1_MPURG1ADDR9                        *((volatile unsigned int*)(0x42A000B8UL))
#define bM4_MPU_RGD1_MPURG1ADDR10                       *((volatile unsigned int*)(0x42A000BCUL))
#define bM4_MPU_RGD1_MPURG1ADDR11                       *((volatile unsigned int*)(0x42A000C0UL))
#define bM4_MPU_RGD1_MPURG1ADDR12                       *((volatile unsigned int*)(0x42A000C4UL))
#define bM4_MPU_RGD1_MPURG1ADDR13                       *((volatile unsigned int*)(0x42A000C8UL))
#define bM4_MPU_RGD1_MPURG1ADDR14                       *((volatile unsigned int*)(0x42A000CCUL))
#define bM4_MPU_RGD1_MPURG1ADDR15                       *((volatile unsigned int*)(0x42A000D0UL))
#define bM4_MPU_RGD1_MPURG1ADDR16                       *((volatile unsigned int*)(0x42A000D4UL))
#define bM4_MPU_RGD1_MPURG1ADDR17                       *((volatile unsigned int*)(0x42A000D8UL))
#define bM4_MPU_RGD1_MPURG1ADDR18                       *((volatile unsigned int*)(0x42A000DCUL))
#define bM4_MPU_RGD1_MPURG1ADDR19                       *((volatile unsigned int*)(0x42A000E0UL))
#define bM4_MPU_RGD1_MPURG1ADDR20                       *((volatile unsigned int*)(0x42A000E4UL))
#define bM4_MPU_RGD1_MPURG1ADDR21                       *((volatile unsigned int*)(0x42A000E8UL))
#define bM4_MPU_RGD1_MPURG1ADDR22                       *((volatile unsigned int*)(0x42A000ECUL))
#define bM4_MPU_RGD1_MPURG1ADDR23                       *((volatile unsigned int*)(0x42A000F0UL))
#define bM4_MPU_RGD1_MPURG1ADDR24                       *((volatile unsigned int*)(0x42A000F4UL))
#define bM4_MPU_RGD1_MPURG1ADDR25                       *((volatile unsigned int*)(0x42A000F8UL))
#define bM4_MPU_RGD1_MPURG1ADDR26                       *((volatile unsigned int*)(0x42A000FCUL))
#define bM4_MPU_RGD2_MPURG2SIZE0                        *((volatile unsigned int*)(0x42A00100UL))
#define bM4_MPU_RGD2_MPURG2SIZE1                        *((volatile unsigned int*)(0x42A00104UL))
#define bM4_MPU_RGD2_MPURG2SIZE2                        *((volatile unsigned int*)(0x42A00108UL))
#define bM4_MPU_RGD2_MPURG2SIZE3                        *((volatile unsigned int*)(0x42A0010CUL))
#define bM4_MPU_RGD2_MPURG2SIZE4                        *((volatile unsigned int*)(0x42A00110UL))
#define bM4_MPU_RGD2_MPURG2ADDR0                        *((volatile unsigned int*)(0x42A00114UL))
#define bM4_MPU_RGD2_MPURG2ADDR1                        *((volatile unsigned int*)(0x42A00118UL))
#define bM4_MPU_RGD2_MPURG2ADDR2                        *((volatile unsigned int*)(0x42A0011CUL))
#define bM4_MPU_RGD2_MPURG2ADDR3                        *((volatile unsigned int*)(0x42A00120UL))
#define bM4_MPU_RGD2_MPURG2ADDR4                        *((volatile unsigned int*)(0x42A00124UL))
#define bM4_MPU_RGD2_MPURG2ADDR5                        *((volatile unsigned int*)(0x42A00128UL))
#define bM4_MPU_RGD2_MPURG2ADDR6                        *((volatile unsigned int*)(0x42A0012CUL))
#define bM4_MPU_RGD2_MPURG2ADDR7                        *((volatile unsigned int*)(0x42A00130UL))
#define bM4_MPU_RGD2_MPURG2ADDR8                        *((volatile unsigned int*)(0x42A00134UL))
#define bM4_MPU_RGD2_MPURG2ADDR9                        *((volatile unsigned int*)(0x42A00138UL))
#define bM4_MPU_RGD2_MPURG2ADDR10                       *((volatile unsigned int*)(0x42A0013CUL))
#define bM4_MPU_RGD2_MPURG2ADDR11                       *((volatile unsigned int*)(0x42A00140UL))
#define bM4_MPU_RGD2_MPURG2ADDR12                       *((volatile unsigned int*)(0x42A00144UL))
#define bM4_MPU_RGD2_MPURG2ADDR13                       *((volatile unsigned int*)(0x42A00148UL))
#define bM4_MPU_RGD2_MPURG2ADDR14                       *((volatile unsigned int*)(0x42A0014CUL))
#define bM4_MPU_RGD2_MPURG2ADDR15                       *((volatile unsigned int*)(0x42A00150UL))
#define bM4_MPU_RGD2_MPURG2ADDR16                       *((volatile unsigned int*)(0x42A00154UL))
#define bM4_MPU_RGD2_MPURG2ADDR17                       *((volatile unsigned int*)(0x42A00158UL))
#define bM4_MPU_RGD2_MPURG2ADDR18                       *((volatile unsigned int*)(0x42A0015CUL))
#define bM4_MPU_RGD2_MPURG2ADDR19                       *((volatile unsigned int*)(0x42A00160UL))
#define bM4_MPU_RGD2_MPURG2ADDR20                       *((volatile unsigned int*)(0x42A00164UL))
#define bM4_MPU_RGD2_MPURG2ADDR21                       *((volatile unsigned int*)(0x42A00168UL))
#define bM4_MPU_RGD2_MPURG2ADDR22                       *((volatile unsigned int*)(0x42A0016CUL))
#define bM4_MPU_RGD2_MPURG2ADDR23                       *((volatile unsigned int*)(0x42A00170UL))
#define bM4_MPU_RGD2_MPURG2ADDR24                       *((volatile unsigned int*)(0x42A00174UL))
#define bM4_MPU_RGD2_MPURG2ADDR25                       *((volatile unsigned int*)(0x42A00178UL))
#define bM4_MPU_RGD2_MPURG2ADDR26                       *((volatile unsigned int*)(0x42A0017CUL))
#define bM4_MPU_RGD3_MPURG3SIZE0                        *((volatile unsigned int*)(0x42A00180UL))
#define bM4_MPU_RGD3_MPURG3SIZE1                        *((volatile unsigned int*)(0x42A00184UL))
#define bM4_MPU_RGD3_MPURG3SIZE2                        *((volatile unsigned int*)(0x42A00188UL))
#define bM4_MPU_RGD3_MPURG3SIZE3                        *((volatile unsigned int*)(0x42A0018CUL))
#define bM4_MPU_RGD3_MPURG3SIZE4                        *((volatile unsigned int*)(0x42A00190UL))
#define bM4_MPU_RGD3_MPURG3ADDR0                        *((volatile unsigned int*)(0x42A00194UL))
#define bM4_MPU_RGD3_MPURG3ADDR1                        *((volatile unsigned int*)(0x42A00198UL))
#define bM4_MPU_RGD3_MPURG3ADDR2                        *((volatile unsigned int*)(0x42A0019CUL))
#define bM4_MPU_RGD3_MPURG3ADDR3                        *((volatile unsigned int*)(0x42A001A0UL))
#define bM4_MPU_RGD3_MPURG3ADDR4                        *((volatile unsigned int*)(0x42A001A4UL))
#define bM4_MPU_RGD3_MPURG3ADDR5                        *((volatile unsigned int*)(0x42A001A8UL))
#define bM4_MPU_RGD3_MPURG3ADDR6                        *((volatile unsigned int*)(0x42A001ACUL))
#define bM4_MPU_RGD3_MPURG3ADDR7                        *((volatile unsigned int*)(0x42A001B0UL))
#define bM4_MPU_RGD3_MPURG3ADDR8                        *((volatile unsigned int*)(0x42A001B4UL))
#define bM4_MPU_RGD3_MPURG3ADDR9                        *((volatile unsigned int*)(0x42A001B8UL))
#define bM4_MPU_RGD3_MPURG3ADDR10                       *((volatile unsigned int*)(0x42A001BCUL))
#define bM4_MPU_RGD3_MPURG3ADDR11                       *((volatile unsigned int*)(0x42A001C0UL))
#define bM4_MPU_RGD3_MPURG3ADDR12                       *((volatile unsigned int*)(0x42A001C4UL))
#define bM4_MPU_RGD3_MPURG3ADDR13                       *((volatile unsigned int*)(0x42A001C8UL))
#define bM4_MPU_RGD3_MPURG3ADDR14                       *((volatile unsigned int*)(0x42A001CCUL))
#define bM4_MPU_RGD3_MPURG3ADDR15                       *((volatile unsigned int*)(0x42A001D0UL))
#define bM4_MPU_RGD3_MPURG3ADDR16                       *((volatile unsigned int*)(0x42A001D4UL))
#define bM4_MPU_RGD3_MPURG3ADDR17                       *((volatile unsigned int*)(0x42A001D8UL))
#define bM4_MPU_RGD3_MPURG3ADDR18                       *((volatile unsigned int*)(0x42A001DCUL))
#define bM4_MPU_RGD3_MPURG3ADDR19                       *((volatile unsigned int*)(0x42A001E0UL))
#define bM4_MPU_RGD3_MPURG3ADDR20                       *((volatile unsigned int*)(0x42A001E4UL))
#define bM4_MPU_RGD3_MPURG3ADDR21                       *((volatile unsigned int*)(0x42A001E8UL))
#define bM4_MPU_RGD3_MPURG3ADDR22                       *((volatile unsigned int*)(0x42A001ECUL))
#define bM4_MPU_RGD3_MPURG3ADDR23                       *((volatile unsigned int*)(0x42A001F0UL))
#define bM4_MPU_RGD3_MPURG3ADDR24                       *((volatile unsigned int*)(0x42A001F4UL))
#define bM4_MPU_RGD3_MPURG3ADDR25                       *((volatile unsigned int*)(0x42A001F8UL))
#define bM4_MPU_RGD3_MPURG3ADDR26                       *((volatile unsigned int*)(0x42A001FCUL))
#define bM4_MPU_RGD4_MPURG4SIZE0                        *((volatile unsigned int*)(0x42A00200UL))
#define bM4_MPU_RGD4_MPURG4SIZE1                        *((volatile unsigned int*)(0x42A00204UL))
#define bM4_MPU_RGD4_MPURG4SIZE2                        *((volatile unsigned int*)(0x42A00208UL))
#define bM4_MPU_RGD4_MPURG4SIZE3                        *((volatile unsigned int*)(0x42A0020CUL))
#define bM4_MPU_RGD4_MPURG4SIZE4                        *((volatile unsigned int*)(0x42A00210UL))
#define bM4_MPU_RGD4_MPURG4ADDR0                        *((volatile unsigned int*)(0x42A00214UL))
#define bM4_MPU_RGD4_MPURG4ADDR1                        *((volatile unsigned int*)(0x42A00218UL))
#define bM4_MPU_RGD4_MPURG4ADDR2                        *((volatile unsigned int*)(0x42A0021CUL))
#define bM4_MPU_RGD4_MPURG4ADDR3                        *((volatile unsigned int*)(0x42A00220UL))
#define bM4_MPU_RGD4_MPURG4ADDR4                        *((volatile unsigned int*)(0x42A00224UL))
#define bM4_MPU_RGD4_MPURG4ADDR5                        *((volatile unsigned int*)(0x42A00228UL))
#define bM4_MPU_RGD4_MPURG4ADDR6                        *((volatile unsigned int*)(0x42A0022CUL))
#define bM4_MPU_RGD4_MPURG4ADDR7                        *((volatile unsigned int*)(0x42A00230UL))
#define bM4_MPU_RGD4_MPURG4ADDR8                        *((volatile unsigned int*)(0x42A00234UL))
#define bM4_MPU_RGD4_MPURG4ADDR9                        *((volatile unsigned int*)(0x42A00238UL))
#define bM4_MPU_RGD4_MPURG4ADDR10                       *((volatile unsigned int*)(0x42A0023CUL))
#define bM4_MPU_RGD4_MPURG4ADDR11                       *((volatile unsigned int*)(0x42A00240UL))
#define bM4_MPU_RGD4_MPURG4ADDR12                       *((volatile unsigned int*)(0x42A00244UL))
#define bM4_MPU_RGD4_MPURG4ADDR13                       *((volatile unsigned int*)(0x42A00248UL))
#define bM4_MPU_RGD4_MPURG4ADDR14                       *((volatile unsigned int*)(0x42A0024CUL))
#define bM4_MPU_RGD4_MPURG4ADDR15                       *((volatile unsigned int*)(0x42A00250UL))
#define bM4_MPU_RGD4_MPURG4ADDR16                       *((volatile unsigned int*)(0x42A00254UL))
#define bM4_MPU_RGD4_MPURG4ADDR17                       *((volatile unsigned int*)(0x42A00258UL))
#define bM4_MPU_RGD4_MPURG4ADDR18                       *((volatile unsigned int*)(0x42A0025CUL))
#define bM4_MPU_RGD4_MPURG4ADDR19                       *((volatile unsigned int*)(0x42A00260UL))
#define bM4_MPU_RGD4_MPURG4ADDR20                       *((volatile unsigned int*)(0x42A00264UL))
#define bM4_MPU_RGD4_MPURG4ADDR21                       *((volatile unsigned int*)(0x42A00268UL))
#define bM4_MPU_RGD4_MPURG4ADDR22                       *((volatile unsigned int*)(0x42A0026CUL))
#define bM4_MPU_RGD4_MPURG4ADDR23                       *((volatile unsigned int*)(0x42A00270UL))
#define bM4_MPU_RGD4_MPURG4ADDR24                       *((volatile unsigned int*)(0x42A00274UL))
#define bM4_MPU_RGD4_MPURG4ADDR25                       *((volatile unsigned int*)(0x42A00278UL))
#define bM4_MPU_RGD4_MPURG4ADDR26                       *((volatile unsigned int*)(0x42A0027CUL))
#define bM4_MPU_RGD5_MPURG5SIZE0                        *((volatile unsigned int*)(0x42A00280UL))
#define bM4_MPU_RGD5_MPURG5SIZE1                        *((volatile unsigned int*)(0x42A00284UL))
#define bM4_MPU_RGD5_MPURG5SIZE2                        *((volatile unsigned int*)(0x42A00288UL))
#define bM4_MPU_RGD5_MPURG5SIZE3                        *((volatile unsigned int*)(0x42A0028CUL))
#define bM4_MPU_RGD5_MPURG5SIZE4                        *((volatile unsigned int*)(0x42A00290UL))
#define bM4_MPU_RGD5_MPURG5ADDR0                        *((volatile unsigned int*)(0x42A00294UL))
#define bM4_MPU_RGD5_MPURG5ADDR1                        *((volatile unsigned int*)(0x42A00298UL))
#define bM4_MPU_RGD5_MPURG5ADDR2                        *((volatile unsigned int*)(0x42A0029CUL))
#define bM4_MPU_RGD5_MPURG5ADDR3                        *((volatile unsigned int*)(0x42A002A0UL))
#define bM4_MPU_RGD5_MPURG5ADDR4                        *((volatile unsigned int*)(0x42A002A4UL))
#define bM4_MPU_RGD5_MPURG5ADDR5                        *((volatile unsigned int*)(0x42A002A8UL))
#define bM4_MPU_RGD5_MPURG5ADDR6                        *((volatile unsigned int*)(0x42A002ACUL))
#define bM4_MPU_RGD5_MPURG5ADDR7                        *((volatile unsigned int*)(0x42A002B0UL))
#define bM4_MPU_RGD5_MPURG5ADDR8                        *((volatile unsigned int*)(0x42A002B4UL))
#define bM4_MPU_RGD5_MPURG5ADDR9                        *((volatile unsigned int*)(0x42A002B8UL))
#define bM4_MPU_RGD5_MPURG5ADDR10                       *((volatile unsigned int*)(0x42A002BCUL))
#define bM4_MPU_RGD5_MPURG5ADDR11                       *((volatile unsigned int*)(0x42A002C0UL))
#define bM4_MPU_RGD5_MPURG5ADDR12                       *((volatile unsigned int*)(0x42A002C4UL))
#define bM4_MPU_RGD5_MPURG5ADDR13                       *((volatile unsigned int*)(0x42A002C8UL))
#define bM4_MPU_RGD5_MPURG5ADDR14                       *((volatile unsigned int*)(0x42A002CCUL))
#define bM4_MPU_RGD5_MPURG5ADDR15                       *((volatile unsigned int*)(0x42A002D0UL))
#define bM4_MPU_RGD5_MPURG5ADDR16                       *((volatile unsigned int*)(0x42A002D4UL))
#define bM4_MPU_RGD5_MPURG5ADDR17                       *((volatile unsigned int*)(0x42A002D8UL))
#define bM4_MPU_RGD5_MPURG5ADDR18                       *((volatile unsigned int*)(0x42A002DCUL))
#define bM4_MPU_RGD5_MPURG5ADDR19                       *((volatile unsigned int*)(0x42A002E0UL))
#define bM4_MPU_RGD5_MPURG5ADDR20                       *((volatile unsigned int*)(0x42A002E4UL))
#define bM4_MPU_RGD5_MPURG5ADDR21                       *((volatile unsigned int*)(0x42A002E8UL))
#define bM4_MPU_RGD5_MPURG5ADDR22                       *((volatile unsigned int*)(0x42A002ECUL))
#define bM4_MPU_RGD5_MPURG5ADDR23                       *((volatile unsigned int*)(0x42A002F0UL))
#define bM4_MPU_RGD5_MPURG5ADDR24                       *((volatile unsigned int*)(0x42A002F4UL))
#define bM4_MPU_RGD5_MPURG5ADDR25                       *((volatile unsigned int*)(0x42A002F8UL))
#define bM4_MPU_RGD5_MPURG5ADDR26                       *((volatile unsigned int*)(0x42A002FCUL))
#define bM4_MPU_RGD6_MPURG6SIZE0                        *((volatile unsigned int*)(0x42A00300UL))
#define bM4_MPU_RGD6_MPURG6SIZE1                        *((volatile unsigned int*)(0x42A00304UL))
#define bM4_MPU_RGD6_MPURG6SIZE2                        *((volatile unsigned int*)(0x42A00308UL))
#define bM4_MPU_RGD6_MPURG6SIZE3                        *((volatile unsigned int*)(0x42A0030CUL))
#define bM4_MPU_RGD6_MPURG6SIZE4                        *((volatile unsigned int*)(0x42A00310UL))
#define bM4_MPU_RGD6_MPURG6ADDR0                        *((volatile unsigned int*)(0x42A00314UL))
#define bM4_MPU_RGD6_MPURG6ADDR1                        *((volatile unsigned int*)(0x42A00318UL))
#define bM4_MPU_RGD6_MPURG6ADDR2                        *((volatile unsigned int*)(0x42A0031CUL))
#define bM4_MPU_RGD6_MPURG6ADDR3                        *((volatile unsigned int*)(0x42A00320UL))
#define bM4_MPU_RGD6_MPURG6ADDR4                        *((volatile unsigned int*)(0x42A00324UL))
#define bM4_MPU_RGD6_MPURG6ADDR5                        *((volatile unsigned int*)(0x42A00328UL))
#define bM4_MPU_RGD6_MPURG6ADDR6                        *((volatile unsigned int*)(0x42A0032CUL))
#define bM4_MPU_RGD6_MPURG6ADDR7                        *((volatile unsigned int*)(0x42A00330UL))
#define bM4_MPU_RGD6_MPURG6ADDR8                        *((volatile unsigned int*)(0x42A00334UL))
#define bM4_MPU_RGD6_MPURG6ADDR9                        *((volatile unsigned int*)(0x42A00338UL))
#define bM4_MPU_RGD6_MPURG6ADDR10                       *((volatile unsigned int*)(0x42A0033CUL))
#define bM4_MPU_RGD6_MPURG6ADDR11                       *((volatile unsigned int*)(0x42A00340UL))
#define bM4_MPU_RGD6_MPURG6ADDR12                       *((volatile unsigned int*)(0x42A00344UL))
#define bM4_MPU_RGD6_MPURG6ADDR13                       *((volatile unsigned int*)(0x42A00348UL))
#define bM4_MPU_RGD6_MPURG6ADDR14                       *((volatile unsigned int*)(0x42A0034CUL))
#define bM4_MPU_RGD6_MPURG6ADDR15                       *((volatile unsigned int*)(0x42A00350UL))
#define bM4_MPU_RGD6_MPURG6ADDR16                       *((volatile unsigned int*)(0x42A00354UL))
#define bM4_MPU_RGD6_MPURG6ADDR17                       *((volatile unsigned int*)(0x42A00358UL))
#define bM4_MPU_RGD6_MPURG6ADDR18                       *((volatile unsigned int*)(0x42A0035CUL))
#define bM4_MPU_RGD6_MPURG6ADDR19                       *((volatile unsigned int*)(0x42A00360UL))
#define bM4_MPU_RGD6_MPURG6ADDR20                       *((volatile unsigned int*)(0x42A00364UL))
#define bM4_MPU_RGD6_MPURG6ADDR21                       *((volatile unsigned int*)(0x42A00368UL))
#define bM4_MPU_RGD6_MPURG6ADDR22                       *((volatile unsigned int*)(0x42A0036CUL))
#define bM4_MPU_RGD6_MPURG6ADDR23                       *((volatile unsigned int*)(0x42A00370UL))
#define bM4_MPU_RGD6_MPURG6ADDR24                       *((volatile unsigned int*)(0x42A00374UL))
#define bM4_MPU_RGD6_MPURG6ADDR25                       *((volatile unsigned int*)(0x42A00378UL))
#define bM4_MPU_RGD6_MPURG6ADDR26                       *((volatile unsigned int*)(0x42A0037CUL))
#define bM4_MPU_RGD7_MPURG7SIZE0                        *((volatile unsigned int*)(0x42A00380UL))
#define bM4_MPU_RGD7_MPURG7SIZE1                        *((volatile unsigned int*)(0x42A00384UL))
#define bM4_MPU_RGD7_MPURG7SIZE2                        *((volatile unsigned int*)(0x42A00388UL))
#define bM4_MPU_RGD7_MPURG7SIZE3                        *((volatile unsigned int*)(0x42A0038CUL))
#define bM4_MPU_RGD7_MPURG7SIZE4                        *((volatile unsigned int*)(0x42A00390UL))
#define bM4_MPU_RGD7_MPURG7ADDR0                        *((volatile unsigned int*)(0x42A00394UL))
#define bM4_MPU_RGD7_MPURG7ADDR1                        *((volatile unsigned int*)(0x42A00398UL))
#define bM4_MPU_RGD7_MPURG7ADDR2                        *((volatile unsigned int*)(0x42A0039CUL))
#define bM4_MPU_RGD7_MPURG7ADDR3                        *((volatile unsigned int*)(0x42A003A0UL))
#define bM4_MPU_RGD7_MPURG7ADDR4                        *((volatile unsigned int*)(0x42A003A4UL))
#define bM4_MPU_RGD7_MPURG7ADDR5                        *((volatile unsigned int*)(0x42A003A8UL))
#define bM4_MPU_RGD7_MPURG7ADDR6                        *((volatile unsigned int*)(0x42A003ACUL))
#define bM4_MPU_RGD7_MPURG7ADDR7                        *((volatile unsigned int*)(0x42A003B0UL))
#define bM4_MPU_RGD7_MPURG7ADDR8                        *((volatile unsigned int*)(0x42A003B4UL))
#define bM4_MPU_RGD7_MPURG7ADDR9                        *((volatile unsigned int*)(0x42A003B8UL))
#define bM4_MPU_RGD7_MPURG7ADDR10                       *((volatile unsigned int*)(0x42A003BCUL))
#define bM4_MPU_RGD7_MPURG7ADDR11                       *((volatile unsigned int*)(0x42A003C0UL))
#define bM4_MPU_RGD7_MPURG7ADDR12                       *((volatile unsigned int*)(0x42A003C4UL))
#define bM4_MPU_RGD7_MPURG7ADDR13                       *((volatile unsigned int*)(0x42A003C8UL))
#define bM4_MPU_RGD7_MPURG7ADDR14                       *((volatile unsigned int*)(0x42A003CCUL))
#define bM4_MPU_RGD7_MPURG7ADDR15                       *((volatile unsigned int*)(0x42A003D0UL))
#define bM4_MPU_RGD7_MPURG7ADDR16                       *((volatile unsigned int*)(0x42A003D4UL))
#define bM4_MPU_RGD7_MPURG7ADDR17                       *((volatile unsigned int*)(0x42A003D8UL))
#define bM4_MPU_RGD7_MPURG7ADDR18                       *((volatile unsigned int*)(0x42A003DCUL))
#define bM4_MPU_RGD7_MPURG7ADDR19                       *((volatile unsigned int*)(0x42A003E0UL))
#define bM4_MPU_RGD7_MPURG7ADDR20                       *((volatile unsigned int*)(0x42A003E4UL))
#define bM4_MPU_RGD7_MPURG7ADDR21                       *((volatile unsigned int*)(0x42A003E8UL))
#define bM4_MPU_RGD7_MPURG7ADDR22                       *((volatile unsigned int*)(0x42A003ECUL))
#define bM4_MPU_RGD7_MPURG7ADDR23                       *((volatile unsigned int*)(0x42A003F0UL))
#define bM4_MPU_RGD7_MPURG7ADDR24                       *((volatile unsigned int*)(0x42A003F4UL))
#define bM4_MPU_RGD7_MPURG7ADDR25                       *((volatile unsigned int*)(0x42A003F8UL))
#define bM4_MPU_RGD7_MPURG7ADDR26                       *((volatile unsigned int*)(0x42A003FCUL))
#define bM4_MPU_RGD8_MPURG8SIZE0                        *((volatile unsigned int*)(0x42A00400UL))
#define bM4_MPU_RGD8_MPURG8SIZE1                        *((volatile unsigned int*)(0x42A00404UL))
#define bM4_MPU_RGD8_MPURG8SIZE2                        *((volatile unsigned int*)(0x42A00408UL))
#define bM4_MPU_RGD8_MPURG8SIZE3                        *((volatile unsigned int*)(0x42A0040CUL))
#define bM4_MPU_RGD8_MPURG8SIZE4                        *((volatile unsigned int*)(0x42A00410UL))
#define bM4_MPU_RGD8_MPURG8ADDR0                        *((volatile unsigned int*)(0x42A00414UL))
#define bM4_MPU_RGD8_MPURG8ADDR1                        *((volatile unsigned int*)(0x42A00418UL))
#define bM4_MPU_RGD8_MPURG8ADDR2                        *((volatile unsigned int*)(0x42A0041CUL))
#define bM4_MPU_RGD8_MPURG8ADDR3                        *((volatile unsigned int*)(0x42A00420UL))
#define bM4_MPU_RGD8_MPURG8ADDR4                        *((volatile unsigned int*)(0x42A00424UL))
#define bM4_MPU_RGD8_MPURG8ADDR5                        *((volatile unsigned int*)(0x42A00428UL))
#define bM4_MPU_RGD8_MPURG8ADDR6                        *((volatile unsigned int*)(0x42A0042CUL))
#define bM4_MPU_RGD8_MPURG8ADDR7                        *((volatile unsigned int*)(0x42A00430UL))
#define bM4_MPU_RGD8_MPURG8ADDR8                        *((volatile unsigned int*)(0x42A00434UL))
#define bM4_MPU_RGD8_MPURG8ADDR9                        *((volatile unsigned int*)(0x42A00438UL))
#define bM4_MPU_RGD8_MPURG8ADDR10                       *((volatile unsigned int*)(0x42A0043CUL))
#define bM4_MPU_RGD8_MPURG8ADDR11                       *((volatile unsigned int*)(0x42A00440UL))
#define bM4_MPU_RGD8_MPURG8ADDR12                       *((volatile unsigned int*)(0x42A00444UL))
#define bM4_MPU_RGD8_MPURG8ADDR13                       *((volatile unsigned int*)(0x42A00448UL))
#define bM4_MPU_RGD8_MPURG8ADDR14                       *((volatile unsigned int*)(0x42A0044CUL))
#define bM4_MPU_RGD8_MPURG8ADDR15                       *((volatile unsigned int*)(0x42A00450UL))
#define bM4_MPU_RGD8_MPURG8ADDR16                       *((volatile unsigned int*)(0x42A00454UL))
#define bM4_MPU_RGD8_MPURG8ADDR17                       *((volatile unsigned int*)(0x42A00458UL))
