CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_MPU_RGD8_MPURG8ADDR18                       *((volatile unsigned int*)(0x42A0045CUL))
#define bM4_MPU_RGD8_MPURG8ADDR19                       *((volatile unsigned int*)(0x42A00460UL))
#define bM4_MPU_RGD8_MPURG8ADDR20                       *((volatile unsigned int*)(0x42A00464UL))
#define bM4_MPU_RGD8_MPURG8ADDR21                       *((volatile unsigned int*)(0x42A00468UL))
#define bM4_MPU_RGD8_MPURG8ADDR22                       *((volatile unsigned int*)(0x42A0046CUL))
#define bM4_MPU_RGD8_MPURG8ADDR23                       *((volatile unsigned int*)(0x42A00470UL))
#define bM4_MPU_RGD8_MPURG8ADDR24                       *((volatile unsigned int*)(0x42A00474UL))
#define bM4_MPU_RGD8_MPURG8ADDR25                       *((volatile unsigned int*)(0x42A00478UL))
#define bM4_MPU_RGD8_MPURG8ADDR26                       *((volatile unsigned int*)(0x42A0047CUL))
#define bM4_MPU_RGD9_MPURG9SIZE0                        *((volatile unsigned int*)(0x42A00480UL))
#define bM4_MPU_RGD9_MPURG9SIZE1                        *((volatile unsigned int*)(0x42A00484UL))
#define bM4_MPU_RGD9_MPURG9SIZE2                        *((volatile unsigned int*)(0x42A00488UL))
#define bM4_MPU_RGD9_MPURG9SIZE3                        *((volatile unsigned int*)(0x42A0048CUL))
#define bM4_MPU_RGD9_MPURG9SIZE4                        *((volatile unsigned int*)(0x42A00490UL))
#define bM4_MPU_RGD9_MPURG9ADDR0                        *((volatile unsigned int*)(0x42A00494UL))
#define bM4_MPU_RGD9_MPURG9ADDR1                        *((volatile unsigned int*)(0x42A00498UL))
#define bM4_MPU_RGD9_MPURG9ADDR2                        *((volatile unsigned int*)(0x42A0049CUL))
#define bM4_MPU_RGD9_MPURG9ADDR3                        *((volatile unsigned int*)(0x42A004A0UL))
#define bM4_MPU_RGD9_MPURG9ADDR4                        *((volatile unsigned int*)(0x42A004A4UL))
#define bM4_MPU_RGD9_MPURG9ADDR5                        *((volatile unsigned int*)(0x42A004A8UL))
#define bM4_MPU_RGD9_MPURG9ADDR6                        *((volatile unsigned int*)(0x42A004ACUL))
#define bM4_MPU_RGD9_MPURG9ADDR7                        *((volatile unsigned int*)(0x42A004B0UL))
#define bM4_MPU_RGD9_MPURG9ADDR8                        *((volatile unsigned int*)(0x42A004B4UL))
#define bM4_MPU_RGD9_MPURG9ADDR9                        *((volatile unsigned int*)(0x42A004B8UL))
#define bM4_MPU_RGD9_MPURG9ADDR10                       *((volatile unsigned int*)(0x42A004BCUL))
#define bM4_MPU_RGD9_MPURG9ADDR11                       *((volatile unsigned int*)(0x42A004C0UL))
#define bM4_MPU_RGD9_MPURG9ADDR12                       *((volatile unsigned int*)(0x42A004C4UL))
#define bM4_MPU_RGD9_MPURG9ADDR13                       *((volatile unsigned int*)(0x42A004C8UL))
#define bM4_MPU_RGD9_MPURG9ADDR14                       *((volatile unsigned int*)(0x42A004CCUL))
#define bM4_MPU_RGD9_MPURG9ADDR15                       *((volatile unsigned int*)(0x42A004D0UL))
#define bM4_MPU_RGD9_MPURG9ADDR16                       *((volatile unsigned int*)(0x42A004D4UL))
#define bM4_MPU_RGD9_MPURG9ADDR17                       *((volatile unsigned int*)(0x42A004D8UL))
#define bM4_MPU_RGD9_MPURG9ADDR18                       *((volatile unsigned int*)(0x42A004DCUL))
#define bM4_MPU_RGD9_MPURG9ADDR19                       *((volatile unsigned int*)(0x42A004E0UL))
#define bM4_MPU_RGD9_MPURG9ADDR20                       *((volatile unsigned int*)(0x42A004E4UL))
#define bM4_MPU_RGD9_MPURG9ADDR21                       *((volatile unsigned int*)(0x42A004E8UL))
#define bM4_MPU_RGD9_MPURG9ADDR22                       *((volatile unsigned int*)(0x42A004ECUL))
#define bM4_MPU_RGD9_MPURG9ADDR23                       *((volatile unsigned int*)(0x42A004F0UL))
#define bM4_MPU_RGD9_MPURG9ADDR24                       *((volatile unsigned int*)(0x42A004F4UL))
#define bM4_MPU_RGD9_MPURG9ADDR25                       *((volatile unsigned int*)(0x42A004F8UL))
#define bM4_MPU_RGD9_MPURG9ADDR26                       *((volatile unsigned int*)(0x42A004FCUL))
#define bM4_MPU_RGD10_MPURG10SIZE0                      *((volatile unsigned int*)(0x42A00500UL))
#define bM4_MPU_RGD10_MPURG10SIZE1                      *((volatile unsigned int*)(0x42A00504UL))
#define bM4_MPU_RGD10_MPURG10SIZE2                      *((volatile unsigned int*)(0x42A00508UL))
#define bM4_MPU_RGD10_MPURG10SIZE3                      *((volatile unsigned int*)(0x42A0050CUL))
#define bM4_MPU_RGD10_MPURG10SIZE4                      *((volatile unsigned int*)(0x42A00510UL))
#define bM4_MPU_RGD10_MPURG10ADDR0                      *((volatile unsigned int*)(0x42A00514UL))
#define bM4_MPU_RGD10_MPURG10ADDR1                      *((volatile unsigned int*)(0x42A00518UL))
#define bM4_MPU_RGD10_MPURG10ADDR2                      *((volatile unsigned int*)(0x42A0051CUL))
#define bM4_MPU_RGD10_MPURG10ADDR3                      *((volatile unsigned int*)(0x42A00520UL))
#define bM4_MPU_RGD10_MPURG10ADDR4                      *((volatile unsigned int*)(0x42A00524UL))
#define bM4_MPU_RGD10_MPURG10ADDR5                      *((volatile unsigned int*)(0x42A00528UL))
#define bM4_MPU_RGD10_MPURG10ADDR6                      *((volatile unsigned int*)(0x42A0052CUL))
#define bM4_MPU_RGD10_MPURG10ADDR7                      *((volatile unsigned int*)(0x42A00530UL))
#define bM4_MPU_RGD10_MPURG10ADDR8                      *((volatile unsigned int*)(0x42A00534UL))
#define bM4_MPU_RGD10_MPURG10ADDR9                      *((volatile unsigned int*)(0x42A00538UL))
#define bM4_MPU_RGD10_MPURG10ADDR10                     *((volatile unsigned int*)(0x42A0053CUL))
#define bM4_MPU_RGD10_MPURG10ADDR11                     *((volatile unsigned int*)(0x42A00540UL))
#define bM4_MPU_RGD10_MPURG10ADDR12                     *((volatile unsigned int*)(0x42A00544UL))
#define bM4_MPU_RGD10_MPURG10ADDR13                     *((volatile unsigned int*)(0x42A00548UL))
#define bM4_MPU_RGD10_MPURG10ADDR14                     *((volatile unsigned int*)(0x42A0054CUL))
#define bM4_MPU_RGD10_MPURG10ADDR15                     *((volatile unsigned int*)(0x42A00550UL))
#define bM4_MPU_RGD10_MPURG10ADDR16                     *((volatile unsigned int*)(0x42A00554UL))
#define bM4_MPU_RGD10_MPURG10ADDR17                     *((volatile unsigned int*)(0x42A00558UL))
#define bM4_MPU_RGD10_MPURG10ADDR18                     *((volatile unsigned int*)(0x42A0055CUL))
#define bM4_MPU_RGD10_MPURG10ADDR19                     *((volatile unsigned int*)(0x42A00560UL))
#define bM4_MPU_RGD10_MPURG10ADDR20                     *((volatile unsigned int*)(0x42A00564UL))
#define bM4_MPU_RGD10_MPURG10ADDR21                     *((volatile unsigned int*)(0x42A00568UL))
#define bM4_MPU_RGD10_MPURG10ADDR22                     *((volatile unsigned int*)(0x42A0056CUL))
#define bM4_MPU_RGD10_MPURG10ADDR23                     *((volatile unsigned int*)(0x42A00570UL))
#define bM4_MPU_RGD10_MPURG10ADDR24                     *((volatile unsigned int*)(0x42A00574UL))
#define bM4_MPU_RGD10_MPURG10ADDR25                     *((volatile unsigned int*)(0x42A00578UL))
#define bM4_MPU_RGD10_MPURG10ADDR26                     *((volatile unsigned int*)(0x42A0057CUL))
#define bM4_MPU_RGD11_MPURG11SIZE0                      *((volatile unsigned int*)(0x42A00580UL))
#define bM4_MPU_RGD11_MPURG11SIZE1                      *((volatile unsigned int*)(0x42A00584UL))
#define bM4_MPU_RGD11_MPURG11SIZE2                      *((volatile unsigned int*)(0x42A00588UL))
#define bM4_MPU_RGD11_MPURG11SIZE3                      *((volatile unsigned int*)(0x42A0058CUL))
#define bM4_MPU_RGD11_MPURG11SIZE4                      *((volatile unsigned int*)(0x42A00590UL))
#define bM4_MPU_RGD11_MPURG11ADDR0                      *((volatile unsigned int*)(0x42A00594UL))
#define bM4_MPU_RGD11_MPURG11ADDR1                      *((volatile unsigned int*)(0x42A00598UL))
#define bM4_MPU_RGD11_MPURG11ADDR2                      *((volatile unsigned int*)(0x42A0059CUL))
#define bM4_MPU_RGD11_MPURG11ADDR3                      *((volatile unsigned int*)(0x42A005A0UL))
#define bM4_MPU_RGD11_MPURG11ADDR4                      *((volatile unsigned int*)(0x42A005A4UL))
#define bM4_MPU_RGD11_MPURG11ADDR5                      *((volatile unsigned int*)(0x42A005A8UL))
#define bM4_MPU_RGD11_MPURG11ADDR6                      *((volatile unsigned int*)(0x42A005ACUL))
#define bM4_MPU_RGD11_MPURG11ADDR7                      *((volatile unsigned int*)(0x42A005B0UL))
#define bM4_MPU_RGD11_MPURG11ADDR8                      *((volatile unsigned int*)(0x42A005B4UL))
#define bM4_MPU_RGD11_MPURG11ADDR9                      *((volatile unsigned int*)(0x42A005B8UL))
#define bM4_MPU_RGD11_MPURG11ADDR10                     *((volatile unsigned int*)(0x42A005BCUL))
#define bM4_MPU_RGD11_MPURG11ADDR11                     *((volatile unsigned int*)(0x42A005C0UL))
#define bM4_MPU_RGD11_MPURG11ADDR12                     *((volatile unsigned int*)(0x42A005C4UL))
#define bM4_MPU_RGD11_MPURG11ADDR13                     *((volatile unsigned int*)(0x42A005C8UL))
#define bM4_MPU_RGD11_MPURG11ADDR14                     *((volatile unsigned int*)(0x42A005CCUL))
#define bM4_MPU_RGD11_MPURG11ADDR15                     *((volatile unsigned int*)(0x42A005D0UL))
#define bM4_MPU_RGD11_MPURG11ADDR16                     *((volatile unsigned int*)(0x42A005D4UL))
#define bM4_MPU_RGD11_MPURG11ADDR17                     *((volatile unsigned int*)(0x42A005D8UL))
#define bM4_MPU_RGD11_MPURG11ADDR18                     *((volatile unsigned int*)(0x42A005DCUL))
#define bM4_MPU_RGD11_MPURG11ADDR19                     *((volatile unsigned int*)(0x42A005E0UL))
#define bM4_MPU_RGD11_MPURG11ADDR20                     *((volatile unsigned int*)(0x42A005E4UL))
#define bM4_MPU_RGD11_MPURG11ADDR21                     *((volatile unsigned int*)(0x42A005E8UL))
#define bM4_MPU_RGD11_MPURG11ADDR22                     *((volatile unsigned int*)(0x42A005ECUL))
#define bM4_MPU_RGD11_MPURG11ADDR23                     *((volatile unsigned int*)(0x42A005F0UL))
#define bM4_MPU_RGD11_MPURG11ADDR24                     *((volatile unsigned int*)(0x42A005F4UL))
#define bM4_MPU_RGD11_MPURG11ADDR25                     *((volatile unsigned int*)(0x42A005F8UL))
#define bM4_MPU_RGD11_MPURG11ADDR26                     *((volatile unsigned int*)(0x42A005FCUL))
#define bM4_MPU_RGD12_MPURG12SIZE0                      *((volatile unsigned int*)(0x42A00600UL))
#define bM4_MPU_RGD12_MPURG12SIZE1                      *((volatile unsigned int*)(0x42A00604UL))
#define bM4_MPU_RGD12_MPURG12SIZE2                      *((volatile unsigned int*)(0x42A00608UL))
#define bM4_MPU_RGD12_MPURG12SIZE3                      *((volatile unsigned int*)(0x42A0060CUL))
#define bM4_MPU_RGD12_MPURG12SIZE4                      *((volatile unsigned int*)(0x42A00610UL))
#define bM4_MPU_RGD12_MPURG12ADDR0                      *((volatile unsigned int*)(0x42A00614UL))
#define bM4_MPU_RGD12_MPURG12ADDR1                      *((volatile unsigned int*)(0x42A00618UL))
#define bM4_MPU_RGD12_MPURG12ADDR2                      *((volatile unsigned int*)(0x42A0061CUL))
#define bM4_MPU_RGD12_MPURG12ADDR3                      *((volatile unsigned int*)(0x42A00620UL))
#define bM4_MPU_RGD12_MPURG12ADDR4                      *((volatile unsigned int*)(0x42A00624UL))
#define bM4_MPU_RGD12_MPURG12ADDR5                      *((volatile unsigned int*)(0x42A00628UL))
#define bM4_MPU_RGD12_MPURG12ADDR6                      *((volatile unsigned int*)(0x42A0062CUL))
#define bM4_MPU_RGD12_MPURG12ADDR7                      *((volatile unsigned int*)(0x42A00630UL))
#define bM4_MPU_RGD12_MPURG12ADDR8                      *((volatile unsigned int*)(0x42A00634UL))
#define bM4_MPU_RGD12_MPURG12ADDR9                      *((volatile unsigned int*)(0x42A00638UL))
#define bM4_MPU_RGD12_MPURG12ADDR10                     *((volatile unsigned int*)(0x42A0063CUL))
#define bM4_MPU_RGD12_MPURG12ADDR11                     *((volatile unsigned int*)(0x42A00640UL))
#define bM4_MPU_RGD12_MPURG12ADDR12                     *((volatile unsigned int*)(0x42A00644UL))
#define bM4_MPU_RGD12_MPURG12ADDR13                     *((volatile unsigned int*)(0x42A00648UL))
#define bM4_MPU_RGD12_MPURG12ADDR14                     *((volatile unsigned int*)(0x42A0064CUL))
#define bM4_MPU_RGD12_MPURG12ADDR15                     *((volatile unsigned int*)(0x42A00650UL))
#define bM4_MPU_RGD12_MPURG12ADDR16                     *((volatile unsigned int*)(0x42A00654UL))
#define bM4_MPU_RGD12_MPURG12ADDR17                     *((volatile unsigned int*)(0x42A00658UL))
#define bM4_MPU_RGD12_MPURG12ADDR18                     *((volatile unsigned int*)(0x42A0065CUL))
#define bM4_MPU_RGD12_MPURG12ADDR19                     *((volatile unsigned int*)(0x42A00660UL))
#define bM4_MPU_RGD12_MPURG12ADDR20                     *((volatile unsigned int*)(0x42A00664UL))
#define bM4_MPU_RGD12_MPURG12ADDR21                     *((volatile unsigned int*)(0x42A00668UL))
#define bM4_MPU_RGD12_MPURG12ADDR22                     *((volatile unsigned int*)(0x42A0066CUL))
#define bM4_MPU_RGD12_MPURG12ADDR23                     *((volatile unsigned int*)(0x42A00670UL))
#define bM4_MPU_RGD12_MPURG12ADDR24                     *((volatile unsigned int*)(0x42A00674UL))
#define bM4_MPU_RGD12_MPURG12ADDR25                     *((volatile unsigned int*)(0x42A00678UL))
#define bM4_MPU_RGD12_MPURG12ADDR26                     *((volatile unsigned int*)(0x42A0067CUL))
#define bM4_MPU_RGD13_MPURG13SIZE0                      *((volatile unsigned int*)(0x42A00680UL))
#define bM4_MPU_RGD13_MPURG13SIZE1                      *((volatile unsigned int*)(0x42A00684UL))
#define bM4_MPU_RGD13_MPURG13SIZE2                      *((volatile unsigned int*)(0x42A00688UL))
#define bM4_MPU_RGD13_MPURG13SIZE3                      *((volatile unsigned int*)(0x42A0068CUL))
#define bM4_MPU_RGD13_MPURG13SIZE4                      *((volatile unsigned int*)(0x42A00690UL))
#define bM4_MPU_RGD13_MPURG13ADDR0                      *((volatile unsigned int*)(0x42A00694UL))
#define bM4_MPU_RGD13_MPURG13ADDR1                      *((volatile unsigned int*)(0x42A00698UL))
#define bM4_MPU_RGD13_MPURG13ADDR2                      *((volatile unsigned int*)(0x42A0069CUL))
#define bM4_MPU_RGD13_MPURG13ADDR3                      *((volatile unsigned int*)(0x42A006A0UL))
#define bM4_MPU_RGD13_MPURG13ADDR4                      *((volatile unsigned int*)(0x42A006A4UL))
#define bM4_MPU_RGD13_MPURG13ADDR5                      *((volatile unsigned int*)(0x42A006A8UL))
#define bM4_MPU_RGD13_MPURG13ADDR6                      *((volatile unsigned int*)(0x42A006ACUL))
#define bM4_MPU_RGD13_MPURG13ADDR7                      *((volatile unsigned int*)(0x42A006B0UL))
#define bM4_MPU_RGD13_MPURG13ADDR8                      *((volatile unsigned int*)(0x42A006B4UL))
#define bM4_MPU_RGD13_MPURG13ADDR9                      *((volatile unsigned int*)(0x42A006B8UL))
#define bM4_MPU_RGD13_MPURG13ADDR10                     *((volatile unsigned int*)(0x42A006BCUL))
#define bM4_MPU_RGD13_MPURG13ADDR11                     *((volatile unsigned int*)(0x42A006C0UL))
#define bM4_MPU_RGD13_MPURG13ADDR12                     *((volatile unsigned int*)(0x42A006C4UL))
#define bM4_MPU_RGD13_MPURG13ADDR13                     *((volatile unsigned int*)(0x42A006C8UL))
#define bM4_MPU_RGD13_MPURG13ADDR14                     *((volatile unsigned int*)(0x42A006CCUL))
#define bM4_MPU_RGD13_MPURG13ADDR15                     *((volatile unsigned int*)(0x42A006D0UL))
#define bM4_MPU_RGD13_MPURG13ADDR16                     *((volatile unsigned int*)(0x42A006D4UL))
#define bM4_MPU_RGD13_MPURG13ADDR17                     *((volatile unsigned int*)(0x42A006D8UL))
#define bM4_MPU_RGD13_MPURG13ADDR18                     *((volatile unsigned int*)(0x42A006DCUL))
#define bM4_MPU_RGD13_MPURG13ADDR19                     *((volatile unsigned int*)(0x42A006E0UL))
#define bM4_MPU_RGD13_MPURG13ADDR20                     *((volatile unsigned int*)(0x42A006E4UL))
#define bM4_MPU_RGD13_MPURG13ADDR21                     *((volatile unsigned int*)(0x42A006E8UL))
#define bM4_MPU_RGD13_MPURG13ADDR22                     *((volatile unsigned int*)(0x42A006ECUL))
#define bM4_MPU_RGD13_MPURG13ADDR23                     *((volatile unsigned int*)(0x42A006F0UL))
#define bM4_MPU_RGD13_MPURG13ADDR24                     *((volatile unsigned int*)(0x42A006F4UL))
#define bM4_MPU_RGD13_MPURG13ADDR25                     *((volatile unsigned int*)(0x42A006F8UL))
#define bM4_MPU_RGD13_MPURG13ADDR26                     *((volatile unsigned int*)(0x42A006FCUL))
#define bM4_MPU_RGD14_MPURG14SIZE0                      *((volatile unsigned int*)(0x42A00700UL))
#define bM4_MPU_RGD14_MPURG14SIZE1                      *((volatile unsigned int*)(0x42A00704UL))
#define bM4_MPU_RGD14_MPURG14SIZE2                      *((volatile unsigned int*)(0x42A00708UL))
#define bM4_MPU_RGD14_MPURG14SIZE3                      *((volatile unsigned int*)(0x42A0070CUL))
#define bM4_MPU_RGD14_MPURG14SIZE4                      *((volatile unsigned int*)(0x42A00710UL))
#define bM4_MPU_RGD14_MPURG14ADDR0                      *((volatile unsigned int*)(0x42A00714UL))
#define bM4_MPU_RGD14_MPURG14ADDR1                      *((volatile unsigned int*)(0x42A00718UL))
#define bM4_MPU_RGD14_MPURG14ADDR2                      *((volatile unsigned int*)(0x42A0071CUL))
#define bM4_MPU_RGD14_MPURG14ADDR3                      *((volatile unsigned int*)(0x42A00720UL))
#define bM4_MPU_RGD14_MPURG14ADDR4                      *((volatile unsigned int*)(0x42A00724UL))
#define bM4_MPU_RGD14_MPURG14ADDR5                      *((volatile unsigned int*)(0x42A00728UL))
#define bM4_MPU_RGD14_MPURG14ADDR6                      *((volatile unsigned int*)(0x42A0072CUL))
#define bM4_MPU_RGD14_MPURG14ADDR7                      *((volatile unsigned int*)(0x42A00730UL))
#define bM4_MPU_RGD14_MPURG14ADDR8                      *((volatile unsigned int*)(0x42A00734UL))
#define bM4_MPU_RGD14_MPURG14ADDR9                      *((volatile unsigned int*)(0x42A00738UL))
#define bM4_MPU_RGD14_MPURG14ADDR10                     *((volatile unsigned int*)(0x42A0073CUL))
#define bM4_MPU_RGD14_MPURG14ADDR11                     *((volatile unsigned int*)(0x42A00740UL))
#define bM4_MPU_RGD14_MPURG14ADDR12                     *((volatile unsigned int*)(0x42A00744UL))
#define bM4_MPU_RGD14_MPURG14ADDR13                     *((volatile unsigned int*)(0x42A00748UL))
#define bM4_MPU_RGD14_MPURG14ADDR14                     *((volatile unsigned int*)(0x42A0074CUL))
#define bM4_MPU_RGD14_MPURG14ADDR15                     *((volatile unsigned int*)(0x42A00750UL))
#define bM4_MPU_RGD14_MPURG14ADDR16                     *((volatile unsigned int*)(0x42A00754UL))
#define bM4_MPU_RGD14_MPURG14ADDR17                     *((volatile unsigned int*)(0x42A00758UL))
#define bM4_MPU_RGD14_MPURG14ADDR18                     *((volatile unsigned int*)(0x42A0075CUL))
#define bM4_MPU_RGD14_MPURG14ADDR19                     *((volatile unsigned int*)(0x42A00760UL))
#define bM4_MPU_RGD14_MPURG14ADDR20                     *((volatile unsigned int*)(0x42A00764UL))
#define bM4_MPU_RGD14_MPURG14ADDR21                     *((volatile unsigned int*)(0x42A00768UL))
#define bM4_MPU_RGD14_MPURG14ADDR22                     *((volatile unsigned int*)(0x42A0076CUL))
#define bM4_MPU_RGD14_MPURG14ADDR23                     *((volatile unsigned int*)(0x42A00770UL))
#define bM4_MPU_RGD14_MPURG14ADDR24                     *((volatile unsigned int*)(0x42A00774UL))
#define bM4_MPU_RGD14_MPURG14ADDR25                     *((volatile unsigned int*)(0x42A00778UL))
#define bM4_MPU_RGD14_MPURG14ADDR26                     *((volatile unsigned int*)(0x42A0077CUL))
#define bM4_MPU_RGD15_MPURG15SIZE0                      *((volatile unsigned int*)(0x42A00780UL))
#define bM4_MPU_RGD15_MPURG15SIZE1                      *((volatile unsigned int*)(0x42A00784UL))
#define bM4_MPU_RGD15_MPURG15SIZE2                      *((volatile unsigned int*)(0x42A00788UL))
#define bM4_MPU_RGD15_MPURG15SIZE3                      *((volatile unsigned int*)(0x42A0078CUL))
#define bM4_MPU_RGD15_MPURG15SIZE4                      *((volatile unsigned int*)(0x42A00790UL))
#define bM4_MPU_RGD15_MPURG15ADDR0                      *((volatile unsigned int*)(0x42A00794UL))
#define bM4_MPU_RGD15_MPURG15ADDR1                      *((volatile unsigned int*)(0x42A00798UL))
#define bM4_MPU_RGD15_MPURG15ADDR2                      *((volatile unsigned int*)(0x42A0079CUL))
#define bM4_MPU_RGD15_MPURG15ADDR3                      *((volatile unsigned int*)(0x42A007A0UL))
#define bM4_MPU_RGD15_MPURG15ADDR4                      *((volatile unsigned int*)(0x42A007A4UL))
#define bM4_MPU_RGD15_MPURG15ADDR5                      *((volatile unsigned int*)(0x42A007A8UL))
#define bM4_MPU_RGD15_MPURG15ADDR6                      *((volatile unsigned int*)(0x42A007ACUL))
#define bM4_MPU_RGD15_MPURG15ADDR7                      *((volatile unsigned int*)(0x42A007B0UL))
#define bM4_MPU_RGD15_MPURG15ADDR8                      *((volatile unsigned int*)(0x42A007B4UL))
#define bM4_MPU_RGD15_MPURG15ADDR9                      *((volatile unsigned int*)(0x42A007B8UL))
#define bM4_MPU_RGD15_MPURG15ADDR10                     *((volatile unsigned int*)(0x42A007BCUL))
#define bM4_MPU_RGD15_MPURG15ADDR11                     *((volatile unsigned int*)(0x42A007C0UL))
#define bM4_MPU_RGD15_MPURG15ADDR12                     *((volatile unsigned int*)(0x42A007C4UL))
#define bM4_MPU_RGD15_MPURG15ADDR13                     *((volatile unsigned int*)(0x42A007C8UL))
#define bM4_MPU_RGD15_MPURG15ADDR14                     *((volatile unsigned int*)(0x42A007CCUL))
#define bM4_MPU_RGD15_MPURG15ADDR15                     *((volatile unsigned int*)(0x42A007D0UL))
#define bM4_MPU_RGD15_MPURG15ADDR16                     *((volatile unsigned int*)(0x42A007D4UL))
#define bM4_MPU_RGD15_MPURG15ADDR17                     *((volatile unsigned int*)(0x42A007D8UL))
#define bM4_MPU_RGD15_MPURG15ADDR18                     *((volatile unsigned int*)(0x42A007DCUL))
#define bM4_MPU_RGD15_MPURG15ADDR19                     *((volatile unsigned int*)(0x42A007E0UL))
#define bM4_MPU_RGD15_MPURG15ADDR20                     *((volatile unsigned int*)(0x42A007E4UL))
#define bM4_MPU_RGD15_MPURG15ADDR21                     *((volatile unsigned int*)(0x42A007E8UL))
#define bM4_MPU_RGD15_MPURG15ADDR22                     *((volatile unsigned int*)(0x42A007ECUL))
#define bM4_MPU_RGD15_MPURG15ADDR23                     *((volatile unsigned int*)(0x42A007F0UL))
#define bM4_MPU_RGD15_MPURG15ADDR24                     *((volatile unsigned int*)(0x42A007F4UL))
#define bM4_MPU_RGD15_MPURG15ADDR25                     *((volatile unsigned int*)(0x42A007F8UL))
#define bM4_MPU_RGD15_MPURG15ADDR26                     *((volatile unsigned int*)(0x42A007FCUL))
#define bM4_MPU_RGCR0_S2RG0RP                           *((volatile unsigned int*)(0x42A00800UL))
#define bM4_MPU_RGCR0_S2RG0WP                           *((volatile unsigned int*)(0x42A00804UL))
#define bM4_MPU_RGCR0_S2RG0E                            *((volatile unsigned int*)(0x42A0081CUL))
#define bM4_MPU_RGCR0_S1RG0RP                           *((volatile unsigned int*)(0x42A00820UL))
#define bM4_MPU_RGCR0_S1RG0WP                           *((volatile unsigned int*)(0x42A00824UL))
#define bM4_MPU_RGCR0_S1RG0E                            *((volatile unsigned int*)(0x42A0083CUL))
#define bM4_MPU_RGCR0_FRG0RP                            *((volatile unsigned int*)(0x42A00840UL))
#define bM4_MPU_RGCR0_FRG0WP                            *((volatile unsigned int*)(0x42A00844UL))
#define bM4_MPU_RGCR0_FRG0E                             *((volatile unsigned int*)(0x42A0085CUL))
#define bM4_MPU_RGCR1_S2RG1RP                           *((volatile unsigned int*)(0x42A00880UL))
#define bM4_MPU_RGCR1_S2RG1WP                           *((volatile unsigned int*)(0x42A00884UL))
