CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_MPU_RGCR1_S2RG1E                            *((volatile unsigned int*)(0x42A0089CUL))
#define bM4_MPU_RGCR1_S1RG1RP                           *((volatile unsigned int*)(0x42A008A0UL))
#define bM4_MPU_RGCR1_S1RG1WP                           *((volatile unsigned int*)(0x42A008A4UL))
#define bM4_MPU_RGCR1_S1RG1E                            *((volatile unsigned int*)(0x42A008BCUL))
#define bM4_MPU_RGCR1_FRG1RP                            *((volatile unsigned int*)(0x42A008C0UL))
#define bM4_MPU_RGCR1_FRG1WP                            *((volatile unsigned int*)(0x42A008C4UL))
#define bM4_MPU_RGCR1_FRG1E                             *((volatile unsigned int*)(0x42A008DCUL))
#define bM4_MPU_RGCR2_S2RG2RP                           *((volatile unsigned int*)(0x42A00900UL))
#define bM4_MPU_RGCR2_S2RG2WP                           *((volatile unsigned int*)(0x42A00904UL))
#define bM4_MPU_RGCR2_S2RG2E                            *((volatile unsigned int*)(0x42A0091CUL))
#define bM4_MPU_RGCR2_S1RG2RP                           *((volatile unsigned int*)(0x42A00920UL))
#define bM4_MPU_RGCR2_S1RG2WP                           *((volatile unsigned int*)(0x42A00924UL))
#define bM4_MPU_RGCR2_S1RG2E                            *((volatile unsigned int*)(0x42A0093CUL))
#define bM4_MPU_RGCR2_FRG2RP                            *((volatile unsigned int*)(0x42A00940UL))
#define bM4_MPU_RGCR2_FRG2WP                            *((volatile unsigned int*)(0x42A00944UL))
#define bM4_MPU_RGCR2_FRG2E                             *((volatile unsigned int*)(0x42A0095CUL))
#define bM4_MPU_RGCR3_S2RG3RP                           *((volatile unsigned int*)(0x42A00980UL))
#define bM4_MPU_RGCR3_S2RG3WP                           *((volatile unsigned int*)(0x42A00984UL))
#define bM4_MPU_RGCR3_S2RG3E                            *((volatile unsigned int*)(0x42A0099CUL))
#define bM4_MPU_RGCR3_S1RG3RP                           *((volatile unsigned int*)(0x42A009A0UL))
#define bM4_MPU_RGCR3_S1RG3WP                           *((volatile unsigned int*)(0x42A009A4UL))
#define bM4_MPU_RGCR3_S1RG3E                            *((volatile unsigned int*)(0x42A009BCUL))
#define bM4_MPU_RGCR3_FRG3RP                            *((volatile unsigned int*)(0x42A009C0UL))
#define bM4_MPU_RGCR3_FRG3WP                            *((volatile unsigned int*)(0x42A009C4UL))
#define bM4_MPU_RGCR3_FRG3E                             *((volatile unsigned int*)(0x42A009DCUL))
#define bM4_MPU_RGCR4_S2RG4RP                           *((volatile unsigned int*)(0x42A00A00UL))
#define bM4_MPU_RGCR4_S2RG4WP                           *((volatile unsigned int*)(0x42A00A04UL))
#define bM4_MPU_RGCR4_S2RG4E                            *((volatile unsigned int*)(0x42A00A1CUL))
#define bM4_MPU_RGCR4_S1RG4RP                           *((volatile unsigned int*)(0x42A00A20UL))
#define bM4_MPU_RGCR4_S1RG4WP                           *((volatile unsigned int*)(0x42A00A24UL))
#define bM4_MPU_RGCR4_S1RG4E                            *((volatile unsigned int*)(0x42A00A3CUL))
#define bM4_MPU_RGCR4_FRG4RP                            *((volatile unsigned int*)(0x42A00A40UL))
#define bM4_MPU_RGCR4_FRG4WP                            *((volatile unsigned int*)(0x42A00A44UL))
#define bM4_MPU_RGCR4_FRG4E                             *((volatile unsigned int*)(0x42A00A5CUL))
#define bM4_MPU_RGCR5_S2RG5RP                           *((volatile unsigned int*)(0x42A00A80UL))
#define bM4_MPU_RGCR5_S2RG5WP                           *((volatile unsigned int*)(0x42A00A84UL))
#define bM4_MPU_RGCR5_S2RG5E                            *((volatile unsigned int*)(0x42A00A9CUL))
#define bM4_MPU_RGCR5_S1RG5RP                           *((volatile unsigned int*)(0x42A00AA0UL))
#define bM4_MPU_RGCR5_S1RG5WP                           *((volatile unsigned int*)(0x42A00AA4UL))
#define bM4_MPU_RGCR5_S1RG5E                            *((volatile unsigned int*)(0x42A00ABCUL))
#define bM4_MPU_RGCR5_FRG5RP                            *((volatile unsigned int*)(0x42A00AC0UL))
#define bM4_MPU_RGCR5_FRG5WP                            *((volatile unsigned int*)(0x42A00AC4UL))
#define bM4_MPU_RGCR5_FRG5E                             *((volatile unsigned int*)(0x42A00ADCUL))
#define bM4_MPU_RGCR6_S2RG6RP                           *((volatile unsigned int*)(0x42A00B00UL))
#define bM4_MPU_RGCR6_S2RG6WP                           *((volatile unsigned int*)(0x42A00B04UL))
#define bM4_MPU_RGCR6_S2RG6E                            *((volatile unsigned int*)(0x42A00B1CUL))
#define bM4_MPU_RGCR6_S1RG6RP                           *((volatile unsigned int*)(0x42A00B20UL))
#define bM4_MPU_RGCR6_S1RG6WP                           *((volatile unsigned int*)(0x42A00B24UL))
#define bM4_MPU_RGCR6_S1RG6E                            *((volatile unsigned int*)(0x42A00B3CUL))
#define bM4_MPU_RGCR6_FRG6RP                            *((volatile unsigned int*)(0x42A00B40UL))
#define bM4_MPU_RGCR6_FRG6WP                            *((volatile unsigned int*)(0x42A00B44UL))
#define bM4_MPU_RGCR6_FRG6E                             *((volatile unsigned int*)(0x42A00B5CUL))
#define bM4_MPU_RGCR7_S2RG7RP                           *((volatile unsigned int*)(0x42A00B80UL))
#define bM4_MPU_RGCR7_S2RG7WP                           *((volatile unsigned int*)(0x42A00B84UL))
#define bM4_MPU_RGCR7_S2RG7E                            *((volatile unsigned int*)(0x42A00B9CUL))
#define bM4_MPU_RGCR7_S1RG7RP                           *((volatile unsigned int*)(0x42A00BA0UL))
#define bM4_MPU_RGCR7_S1RG7WP                           *((volatile unsigned int*)(0x42A00BA4UL))
#define bM4_MPU_RGCR7_S1RG7E                            *((volatile unsigned int*)(0x42A00BBCUL))
#define bM4_MPU_RGCR7_FRG7RP                            *((volatile unsigned int*)(0x42A00BC0UL))
#define bM4_MPU_RGCR7_FRG7WP                            *((volatile unsigned int*)(0x42A00BC4UL))
#define bM4_MPU_RGCR7_FRG7E                             *((volatile unsigned int*)(0x42A00BDCUL))
#define bM4_MPU_RGCR8_S2RG8RP                           *((volatile unsigned int*)(0x42A00C00UL))
#define bM4_MPU_RGCR8_S2RG8WP                           *((volatile unsigned int*)(0x42A00C04UL))
#define bM4_MPU_RGCR8_S2RG8E                            *((volatile unsigned int*)(0x42A00C1CUL))
#define bM4_MPU_RGCR8_S1RG8RP                           *((volatile unsigned int*)(0x42A00C20UL))
#define bM4_MPU_RGCR8_S1RG8WP                           *((volatile unsigned int*)(0x42A00C24UL))
#define bM4_MPU_RGCR8_S1RG8E                            *((volatile unsigned int*)(0x42A00C3CUL))
#define bM4_MPU_RGCR9_S2RG9RP                           *((volatile unsigned int*)(0x42A00C80UL))
#define bM4_MPU_RGCR9_S2RG9WP                           *((volatile unsigned int*)(0x42A00C84UL))
#define bM4_MPU_RGCR9_S2RG9E                            *((volatile unsigned int*)(0x42A00C9CUL))
#define bM4_MPU_RGCR9_S1RG9RP                           *((volatile unsigned int*)(0x42A00CA0UL))
#define bM4_MPU_RGCR9_S1RG9WP                           *((volatile unsigned int*)(0x42A00CA4UL))
#define bM4_MPU_RGCR9_S1RG9E                            *((volatile unsigned int*)(0x42A00CBCUL))
#define bM4_MPU_RGCR10_S2RG10RP                         *((volatile unsigned int*)(0x42A00D00UL))
#define bM4_MPU_RGCR10_S2RG10WP                         *((volatile unsigned int*)(0x42A00D04UL))
#define bM4_MPU_RGCR10_S2RG10E                          *((volatile unsigned int*)(0x42A00D1CUL))
#define bM4_MPU_RGCR10_S1RG10RP                         *((volatile unsigned int*)(0x42A00D20UL))
#define bM4_MPU_RGCR10_S1RG10WP                         *((volatile unsigned int*)(0x42A00D24UL))
#define bM4_MPU_RGCR10_S1RG10E                          *((volatile unsigned int*)(0x42A00D3CUL))
#define bM4_MPU_RGCR11_S2RG11RP                         *((volatile unsigned int*)(0x42A00D80UL))
#define bM4_MPU_RGCR11_S2RG11WP                         *((volatile unsigned int*)(0x42A00D84UL))
#define bM4_MPU_RGCR11_S2RG11E                          *((volatile unsigned int*)(0x42A00D9CUL))
#define bM4_MPU_RGCR11_S1RG11RP                         *((volatile unsigned int*)(0x42A00DA0UL))
#define bM4_MPU_RGCR11_S1RG11WP                         *((volatile unsigned int*)(0x42A00DA4UL))
#define bM4_MPU_RGCR11_S1RG11E                          *((volatile unsigned int*)(0x42A00DBCUL))
#define bM4_MPU_RGCR12_S2RG12RP                         *((volatile unsigned int*)(0x42A00E00UL))
#define bM4_MPU_RGCR12_S2RG12WP                         *((volatile unsigned int*)(0x42A00E04UL))
#define bM4_MPU_RGCR12_S2RG12E                          *((volatile unsigned int*)(0x42A00E1CUL))
#define bM4_MPU_RGCR12_S1RG12RP                         *((volatile unsigned int*)(0x42A00E20UL))
#define bM4_MPU_RGCR12_S1RG12WP                         *((volatile unsigned int*)(0x42A00E24UL))
#define bM4_MPU_RGCR12_S1RG12E                          *((volatile unsigned int*)(0x42A00E3CUL))
#define bM4_MPU_RGCR13_S2RG13RP                         *((volatile unsigned int*)(0x42A00E80UL))
#define bM4_MPU_RGCR13_S2RG13WP                         *((volatile unsigned int*)(0x42A00E84UL))
#define bM4_MPU_RGCR13_S2RG13E                          *((volatile unsigned int*)(0x42A00E9CUL))
#define bM4_MPU_RGCR13_S1RG13RP                         *((volatile unsigned int*)(0x42A00EA0UL))
#define bM4_MPU_RGCR13_S1RG13WP                         *((volatile unsigned int*)(0x42A00EA4UL))
#define bM4_MPU_RGCR13_S1RG13E                          *((volatile unsigned int*)(0x42A00EBCUL))
#define bM4_MPU_RGCR14_S2RG14RP                         *((volatile unsigned int*)(0x42A00F00UL))
#define bM4_MPU_RGCR14_S2RG14WP                         *((volatile unsigned int*)(0x42A00F04UL))
#define bM4_MPU_RGCR14_S2RG14E                          *((volatile unsigned int*)(0x42A00F1CUL))
#define bM4_MPU_RGCR14_S1RG14RP                         *((volatile unsigned int*)(0x42A00F20UL))
#define bM4_MPU_RGCR14_S1RG14WP                         *((volatile unsigned int*)(0x42A00F24UL))
#define bM4_MPU_RGCR14_S1RG14E                          *((volatile unsigned int*)(0x42A00F3CUL))
#define bM4_MPU_RGCR15_S2RG15RP                         *((volatile unsigned int*)(0x42A00F80UL))
#define bM4_MPU_RGCR15_S2RG15WP                         *((volatile unsigned int*)(0x42A00F84UL))
#define bM4_MPU_RGCR15_S2RG15E                          *((volatile unsigned int*)(0x42A00F9CUL))
#define bM4_MPU_RGCR15_S1RG15RP                         *((volatile unsigned int*)(0x42A00FA0UL))
#define bM4_MPU_RGCR15_S1RG15WP                         *((volatile unsigned int*)(0x42A00FA4UL))
#define bM4_MPU_RGCR15_S1RG15E                          *((volatile unsigned int*)(0x42A00FBCUL))
#define bM4_MPU_CR_SMPU2BRP                             *((volatile unsigned int*)(0x42A01000UL))
#define bM4_MPU_CR_SMPU2BWP                             *((volatile unsigned int*)(0x42A01004UL))
#define bM4_MPU_CR_SMPU2ACT0                            *((volatile unsigned int*)(0x42A01008UL))
#define bM4_MPU_CR_SMPU2ACT1                            *((volatile unsigned int*)(0x42A0100CUL))
#define bM4_MPU_CR_SMPU2E                               *((volatile unsigned int*)(0x42A0101CUL))
#define bM4_MPU_CR_SMPU1BRP                             *((volatile unsigned int*)(0x42A01020UL))
#define bM4_MPU_CR_SMPU1BWP                             *((volatile unsigned int*)(0x42A01024UL))
#define bM4_MPU_CR_SMPU1ACT0                            *((volatile unsigned int*)(0x42A01028UL))
#define bM4_MPU_CR_SMPU1ACT1                            *((volatile unsigned int*)(0x42A0102CUL))
#define bM4_MPU_CR_SMPU1E                               *((volatile unsigned int*)(0x42A0103CUL))
#define bM4_MPU_CR_FMPUBRP                              *((volatile unsigned int*)(0x42A01040UL))
#define bM4_MPU_CR_FMPUBWP                              *((volatile unsigned int*)(0x42A01044UL))
#define bM4_MPU_CR_FMPUACT0                             *((volatile unsigned int*)(0x42A01048UL))
#define bM4_MPU_CR_FMPUACT1                             *((volatile unsigned int*)(0x42A0104CUL))
#define bM4_MPU_CR_FMPUE                                *((volatile unsigned int*)(0x42A0105CUL))
#define bM4_MPU_SR_SMPU2EAF                             *((volatile unsigned int*)(0x42A01080UL))
#define bM4_MPU_SR_SMPU1EAF                             *((volatile unsigned int*)(0x42A010A0UL))
#define bM4_MPU_SR_FMPUEAF                              *((volatile unsigned int*)(0x42A010C0UL))
#define bM4_MPU_ECLR_SMPU2ECLR                          *((volatile unsigned int*)(0x42A01100UL))
#define bM4_MPU_ECLR_SMPU1ECLR                          *((volatile unsigned int*)(0x42A01120UL))
#define bM4_MPU_ECLR_FMPUECLR                           *((volatile unsigned int*)(0x42A01140UL))
#define bM4_MPU_WP_MPUWE                                *((volatile unsigned int*)(0x42A01180UL))
#define bM4_MPU_WP_WKEY0                                *((volatile unsigned int*)(0x42A01184UL))
#define bM4_MPU_WP_WKEY1                                *((volatile unsigned int*)(0x42A01188UL))
#define bM4_MPU_WP_WKEY2                                *((volatile unsigned int*)(0x42A0118CUL))
#define bM4_MPU_WP_WKEY3                                *((volatile unsigned int*)(0x42A01190UL))
#define bM4_MPU_WP_WKEY4                                *((volatile unsigned int*)(0x42A01194UL))
#define bM4_MPU_WP_WKEY5                                *((volatile unsigned int*)(0x42A01198UL))
#define bM4_MPU_WP_WKEY6                                *((volatile unsigned int*)(0x42A0119CUL))
#define bM4_MPU_WP_WKEY7                                *((volatile unsigned int*)(0x42A011A0UL))
#define bM4_MPU_WP_WKEY8                                *((volatile unsigned int*)(0x42A011A4UL))
#define bM4_MPU_WP_WKEY9                                *((volatile unsigned int*)(0x42A011A8UL))
#define bM4_MPU_WP_WKEY10                               *((volatile unsigned int*)(0x42A011ACUL))
#define bM4_MPU_WP_WKEY11                               *((volatile unsigned int*)(0x42A011B0UL))
#define bM4_MPU_WP_WKEY12                               *((volatile unsigned int*)(0x42A011B4UL))
#define bM4_MPU_WP_WKEY13                               *((volatile unsigned int*)(0x42A011B8UL))
#define bM4_MPU_WP_WKEY14                               *((volatile unsigned int*)(0x42A011BCUL))
#define bM4_MSTP_FCG0_RAMHS                             *((volatile unsigned int*)(0x42900000UL))
#define bM4_MSTP_FCG0_RAM0                              *((volatile unsigned int*)(0x42900010UL))
#define bM4_MSTP_FCG0_ECCRAM                            *((volatile unsigned int*)(0x42900020UL))
#define bM4_MSTP_FCG0_RETRAM                            *((volatile unsigned int*)(0x42900028UL))
#define bM4_MSTP_FCG0_DMA1                              *((volatile unsigned int*)(0x42900038UL))
#define bM4_MSTP_FCG0_DMA2                              *((volatile unsigned int*)(0x4290003CUL))
#define bM4_MSTP_FCG0_FCM                               *((volatile unsigned int*)(0x42900040UL))
#define bM4_MSTP_FCG0_AOS                               *((volatile unsigned int*)(0x42900044UL))
#define bM4_MSTP_FCG0_AES                               *((volatile unsigned int*)(0x42900050UL))
#define bM4_MSTP_FCG0_HASH                              *((volatile unsigned int*)(0x42900054UL))
#define bM4_MSTP_FCG0_TRNG                              *((volatile unsigned int*)(0x42900058UL))
#define bM4_MSTP_FCG0_CRC                               *((volatile unsigned int*)(0x4290005CUL))
#define bM4_MSTP_FCG0_DCU1                              *((volatile unsigned int*)(0x42900060UL))
#define bM4_MSTP_FCG0_DCU2                              *((volatile unsigned int*)(0x42900064UL))
#define bM4_MSTP_FCG0_DCU3                              *((volatile unsigned int*)(0x42900068UL))
#define bM4_MSTP_FCG0_DCU4                              *((volatile unsigned int*)(0x4290006CUL))
#define bM4_MSTP_FCG0_KEY                               *((volatile unsigned int*)(0x4290007CUL))
#define bM4_MSTP_FCG1_CAN                               *((volatile unsigned int*)(0x42900080UL))
#define bM4_MSTP_FCG1_QSPI                              *((volatile unsigned int*)(0x4290008CUL))
#define bM4_MSTP_FCG1_IIC1                              *((volatile unsigned int*)(0x42900090UL))
#define bM4_MSTP_FCG1_IIC2                              *((volatile unsigned int*)(0x42900094UL))
#define bM4_MSTP_FCG1_IIC3                              *((volatile unsigned int*)(0x42900098UL))
#define bM4_MSTP_FCG1_USBFS                             *((volatile unsigned int*)(0x429000A0UL))
#define bM4_MSTP_FCG1_SDIOC1                            *((volatile unsigned int*)(0x429000A8UL))
#define bM4_MSTP_FCG1_SDIOC2                            *((volatile unsigned int*)(0x429000ACUL))
#define bM4_MSTP_FCG1_I2S1                              *((volatile unsigned int*)(0x429000B0UL))
#define bM4_MSTP_FCG1_I2S2                              *((volatile unsigned int*)(0x429000B4UL))
#define bM4_MSTP_FCG1_I2S3                              *((volatile unsigned int*)(0x429000B8UL))
#define bM4_MSTP_FCG1_I2S4                              *((volatile unsigned int*)(0x429000BCUL))
#define bM4_MSTP_FCG1_SPI1                              *((volatile unsigned int*)(0x429000C0UL))
#define bM4_MSTP_FCG1_SPI2                              *((volatile unsigned int*)(0x429000C4UL))
#define bM4_MSTP_FCG1_SPI3                              *((volatile unsigned int*)(0x429000C8UL))
#define bM4_MSTP_FCG1_SPI4                              *((volatile unsigned int*)(0x429000CCUL))
#define bM4_MSTP_FCG1_USART1                            *((volatile unsigned int*)(0x429000E0UL))
#define bM4_MSTP_FCG1_USART2                            *((volatile unsigned int*)(0x429000E4UL))
#define bM4_MSTP_FCG1_USART3                            *((volatile unsigned int*)(0x429000E8UL))
#define bM4_MSTP_FCG1_USART4                            *((volatile unsigned int*)(0x429000ECUL))
#define bM4_MSTP_FCG2_TIMER0_1                          *((volatile unsigned int*)(0x42900100UL))
#define bM4_MSTP_FCG2_TIMER0_2                          *((volatile unsigned int*)(0x42900104UL))
#define bM4_MSTP_FCG2_TIMERA_1                          *((volatile unsigned int*)(0x42900108UL))
#define bM4_MSTP_FCG2_TIMERA_2                          *((volatile unsigned int*)(0x4290010CUL))
#define bM4_MSTP_FCG2_TIMERA_3                          *((volatile unsigned int*)(0x42900110UL))
#define bM4_MSTP_FCG2_TIMERA_4                          *((volatile unsigned int*)(0x42900114UL))
#define bM4_MSTP_FCG2_TIMERA_5                          *((volatile unsigned int*)(0x42900118UL))
#define bM4_MSTP_FCG2_TIMERA_6                          *((volatile unsigned int*)(0x4290011CUL))
#define bM4_MSTP_FCG2_TIMER4_1                          *((volatile unsigned int*)(0x42900120UL))
#define bM4_MSTP_FCG2_TIMER4_2                          *((volatile unsigned int*)(0x42900124UL))
#define bM4_MSTP_FCG2_TIMER4_3                          *((volatile unsigned int*)(0x42900128UL))
#define bM4_MSTP_FCG2_EMB                               *((volatile unsigned int*)(0x4290013CUL))
#define bM4_MSTP_FCG2_TIMER6_1                          *((volatile unsigned int*)(0x42900140UL))
#define bM4_MSTP_FCG2_TIMER6_2                          *((volatile unsigned int*)(0x42900144UL))
#define bM4_MSTP_FCG2_TIMER6_3                          *((volatile unsigned int*)(0x42900148UL))
#define bM4_MSTP_FCG3_ADC1                              *((volatile unsigned int*)(0x42900180UL))
#define bM4_MSTP_FCG3_ADC2                              *((volatile unsigned int*)(0x42900184UL))
#define bM4_MSTP_FCG3_DAC                               *((volatile unsigned int*)(0x42900190UL))
#define bM4_MSTP_FCG3_CMP                               *((volatile unsigned int*)(0x429001A0UL))
#define bM4_MSTP_FCG3_OTS                               *((volatile unsigned int*)(0x429001B0UL))
#define bM4_MSTP_FCG0PC_PRT0                            *((volatile unsigned int*)(0x42900200UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE0                       *((volatile unsigned int*)(0x42900240UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE1                       *((volatile unsigned int*)(0x42900244UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE2                       *((volatile unsigned int*)(0x42900248UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE3                       *((volatile unsigned int*)(0x4290024CUL))
#define bM4_MSTP_FCG0PC_FCG0PCWE4                       *((volatile unsigned int*)(0x42900250UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE5                       *((volatile unsigned int*)(0x42900254UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE6                       *((volatile unsigned int*)(0x42900258UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE7                       *((volatile unsigned int*)(0x4290025CUL))
#define bM4_MSTP_FCG0PC_FCG0PCWE8                       *((volatile unsigned int*)(0x42900260UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE9                       *((volatile unsigned int*)(0x42900264UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE10                      *((volatile unsigned int*)(0x42900268UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE11                      *((volatile unsigned int*)(0x4290026CUL))
#define bM4_MSTP_FCG0PC_FCG0PCWE12                      *((volatile unsigned int*)(0x42900270UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE13                      *((volatile unsigned int*)(0x42900274UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE14                      *((volatile unsigned int*)(0x42900278UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE15                      *((volatile unsigned int*)(0x4290027CUL))
#define bM4_OTS_CTL_OTSST                               *((volatile unsigned int*)(0x42948000UL))
#define bM4_OTS_CTL_OTSCK                               *((volatile unsigned int*)(0x42948004UL))
#define bM4_OTS_CTL_OTSIE                               *((volatile unsigned int*)(0x42948008UL))
#define bM4_OTS_CTL_TSSTP                               *((volatile unsigned int*)(0x4294800CUL))
#define bM4_OTS_DR1_TSDC0                               *((volatile unsigned int*)(0x42948040UL))
#define bM4_OTS_DR1_TSDC1                               *((volatile unsigned int*)(0x42948044UL))
#define bM4_OTS_DR1_TSDC2                               *((volatile unsigned int*)(0x42948048UL))
#define bM4_OTS_DR1_TSDC3                               *((volatile unsigned int*)(0x4294804CUL))
#define bM4_OTS_DR1_TSDC4                               *((volatile unsigned int*)(0x42948050UL))
#define bM4_OTS_DR1_TSDC5                               *((volatile unsigned int*)(0x42948054UL))
#define bM4_OTS_DR1_TSDC6                               *((volatile unsigned int*)(0x42948058UL))
#define bM4_OTS_DR1_TSDC7                               *((volatile unsigned int*)(0x4294805CUL))
#define bM4_OTS_DR1_TSDC8                               *((volatile unsigned int*)(0x42948060UL))
#define bM4_OTS_DR1_TSDC9                               *((volatile unsigned int*)(0x42948064UL))
#define bM4_OTS_DR1_TSDC10                              *((volatile unsigned int*)(0x42948068UL))
#define bM4_OTS_DR1_TSDC11                              *((volatile unsigned int*)(0x4294806CUL))
#define bM4_OTS_DR1_TSDC12                              *((volatile unsigned int*)(0x42948070UL))
#define bM4_OTS_DR1_TSDC13                              *((volatile unsigned int*)(0x42948074UL))
#define bM4_OTS_DR1_TSDC14                              *((volatile unsigned int*)(0x42948078UL))
#define bM4_OTS_DR1_TSDC15                              *((volatile unsigned int*)(0x4294807CUL))
#define bM4_OTS_DR2_TSDC0                               *((volatile unsigned int*)(0x42948080UL))
#define bM4_OTS_DR2_TSDC1                               *((volatile unsigned int*)(0x42948084UL))
#define bM4_OTS_DR2_TSDC2                               *((volatile unsigned int*)(0x42948088UL))
#define bM4_OTS_DR2_TSDC3                               *((volatile unsigned int*)(0x4294808CUL))
