CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_OTS_DR2_TSDC4                               *((volatile unsigned int*)(0x42948090UL))
#define bM4_OTS_DR2_TSDC5                               *((volatile unsigned int*)(0x42948094UL))
#define bM4_OTS_DR2_TSDC6                               *((volatile unsigned int*)(0x42948098UL))
#define bM4_OTS_DR2_TSDC7                               *((volatile unsigned int*)(0x4294809CUL))
#define bM4_OTS_DR2_TSDC8                               *((volatile unsigned int*)(0x429480A0UL))
#define bM4_OTS_DR2_TSDC9                               *((volatile unsigned int*)(0x429480A4UL))
#define bM4_OTS_DR2_TSDC10                              *((volatile unsigned int*)(0x429480A8UL))
#define bM4_OTS_DR2_TSDC11                              *((volatile unsigned int*)(0x429480ACUL))
#define bM4_OTS_DR2_TSDC12                              *((volatile unsigned int*)(0x429480B0UL))
#define bM4_OTS_DR2_TSDC13                              *((volatile unsigned int*)(0x429480B4UL))
#define bM4_OTS_DR2_TSDC14                              *((volatile unsigned int*)(0x429480B8UL))
#define bM4_OTS_DR2_TSDC15                              *((volatile unsigned int*)(0x429480BCUL))
#define bM4_OTS_ECR_TSEC0                               *((volatile unsigned int*)(0x429480C0UL))
#define bM4_OTS_ECR_TSEC1                               *((volatile unsigned int*)(0x429480C4UL))
#define bM4_OTS_ECR_TSEC2                               *((volatile unsigned int*)(0x429480C8UL))
#define bM4_OTS_ECR_TSEC3                               *((volatile unsigned int*)(0x429480CCUL))
#define bM4_OTS_ECR_TSEC4                               *((volatile unsigned int*)(0x429480D0UL))
#define bM4_OTS_ECR_TSEC5                               *((volatile unsigned int*)(0x429480D4UL))
#define bM4_OTS_ECR_TSEC6                               *((volatile unsigned int*)(0x429480D8UL))
#define bM4_OTS_ECR_TSEC7                               *((volatile unsigned int*)(0x429480DCUL))
#define bM4_OTS_ECR_TSEC8                               *((volatile unsigned int*)(0x429480E0UL))
#define bM4_OTS_ECR_TSEC9                               *((volatile unsigned int*)(0x429480E4UL))
#define bM4_OTS_ECR_TSEC10                              *((volatile unsigned int*)(0x429480E8UL))
#define bM4_OTS_ECR_TSEC11                              *((volatile unsigned int*)(0x429480ECUL))
#define bM4_OTS_ECR_TSEC12                              *((volatile unsigned int*)(0x429480F0UL))
#define bM4_OTS_ECR_TSEC13                              *((volatile unsigned int*)(0x429480F4UL))
#define bM4_OTS_ECR_TSEC14                              *((volatile unsigned int*)(0x429480F8UL))
#define bM4_OTS_ECR_TSEC15                              *((volatile unsigned int*)(0x429480FCUL))
#define bM4_OTS_LPR_TSOFS0                              *((volatile unsigned int*)(0x42948100UL))
#define bM4_OTS_LPR_TSOFS1                              *((volatile unsigned int*)(0x42948104UL))
#define bM4_OTS_LPR_TSOFS2                              *((volatile unsigned int*)(0x42948108UL))
#define bM4_OTS_LPR_TSOFS3                              *((volatile unsigned int*)(0x4294810CUL))
#define bM4_OTS_LPR_TSOFS4                              *((volatile unsigned int*)(0x42948110UL))
#define bM4_OTS_LPR_TSOFS5                              *((volatile unsigned int*)(0x42948114UL))
#define bM4_OTS_LPR_TSOFS6                              *((volatile unsigned int*)(0x42948118UL))
#define bM4_OTS_LPR_TSOFS7                              *((volatile unsigned int*)(0x4294811CUL))
#define bM4_OTS_LPR_TSSLP0                              *((volatile unsigned int*)(0x42948120UL))
#define bM4_OTS_LPR_TSSLP1                              *((volatile unsigned int*)(0x42948124UL))
#define bM4_OTS_LPR_TSSLP2                              *((volatile unsigned int*)(0x42948128UL))
#define bM4_OTS_LPR_TSSLP3                              *((volatile unsigned int*)(0x4294812CUL))
#define bM4_OTS_LPR_TSSLP4                              *((volatile unsigned int*)(0x42948130UL))
#define bM4_OTS_LPR_TSSLP5                              *((volatile unsigned int*)(0x42948134UL))
#define bM4_OTS_LPR_TSSLP6                              *((volatile unsigned int*)(0x42948138UL))
#define bM4_OTS_LPR_TSSLP7                              *((volatile unsigned int*)(0x4294813CUL))
#define bM4_OTS_LPR_TSSLP8                              *((volatile unsigned int*)(0x42948140UL))
#define bM4_OTS_LPR_TSSLP9                              *((volatile unsigned int*)(0x42948144UL))
#define bM4_OTS_LPR_TSSLP10                             *((volatile unsigned int*)(0x42948148UL))
#define bM4_OTS_LPR_TSSLP11                             *((volatile unsigned int*)(0x4294814CUL))
#define bM4_OTS_LPR_TSSLP12                             *((volatile unsigned int*)(0x42948150UL))
#define bM4_OTS_LPR_TSSLP13                             *((volatile unsigned int*)(0x42948154UL))
#define bM4_OTS_LPR_TSSLP14                             *((volatile unsigned int*)(0x42948158UL))
#define bM4_OTS_LPR_TSSLP15                             *((volatile unsigned int*)(0x4294815CUL))
#define bM4_OTS_LPR_TSSLP16                             *((volatile unsigned int*)(0x42948160UL))
#define bM4_OTS_LPR_TSSLP17                             *((volatile unsigned int*)(0x42948164UL))
#define bM4_OTS_LPR_TSSLP18                             *((volatile unsigned int*)(0x42948168UL))
#define bM4_OTS_LPR_TSSLP19                             *((volatile unsigned int*)(0x4294816CUL))
#define bM4_OTS_LPR_TSSLP20                             *((volatile unsigned int*)(0x42948170UL))
#define bM4_OTS_LPR_TSSLP21                             *((volatile unsigned int*)(0x42948174UL))
#define bM4_OTS_LPR_TSSLP22                             *((volatile unsigned int*)(0x42948178UL))
#define bM4_OTS_LPR_TSSLP23                             *((volatile unsigned int*)(0x4294817CUL))
#define bM4_PERIC_USBFS_SYCTLREG_DFB                    *((volatile unsigned int*)(0x42AA8000UL))
#define bM4_PERIC_USBFS_SYCTLREG_SOFEN                  *((volatile unsigned int*)(0x42AA8004UL))
#define bM4_PERIC_SDIOC_SYCTLREG_ABINT1                 *((volatile unsigned int*)(0x42AA8080UL))
#define bM4_PERIC_SDIOC_SYCTLREG_SELMMC1                *((volatile unsigned int*)(0x42AA8084UL))
#define bM4_PERIC_SDIOC_SYCTLREG_ABINT2                 *((volatile unsigned int*)(0x42AA8088UL))
#define bM4_PERIC_SDIOC_SYCTLREG_SELMMC2                *((volatile unsigned int*)(0x42AA808CUL))
#define bM4_PORT_PIDRA_PIN00                            *((volatile unsigned int*)(0x42A70000UL))
#define bM4_PORT_PIDRA_PIN01                            *((volatile unsigned int*)(0x42A70004UL))
#define bM4_PORT_PIDRA_PIN02                            *((volatile unsigned int*)(0x42A70008UL))
#define bM4_PORT_PIDRA_PIN03                            *((volatile unsigned int*)(0x42A7000CUL))
#define bM4_PORT_PIDRA_PIN04                            *((volatile unsigned int*)(0x42A70010UL))
#define bM4_PORT_PIDRA_PIN05                            *((volatile unsigned int*)(0x42A70014UL))
#define bM4_PORT_PIDRA_PIN06                            *((volatile unsigned int*)(0x42A70018UL))
#define bM4_PORT_PIDRA_PIN07                            *((volatile unsigned int*)(0x42A7001CUL))
#define bM4_PORT_PIDRA_PIN08                            *((volatile unsigned int*)(0x42A70020UL))
#define bM4_PORT_PIDRA_PIN09                            *((volatile unsigned int*)(0x42A70024UL))
#define bM4_PORT_PIDRA_PIN10                            *((volatile unsigned int*)(0x42A70028UL))
#define bM4_PORT_PIDRA_PIN11                            *((volatile unsigned int*)(0x42A7002CUL))
#define bM4_PORT_PIDRA_PIN12                            *((volatile unsigned int*)(0x42A70030UL))
#define bM4_PORT_PIDRA_PIN13                            *((volatile unsigned int*)(0x42A70034UL))
#define bM4_PORT_PIDRA_PIN14                            *((volatile unsigned int*)(0x42A70038UL))
#define bM4_PORT_PIDRA_PIN15                            *((volatile unsigned int*)(0x42A7003CUL))
#define bM4_PORT_PODRA_POUT00                           *((volatile unsigned int*)(0x42A70080UL))
#define bM4_PORT_PODRA_POUT01                           *((volatile unsigned int*)(0x42A70084UL))
#define bM4_PORT_PODRA_POUT02                           *((volatile unsigned int*)(0x42A70088UL))
#define bM4_PORT_PODRA_POUT03                           *((volatile unsigned int*)(0x42A7008CUL))
#define bM4_PORT_PODRA_POUT04                           *((volatile unsigned int*)(0x42A70090UL))
#define bM4_PORT_PODRA_POUT05                           *((volatile unsigned int*)(0x42A70094UL))
#define bM4_PORT_PODRA_POUT06                           *((volatile unsigned int*)(0x42A70098UL))
#define bM4_PORT_PODRA_POUT07                           *((volatile unsigned int*)(0x42A7009CUL))
#define bM4_PORT_PODRA_POUT08                           *((volatile unsigned int*)(0x42A700A0UL))
#define bM4_PORT_PODRA_POUT09                           *((volatile unsigned int*)(0x42A700A4UL))
#define bM4_PORT_PODRA_POUT10                           *((volatile unsigned int*)(0x42A700A8UL))
#define bM4_PORT_PODRA_POUT11                           *((volatile unsigned int*)(0x42A700ACUL))
#define bM4_PORT_PODRA_POUT12                           *((volatile unsigned int*)(0x42A700B0UL))
#define bM4_PORT_PODRA_POUT13                           *((volatile unsigned int*)(0x42A700B4UL))
#define bM4_PORT_PODRA_POUT14                           *((volatile unsigned int*)(0x42A700B8UL))
#define bM4_PORT_PODRA_POUT15                           *((volatile unsigned int*)(0x42A700BCUL))
#define bM4_PORT_POERA_POUTE00                          *((volatile unsigned int*)(0x42A700C0UL))
#define bM4_PORT_POERA_POUTE01                          *((volatile unsigned int*)(0x42A700C4UL))
#define bM4_PORT_POERA_POUTE02                          *((volatile unsigned int*)(0x42A700C8UL))
#define bM4_PORT_POERA_POUTE03                          *((volatile unsigned int*)(0x42A700CCUL))
#define bM4_PORT_POERA_POUTE04                          *((volatile unsigned int*)(0x42A700D0UL))
#define bM4_PORT_POERA_POUTE05                          *((volatile unsigned int*)(0x42A700D4UL))
#define bM4_PORT_POERA_POUTE06                          *((volatile unsigned int*)(0x42A700D8UL))
#define bM4_PORT_POERA_POUTE07                          *((volatile unsigned int*)(0x42A700DCUL))
#define bM4_PORT_POERA_POUTE08                          *((volatile unsigned int*)(0x42A700E0UL))
#define bM4_PORT_POERA_POUTE09                          *((volatile unsigned int*)(0x42A700E4UL))
#define bM4_PORT_POERA_POUTE10                          *((volatile unsigned int*)(0x42A700E8UL))
#define bM4_PORT_POERA_POUTE11                          *((volatile unsigned int*)(0x42A700ECUL))
#define bM4_PORT_POERA_POUTE12                          *((volatile unsigned int*)(0x42A700F0UL))
#define bM4_PORT_POERA_POUTE13                          *((volatile unsigned int*)(0x42A700F4UL))
#define bM4_PORT_POERA_POUTE14                          *((volatile unsigned int*)(0x42A700F8UL))
#define bM4_PORT_POERA_POUTE15                          *((volatile unsigned int*)(0x42A700FCUL))
#define bM4_PORT_POSRA_POS00                            *((volatile unsigned int*)(0x42A70100UL))
#define bM4_PORT_POSRA_POS01                            *((volatile unsigned int*)(0x42A70104UL))
#define bM4_PORT_POSRA_POS02                            *((volatile unsigned int*)(0x42A70108UL))
#define bM4_PORT_POSRA_POS03                            *((volatile unsigned int*)(0x42A7010CUL))
#define bM4_PORT_POSRA_POS04                            *((volatile unsigned int*)(0x42A70110UL))
#define bM4_PORT_POSRA_POS05                            *((volatile unsigned int*)(0x42A70114UL))
#define bM4_PORT_POSRA_POS06                            *((volatile unsigned int*)(0x42A70118UL))
#define bM4_PORT_POSRA_POS07                            *((volatile unsigned int*)(0x42A7011CUL))
#define bM4_PORT_POSRA_POS08                            *((volatile unsigned int*)(0x42A70120UL))
#define bM4_PORT_POSRA_POS09                            *((volatile unsigned int*)(0x42A70124UL))
#define bM4_PORT_POSRA_POS10                            *((volatile unsigned int*)(0x42A70128UL))
#define bM4_PORT_POSRA_POS11                            *((volatile unsigned int*)(0x42A7012CUL))
#define bM4_PORT_POSRA_POS12                            *((volatile unsigned int*)(0x42A70130UL))
#define bM4_PORT_POSRA_POS13                            *((volatile unsigned int*)(0x42A70134UL))
#define bM4_PORT_POSRA_POS14                            *((volatile unsigned int*)(0x42A70138UL))
#define bM4_PORT_POSRA_POS15                            *((volatile unsigned int*)(0x42A7013CUL))
#define bM4_PORT_PORRA_POR00                            *((volatile unsigned int*)(0x42A70140UL))
#define bM4_PORT_PORRA_POR01                            *((volatile unsigned int*)(0x42A70144UL))
#define bM4_PORT_PORRA_POR02                            *((volatile unsigned int*)(0x42A70148UL))
#define bM4_PORT_PORRA_POR03                            *((volatile unsigned int*)(0x42A7014CUL))
#define bM4_PORT_PORRA_POR04                            *((volatile unsigned int*)(0x42A70150UL))
#define bM4_PORT_PORRA_POR05                            *((volatile unsigned int*)(0x42A70154UL))
#define bM4_PORT_PORRA_POR06                            *((volatile unsigned int*)(0x42A70158UL))
#define bM4_PORT_PORRA_POR07                            *((volatile unsigned int*)(0x42A7015CUL))
#define bM4_PORT_PORRA_POR08                            *((volatile unsigned int*)(0x42A70160UL))
#define bM4_PORT_PORRA_POR09                            *((volatile unsigned int*)(0x42A70164UL))
#define bM4_PORT_PORRA_POR10                            *((volatile unsigned int*)(0x42A70168UL))
#define bM4_PORT_PORRA_POR11                            *((volatile unsigned int*)(0x42A7016CUL))
#define bM4_PORT_PORRA_POR12                            *((volatile unsigned int*)(0x42A70170UL))
#define bM4_PORT_PORRA_POR13                            *((volatile unsigned int*)(0x42A70174UL))
#define bM4_PORT_PORRA_POR14                            *((volatile unsigned int*)(0x42A70178UL))
#define bM4_PORT_PORRA_POR15                            *((volatile unsigned int*)(0x42A7017CUL))
#define bM4_PORT_POTRA_POT00                            *((volatile unsigned int*)(0x42A70180UL))
#define bM4_PORT_POTRA_POT01                            *((volatile unsigned int*)(0x42A70184UL))
#define bM4_PORT_POTRA_POT02                            *((volatile unsigned int*)(0x42A70188UL))
#define bM4_PORT_POTRA_POT03                            *((volatile unsigned int*)(0x42A7018CUL))
#define bM4_PORT_POTRA_POT04                            *((volatile unsigned int*)(0x42A70190UL))
#define bM4_PORT_POTRA_POT05                            *((volatile unsigned int*)(0x42A70194UL))
#define bM4_PORT_POTRA_POT06                            *((volatile unsigned int*)(0x42A70198UL))
#define bM4_PORT_POTRA_POT07                            *((volatile unsigned int*)(0x42A7019CUL))
#define bM4_PORT_POTRA_POT08                            *((volatile unsigned int*)(0x42A701A0UL))
#define bM4_PORT_POTRA_POT09                            *((volatile unsigned int*)(0x42A701A4UL))
#define bM4_PORT_POTRA_POT10                            *((volatile unsigned int*)(0x42A701A8UL))
#define bM4_PORT_POTRA_POT11                            *((volatile unsigned int*)(0x42A701ACUL))
#define bM4_PORT_POTRA_POT12                            *((volatile unsigned int*)(0x42A701B0UL))
#define bM4_PORT_POTRA_POT13                            *((volatile unsigned int*)(0x42A701B4UL))
#define bM4_PORT_POTRA_POT14                            *((volatile unsigned int*)(0x42A701B8UL))
#define bM4_PORT_POTRA_POT15                            *((volatile unsigned int*)(0x42A701BCUL))
#define bM4_PORT_PIDRB_PIN00                            *((volatile unsigned int*)(0x42A70200UL))
#define bM4_PORT_PIDRB_PIN01                            *((volatile unsigned int*)(0x42A70204UL))
#define bM4_PORT_PIDRB_PIN02                            *((volatile unsigned int*)(0x42A70208UL))
#define bM4_PORT_PIDRB_PIN03                            *((volatile unsigned int*)(0x42A7020CUL))
#define bM4_PORT_PIDRB_PIN04                            *((volatile unsigned int*)(0x42A70210UL))
#define bM4_PORT_PIDRB_PIN05                            *((volatile unsigned int*)(0x42A70214UL))
#define bM4_PORT_PIDRB_PIN06                            *((volatile unsigned int*)(0x42A70218UL))
#define bM4_PORT_PIDRB_PIN07                            *((volatile unsigned int*)(0x42A7021CUL))
#define bM4_PORT_PIDRB_PIN08                            *((volatile unsigned int*)(0x42A70220UL))
#define bM4_PORT_PIDRB_PIN09                            *((volatile unsigned int*)(0x42A70224UL))
#define bM4_PORT_PIDRB_PIN10                            *((volatile unsigned int*)(0x42A70228UL))
#define bM4_PORT_PIDRB_PIN11                            *((volatile unsigned int*)(0x42A7022CUL))
#define bM4_PORT_PIDRB_PIN12                            *((volatile unsigned int*)(0x42A70230UL))
#define bM4_PORT_PIDRB_PIN13                            *((volatile unsigned int*)(0x42A70234UL))
#define bM4_PORT_PIDRB_PIN14                            *((volatile unsigned int*)(0x42A70238UL))
#define bM4_PORT_PIDRB_PIN15                            *((volatile unsigned int*)(0x42A7023CUL))
#define bM4_PORT_PODRB_POUT00                           *((volatile unsigned int*)(0x42A70280UL))
#define bM4_PORT_PODRB_POUT01                           *((volatile unsigned int*)(0x42A70284UL))
#define bM4_PORT_PODRB_POUT02                           *((volatile unsigned int*)(0x42A70288UL))
#define bM4_PORT_PODRB_POUT03                           *((volatile unsigned int*)(0x42A7028CUL))
#define bM4_PORT_PODRB_POUT04                           *((volatile unsigned int*)(0x42A70290UL))
#define bM4_PORT_PODRB_POUT05                           *((volatile unsigned int*)(0x42A70294UL))
#define bM4_PORT_PODRB_POUT06                           *((volatile unsigned int*)(0x42A70298UL))
#define bM4_PORT_PODRB_POUT07                           *((volatile unsigned int*)(0x42A7029CUL))
#define bM4_PORT_PODRB_POUT08                           *((volatile unsigned int*)(0x42A702A0UL))
#define bM4_PORT_PODRB_POUT09                           *((volatile unsigned int*)(0x42A702A4UL))
#define bM4_PORT_PODRB_POUT10                           *((volatile unsigned int*)(0x42A702A8UL))
#define bM4_PORT_PODRB_POUT11                           *((volatile unsigned int*)(0x42A702ACUL))
#define bM4_PORT_PODRB_POUT12                           *((volatile unsigned int*)(0x42A702B0UL))
#define bM4_PORT_PODRB_POUT13                           *((volatile unsigned int*)(0x42A702B4UL))
#define bM4_PORT_PODRB_POUT14                           *((volatile unsigned int*)(0x42A702B8UL))
#define bM4_PORT_PODRB_POUT15                           *((volatile unsigned int*)(0x42A702BCUL))
#define bM4_PORT_POERB_POUTE00                          *((volatile unsigned int*)(0x42A702C0UL))
#define bM4_PORT_POERB_POUTE01                          *((volatile unsigned int*)(0x42A702C4UL))
#define bM4_PORT_POERB_POUTE02                          *((volatile unsigned int*)(0x42A702C8UL))
#define bM4_PORT_POERB_POUTE03                          *((volatile unsigned int*)(0x42A702CCUL))
#define bM4_PORT_POERB_POUTE04                          *((volatile unsigned int*)(0x42A702D0UL))
#define bM4_PORT_POERB_POUTE05                          *((volatile unsigned int*)(0x42A702D4UL))
#define bM4_PORT_POERB_POUTE06                          *((volatile unsigned int*)(0x42A702D8UL))
#define bM4_PORT_POERB_POUTE07                          *((volatile unsigned int*)(0x42A702DCUL))
#define bM4_PORT_POERB_POUTE08                          *((volatile unsigned int*)(0x42A702E0UL))
#define bM4_PORT_POERB_POUTE09                          *((volatile unsigned int*)(0x42A702E4UL))
#define bM4_PORT_POERB_POUTE10                          *((volatile unsigned int*)(0x42A702E8UL))
#define bM4_PORT_POERB_POUTE11                          *((volatile unsigned int*)(0x42A702ECUL))
#define bM4_PORT_POERB_POUTE12                          *((volatile unsigned int*)(0x42A702F0UL))
#define bM4_PORT_POERB_POUTE13                          *((volatile unsigned int*)(0x42A702F4UL))
#define bM4_PORT_POERB_POUTE14                          *((volatile unsigned int*)(0x42A702F8UL))
#define bM4_PORT_POERB_POUTE15                          *((volatile unsigned int*)(0x42A702FCUL))
#define bM4_PORT_POSRB_POS00                            *((volatile unsigned int*)(0x42A70300UL))
#define bM4_PORT_POSRB_POS01                            *((volatile unsigned int*)(0x42A70304UL))
#define bM4_PORT_POSRB_POS02                            *((volatile unsigned int*)(0x42A70308UL))
#define bM4_PORT_POSRB_POS03                            *((volatile unsigned int*)(0x42A7030CUL))
#define bM4_PORT_POSRB_POS04                            *((volatile unsigned int*)(0x42A70310UL))
#define bM4_PORT_POSRB_POS05                            *((volatile unsigned int*)(0x42A70314UL))
#define bM4_PORT_POSRB_POS06                            *((volatile unsigned int*)(0x42A70318UL))
#define bM4_PORT_POSRB_POS07                            *((volatile unsigned int*)(0x42A7031CUL))
#define bM4_PORT_POSRB_POS08                            *((volatile unsigned int*)(0x42A70320UL))
#define bM4_PORT_POSRB_POS09                            *((volatile unsigned int*)(0x42A70324UL))
#define bM4_PORT_POSRB_POS10                            *((volatile unsigned int*)(0x42A70328UL))
#define bM4_PORT_POSRB_POS11                            *((volatile unsigned int*)(0x42A7032CUL))
#define bM4_PORT_POSRB_POS12                            *((volatile unsigned int*)(0x42A70330UL))
#define bM4_PORT_POSRB_POS13                            *((volatile unsigned int*)(0x42A70334UL))
#define bM4_PORT_POSRB_POS14                            *((volatile unsigned int*)(0x42A70338UL))
#define bM4_PORT_POSRB_POS15                            *((volatile unsigned int*)(0x42A7033CUL))
#define bM4_PORT_PORRB_POR00                            *((volatile unsigned int*)(0x42A70340UL))
#define bM4_PORT_PORRB_POR01                            *((volatile unsigned int*)(0x42A70344UL))
#define bM4_PORT_PORRB_POR02                            *((volatile unsigned int*)(0x42A70348UL))
#define bM4_PORT_PORRB_POR03                            *((volatile unsigned int*)(0x42A7034CUL))
#define bM4_PORT_PORRB_POR04                            *((volatile unsigned int*)(0x42A70350UL))
#define bM4_PORT_PORRB_POR05                            *((volatile unsigned int*)(0x42A70354UL))
#define bM4_PORT_PORRB_POR06                            *((volatile unsigned int*)(0x42A70358UL))
#define bM4_PORT_PORRB_POR07                            *((volatile unsigned int*)(0x42A7035CUL))
#define bM4_PORT_PORRB_POR08                            *((volatile unsigned int*)(0x42A70360UL))
#define bM4_PORT_PORRB_POR09                            *((volatile unsigned int*)(0x42A70364UL))
#define bM4_PORT_PORRB_POR10                            *((volatile unsigned int*)(0x42A70368UL))
#define bM4_PORT_PORRB_POR11                            *((volatile unsigned int*)(0x42A7036CUL))
#define bM4_PORT_PORRB_POR12                            *((volatile unsigned int*)(0x42A70370UL))
#define bM4_PORT_PORRB_POR13                            *((volatile unsigned int*)(0x42A70374UL))
#define bM4_PORT_PORRB_POR14                            *((volatile unsigned int*)(0x42A70378UL))
#define bM4_PORT_PORRB_POR15                            *((volatile unsigned int*)(0x42A7037CUL))
#define bM4_PORT_POTRB_POT00                            *((volatile unsigned int*)(0x42A70380UL))
#define bM4_PORT_POTRB_POT01                            *((volatile unsigned int*)(0x42A70384UL))
