CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_PORT_PFSRA7_FSEL5                           *((volatile unsigned int*)(0x42A783D4UL))
#define bM4_PORT_PFSRA7_BFE                             *((volatile unsigned int*)(0x42A783E0UL))
#define bM4_PORT_PCRA8_POUT                             *((volatile unsigned int*)(0x42A78400UL))
#define bM4_PORT_PCRA8_POUTE                            *((volatile unsigned int*)(0x42A78404UL))
#define bM4_PORT_PCRA8_NOD                              *((volatile unsigned int*)(0x42A78408UL))
#define bM4_PORT_PCRA8_DRV0                             *((volatile unsigned int*)(0x42A78410UL))
#define bM4_PORT_PCRA8_DRV1                             *((volatile unsigned int*)(0x42A78414UL))
#define bM4_PORT_PCRA8_PUU                              *((volatile unsigned int*)(0x42A78418UL))
#define bM4_PORT_PCRA8_PIN                              *((volatile unsigned int*)(0x42A78420UL))
#define bM4_PORT_PCRA8_INVE                             *((volatile unsigned int*)(0x42A78424UL))
#define bM4_PORT_PCRA8_INTE                             *((volatile unsigned int*)(0x42A78430UL))
#define bM4_PORT_PCRA8_LTE                              *((volatile unsigned int*)(0x42A78438UL))
#define bM4_PORT_PCRA8_DDIS                             *((volatile unsigned int*)(0x42A7843CUL))
#define bM4_PORT_PFSRA8_FSEL0                           *((volatile unsigned int*)(0x42A78440UL))
#define bM4_PORT_PFSRA8_FSEL1                           *((volatile unsigned int*)(0x42A78444UL))
#define bM4_PORT_PFSRA8_FSEL2                           *((volatile unsigned int*)(0x42A78448UL))
#define bM4_PORT_PFSRA8_FSEL3                           *((volatile unsigned int*)(0x42A7844CUL))
#define bM4_PORT_PFSRA8_FSEL4                           *((volatile unsigned int*)(0x42A78450UL))
#define bM4_PORT_PFSRA8_FSEL5                           *((volatile unsigned int*)(0x42A78454UL))
#define bM4_PORT_PFSRA8_BFE                             *((volatile unsigned int*)(0x42A78460UL))
#define bM4_PORT_PCRA9_POUT                             *((volatile unsigned int*)(0x42A78480UL))
#define bM4_PORT_PCRA9_POUTE                            *((volatile unsigned int*)(0x42A78484UL))
#define bM4_PORT_PCRA9_NOD                              *((volatile unsigned int*)(0x42A78488UL))
#define bM4_PORT_PCRA9_DRV0                             *((volatile unsigned int*)(0x42A78490UL))
#define bM4_PORT_PCRA9_DRV1                             *((volatile unsigned int*)(0x42A78494UL))
#define bM4_PORT_PCRA9_PUU                              *((volatile unsigned int*)(0x42A78498UL))
#define bM4_PORT_PCRA9_PIN                              *((volatile unsigned int*)(0x42A784A0UL))
#define bM4_PORT_PCRA9_INVE                             *((volatile unsigned int*)(0x42A784A4UL))
#define bM4_PORT_PCRA9_INTE                             *((volatile unsigned int*)(0x42A784B0UL))
#define bM4_PORT_PCRA9_LTE                              *((volatile unsigned int*)(0x42A784B8UL))
#define bM4_PORT_PCRA9_DDIS                             *((volatile unsigned int*)(0x42A784BCUL))
#define bM4_PORT_PFSRA9_FSEL0                           *((volatile unsigned int*)(0x42A784C0UL))
#define bM4_PORT_PFSRA9_FSEL1                           *((volatile unsigned int*)(0x42A784C4UL))
#define bM4_PORT_PFSRA9_FSEL2                           *((volatile unsigned int*)(0x42A784C8UL))
#define bM4_PORT_PFSRA9_FSEL3                           *((volatile unsigned int*)(0x42A784CCUL))
#define bM4_PORT_PFSRA9_FSEL4                           *((volatile unsigned int*)(0x42A784D0UL))
#define bM4_PORT_PFSRA9_FSEL5                           *((volatile unsigned int*)(0x42A784D4UL))
#define bM4_PORT_PFSRA9_BFE                             *((volatile unsigned int*)(0x42A784E0UL))
#define bM4_PORT_PCRA10_POUT                            *((volatile unsigned int*)(0x42A78500UL))
#define bM4_PORT_PCRA10_POUTE                           *((volatile unsigned int*)(0x42A78504UL))
#define bM4_PORT_PCRA10_NOD                             *((volatile unsigned int*)(0x42A78508UL))
#define bM4_PORT_PCRA10_DRV0                            *((volatile unsigned int*)(0x42A78510UL))
#define bM4_PORT_PCRA10_DRV1                            *((volatile unsigned int*)(0x42A78514UL))
#define bM4_PORT_PCRA10_PUU                             *((volatile unsigned int*)(0x42A78518UL))
#define bM4_PORT_PCRA10_PIN                             *((volatile unsigned int*)(0x42A78520UL))
#define bM4_PORT_PCRA10_INVE                            *((volatile unsigned int*)(0x42A78524UL))
#define bM4_PORT_PCRA10_INTE                            *((volatile unsigned int*)(0x42A78530UL))
#define bM4_PORT_PCRA10_LTE                             *((volatile unsigned int*)(0x42A78538UL))
#define bM4_PORT_PCRA10_DDIS                            *((volatile unsigned int*)(0x42A7853CUL))
#define bM4_PORT_PFSRA10_FSEL0                          *((volatile unsigned int*)(0x42A78540UL))
#define bM4_PORT_PFSRA10_FSEL1                          *((volatile unsigned int*)(0x42A78544UL))
#define bM4_PORT_PFSRA10_FSEL2                          *((volatile unsigned int*)(0x42A78548UL))
#define bM4_PORT_PFSRA10_FSEL3                          *((volatile unsigned int*)(0x42A7854CUL))
#define bM4_PORT_PFSRA10_FSEL4                          *((volatile unsigned int*)(0x42A78550UL))
#define bM4_PORT_PFSRA10_FSEL5                          *((volatile unsigned int*)(0x42A78554UL))
#define bM4_PORT_PFSRA10_BFE                            *((volatile unsigned int*)(0x42A78560UL))
#define bM4_PORT_PCRA11_POUT                            *((volatile unsigned int*)(0x42A78580UL))
#define bM4_PORT_PCRA11_POUTE                           *((volatile unsigned int*)(0x42A78584UL))
#define bM4_PORT_PCRA11_NOD                             *((volatile unsigned int*)(0x42A78588UL))
#define bM4_PORT_PCRA11_DRV0                            *((volatile unsigned int*)(0x42A78590UL))
#define bM4_PORT_PCRA11_DRV1                            *((volatile unsigned int*)(0x42A78594UL))
#define bM4_PORT_PCRA11_PUU                             *((volatile unsigned int*)(0x42A78598UL))
#define bM4_PORT_PCRA11_PIN                             *((volatile unsigned int*)(0x42A785A0UL))
#define bM4_PORT_PCRA11_INVE                            *((volatile unsigned int*)(0x42A785A4UL))
#define bM4_PORT_PCRA11_INTE                            *((volatile unsigned int*)(0x42A785B0UL))
#define bM4_PORT_PCRA11_LTE                             *((volatile unsigned int*)(0x42A785B8UL))
#define bM4_PORT_PCRA11_DDIS                            *((volatile unsigned int*)(0x42A785BCUL))
#define bM4_PORT_PFSRA11_FSEL0                          *((volatile unsigned int*)(0x42A785C0UL))
#define bM4_PORT_PFSRA11_FSEL1                          *((volatile unsigned int*)(0x42A785C4UL))
#define bM4_PORT_PFSRA11_FSEL2                          *((volatile unsigned int*)(0x42A785C8UL))
#define bM4_PORT_PFSRA11_FSEL3                          *((volatile unsigned int*)(0x42A785CCUL))
#define bM4_PORT_PFSRA11_FSEL4                          *((volatile unsigned int*)(0x42A785D0UL))
#define bM4_PORT_PFSRA11_FSEL5                          *((volatile unsigned int*)(0x42A785D4UL))
#define bM4_PORT_PFSRA11_BFE                            *((volatile unsigned int*)(0x42A785E0UL))
#define bM4_PORT_PCRA12_POUT                            *((volatile unsigned int*)(0x42A78600UL))
#define bM4_PORT_PCRA12_POUTE                           *((volatile unsigned int*)(0x42A78604UL))
#define bM4_PORT_PCRA12_NOD                             *((volatile unsigned int*)(0x42A78608UL))
#define bM4_PORT_PCRA12_DRV0                            *((volatile unsigned int*)(0x42A78610UL))
#define bM4_PORT_PCRA12_DRV1                            *((volatile unsigned int*)(0x42A78614UL))
#define bM4_PORT_PCRA12_PUU                             *((volatile unsigned int*)(0x42A78618UL))
#define bM4_PORT_PCRA12_PIN                             *((volatile unsigned int*)(0x42A78620UL))
#define bM4_PORT_PCRA12_INVE                            *((volatile unsigned int*)(0x42A78624UL))
#define bM4_PORT_PCRA12_INTE                            *((volatile unsigned int*)(0x42A78630UL))
#define bM4_PORT_PCRA12_LTE                             *((volatile unsigned int*)(0x42A78638UL))
#define bM4_PORT_PCRA12_DDIS                            *((volatile unsigned int*)(0x42A7863CUL))
#define bM4_PORT_PFSRA12_FSEL0                          *((volatile unsigned int*)(0x42A78640UL))
#define bM4_PORT_PFSRA12_FSEL1                          *((volatile unsigned int*)(0x42A78644UL))
#define bM4_PORT_PFSRA12_FSEL2                          *((volatile unsigned int*)(0x42A78648UL))
#define bM4_PORT_PFSRA12_FSEL3                          *((volatile unsigned int*)(0x42A7864CUL))
#define bM4_PORT_PFSRA12_FSEL4                          *((volatile unsigned int*)(0x42A78650UL))
#define bM4_PORT_PFSRA12_FSEL5                          *((volatile unsigned int*)(0x42A78654UL))
#define bM4_PORT_PFSRA12_BFE                            *((volatile unsigned int*)(0x42A78660UL))
#define bM4_PORT_PCRA13_POUT                            *((volatile unsigned int*)(0x42A78680UL))
#define bM4_PORT_PCRA13_POUTE                           *((volatile unsigned int*)(0x42A78684UL))
#define bM4_PORT_PCRA13_NOD                             *((volatile unsigned int*)(0x42A78688UL))
#define bM4_PORT_PCRA13_DRV0                            *((volatile unsigned int*)(0x42A78690UL))
#define bM4_PORT_PCRA13_DRV1                            *((volatile unsigned int*)(0x42A78694UL))
#define bM4_PORT_PCRA13_PUU                             *((volatile unsigned int*)(0x42A78698UL))
#define bM4_PORT_PCRA13_PIN                             *((volatile unsigned int*)(0x42A786A0UL))
#define bM4_PORT_PCRA13_INVE                            *((volatile unsigned int*)(0x42A786A4UL))
#define bM4_PORT_PCRA13_INTE                            *((volatile unsigned int*)(0x42A786B0UL))
#define bM4_PORT_PCRA13_LTE                             *((volatile unsigned int*)(0x42A786B8UL))
#define bM4_PORT_PCRA13_DDIS                            *((volatile unsigned int*)(0x42A786BCUL))
#define bM4_PORT_PFSRA13_FSEL0                          *((volatile unsigned int*)(0x42A786C0UL))
#define bM4_PORT_PFSRA13_FSEL1                          *((volatile unsigned int*)(0x42A786C4UL))
#define bM4_PORT_PFSRA13_FSEL2                          *((volatile unsigned int*)(0x42A786C8UL))
#define bM4_PORT_PFSRA13_FSEL3                          *((volatile unsigned int*)(0x42A786CCUL))
#define bM4_PORT_PFSRA13_FSEL4                          *((volatile unsigned int*)(0x42A786D0UL))
#define bM4_PORT_PFSRA13_FSEL5                          *((volatile unsigned int*)(0x42A786D4UL))
#define bM4_PORT_PFSRA13_BFE                            *((volatile unsigned int*)(0x42A786E0UL))
#define bM4_PORT_PCRA14_POUT                            *((volatile unsigned int*)(0x42A78700UL))
#define bM4_PORT_PCRA14_POUTE                           *((volatile unsigned int*)(0x42A78704UL))
#define bM4_PORT_PCRA14_NOD                             *((volatile unsigned int*)(0x42A78708UL))
#define bM4_PORT_PCRA14_DRV0                            *((volatile unsigned int*)(0x42A78710UL))
#define bM4_PORT_PCRA14_DRV1                            *((volatile unsigned int*)(0x42A78714UL))
#define bM4_PORT_PCRA14_PUU                             *((volatile unsigned int*)(0x42A78718UL))
#define bM4_PORT_PCRA14_PIN                             *((volatile unsigned int*)(0x42A78720UL))
#define bM4_PORT_PCRA14_INVE                            *((volatile unsigned int*)(0x42A78724UL))
#define bM4_PORT_PCRA14_INTE                            *((volatile unsigned int*)(0x42A78730UL))
#define bM4_PORT_PCRA14_LTE                             *((volatile unsigned int*)(0x42A78738UL))
#define bM4_PORT_PCRA14_DDIS                            *((volatile unsigned int*)(0x42A7873CUL))
#define bM4_PORT_PFSRA14_FSEL0                          *((volatile unsigned int*)(0x42A78740UL))
#define bM4_PORT_PFSRA14_FSEL1                          *((volatile unsigned int*)(0x42A78744UL))
#define bM4_PORT_PFSRA14_FSEL2                          *((volatile unsigned int*)(0x42A78748UL))
#define bM4_PORT_PFSRA14_FSEL3                          *((volatile unsigned int*)(0x42A7874CUL))
#define bM4_PORT_PFSRA14_FSEL4                          *((volatile unsigned int*)(0x42A78750UL))
#define bM4_PORT_PFSRA14_FSEL5                          *((volatile unsigned int*)(0x42A78754UL))
#define bM4_PORT_PFSRA14_BFE                            *((volatile unsigned int*)(0x42A78760UL))
#define bM4_PORT_PCRA15_POUT                            *((volatile unsigned int*)(0x42A78780UL))
#define bM4_PORT_PCRA15_POUTE                           *((volatile unsigned int*)(0x42A78784UL))
#define bM4_PORT_PCRA15_NOD                             *((volatile unsigned int*)(0x42A78788UL))
#define bM4_PORT_PCRA15_DRV0                            *((volatile unsigned int*)(0x42A78790UL))
#define bM4_PORT_PCRA15_DRV1                            *((volatile unsigned int*)(0x42A78794UL))
#define bM4_PORT_PCRA15_PUU                             *((volatile unsigned int*)(0x42A78798UL))
#define bM4_PORT_PCRA15_PIN                             *((volatile unsigned int*)(0x42A787A0UL))
#define bM4_PORT_PCRA15_INVE                            *((volatile unsigned int*)(0x42A787A4UL))
#define bM4_PORT_PCRA15_INTE                            *((volatile unsigned int*)(0x42A787B0UL))
#define bM4_PORT_PCRA15_LTE                             *((volatile unsigned int*)(0x42A787B8UL))
#define bM4_PORT_PCRA15_DDIS                            *((volatile unsigned int*)(0x42A787BCUL))
#define bM4_PORT_PFSRA15_FSEL0                          *((volatile unsigned int*)(0x42A787C0UL))
#define bM4_PORT_PFSRA15_FSEL1                          *((volatile unsigned int*)(0x42A787C4UL))
#define bM4_PORT_PFSRA15_FSEL2                          *((volatile unsigned int*)(0x42A787C8UL))
#define bM4_PORT_PFSRA15_FSEL3                          *((volatile unsigned int*)(0x42A787CCUL))
#define bM4_PORT_PFSRA15_FSEL4                          *((volatile unsigned int*)(0x42A787D0UL))
#define bM4_PORT_PFSRA15_FSEL5                          *((volatile unsigned int*)(0x42A787D4UL))
#define bM4_PORT_PFSRA15_BFE                            *((volatile unsigned int*)(0x42A787E0UL))
#define bM4_PORT_PCRB0_POUT                             *((volatile unsigned int*)(0x42A78800UL))
#define bM4_PORT_PCRB0_POUTE                            *((volatile unsigned int*)(0x42A78804UL))
#define bM4_PORT_PCRB0_NOD                              *((volatile unsigned int*)(0x42A78808UL))
#define bM4_PORT_PCRB0_DRV0                             *((volatile unsigned int*)(0x42A78810UL))
#define bM4_PORT_PCRB0_DRV1                             *((volatile unsigned int*)(0x42A78814UL))
#define bM4_PORT_PCRB0_PUU                              *((volatile unsigned int*)(0x42A78818UL))
#define bM4_PORT_PCRB0_PIN                              *((volatile unsigned int*)(0x42A78820UL))
#define bM4_PORT_PCRB0_INVE                             *((volatile unsigned int*)(0x42A78824UL))
#define bM4_PORT_PCRB0_INTE                             *((volatile unsigned int*)(0x42A78830UL))
#define bM4_PORT_PCRB0_LTE                              *((volatile unsigned int*)(0x42A78838UL))
#define bM4_PORT_PCRB0_DDIS                             *((volatile unsigned int*)(0x42A7883CUL))
#define bM4_PORT_PFSRB0_FSEL0                           *((volatile unsigned int*)(0x42A78840UL))
#define bM4_PORT_PFSRB0_FSEL1                           *((volatile unsigned int*)(0x42A78844UL))
#define bM4_PORT_PFSRB0_FSEL2                           *((volatile unsigned int*)(0x42A78848UL))
#define bM4_PORT_PFSRB0_FSEL3                           *((volatile unsigned int*)(0x42A7884CUL))
#define bM4_PORT_PFSRB0_FSEL4                           *((volatile unsigned int*)(0x42A78850UL))
#define bM4_PORT_PFSRB0_FSEL5                           *((volatile unsigned int*)(0x42A78854UL))
#define bM4_PORT_PFSRB0_BFE                             *((volatile unsigned int*)(0x42A78860UL))
#define bM4_PORT_PCRB1_POUT                             *((volatile unsigned int*)(0x42A78880UL))
#define bM4_PORT_PCRB1_POUTE                            *((volatile unsigned int*)(0x42A78884UL))
#define bM4_PORT_PCRB1_NOD                              *((volatile unsigned int*)(0x42A78888UL))
#define bM4_PORT_PCRB1_DRV0                             *((volatile unsigned int*)(0x42A78890UL))
#define bM4_PORT_PCRB1_DRV1                             *((volatile unsigned int*)(0x42A78894UL))
#define bM4_PORT_PCRB1_PUU                              *((volatile unsigned int*)(0x42A78898UL))
#define bM4_PORT_PCRB1_PIN                              *((volatile unsigned int*)(0x42A788A0UL))
#define bM4_PORT_PCRB1_INVE                             *((volatile unsigned int*)(0x42A788A4UL))
#define bM4_PORT_PCRB1_INTE                             *((volatile unsigned int*)(0x42A788B0UL))
#define bM4_PORT_PCRB1_LTE                              *((volatile unsigned int*)(0x42A788B8UL))
#define bM4_PORT_PCRB1_DDIS                             *((volatile unsigned int*)(0x42A788BCUL))
#define bM4_PORT_PFSRB1_FSEL0                           *((volatile unsigned int*)(0x42A788C0UL))
#define bM4_PORT_PFSRB1_FSEL1                           *((volatile unsigned int*)(0x42A788C4UL))
#define bM4_PORT_PFSRB1_FSEL2                           *((volatile unsigned int*)(0x42A788C8UL))
#define bM4_PORT_PFSRB1_FSEL3                           *((volatile unsigned int*)(0x42A788CCUL))
#define bM4_PORT_PFSRB1_FSEL4                           *((volatile unsigned int*)(0x42A788D0UL))
#define bM4_PORT_PFSRB1_FSEL5                           *((volatile unsigned int*)(0x42A788D4UL))
#define bM4_PORT_PFSRB1_BFE                             *((volatile unsigned int*)(0x42A788E0UL))
#define bM4_PORT_PCRB2_POUT                             *((volatile unsigned int*)(0x42A78900UL))
#define bM4_PORT_PCRB2_POUTE                            *((volatile unsigned int*)(0x42A78904UL))
#define bM4_PORT_PCRB2_NOD                              *((volatile unsigned int*)(0x42A78908UL))
#define bM4_PORT_PCRB2_DRV0                             *((volatile unsigned int*)(0x42A78910UL))
#define bM4_PORT_PCRB2_DRV1                             *((volatile unsigned int*)(0x42A78914UL))
#define bM4_PORT_PCRB2_PUU                              *((volatile unsigned int*)(0x42A78918UL))
#define bM4_PORT_PCRB2_PIN                              *((volatile unsigned int*)(0x42A78920UL))
#define bM4_PORT_PCRB2_INVE                             *((volatile unsigned int*)(0x42A78924UL))
#define bM4_PORT_PCRB2_INTE                             *((volatile unsigned int*)(0x42A78930UL))
#define bM4_PORT_PCRB2_LTE                              *((volatile unsigned int*)(0x42A78938UL))
#define bM4_PORT_PCRB2_DDIS                             *((volatile unsigned int*)(0x42A7893CUL))
#define bM4_PORT_PFSRB2_FSEL0                           *((volatile unsigned int*)(0x42A78940UL))
#define bM4_PORT_PFSRB2_FSEL1                           *((volatile unsigned int*)(0x42A78944UL))
#define bM4_PORT_PFSRB2_FSEL2                           *((volatile unsigned int*)(0x42A78948UL))
#define bM4_PORT_PFSRB2_FSEL3                           *((volatile unsigned int*)(0x42A7894CUL))
#define bM4_PORT_PFSRB2_FSEL4                           *((volatile unsigned int*)(0x42A78950UL))
#define bM4_PORT_PFSRB2_FSEL5                           *((volatile unsigned int*)(0x42A78954UL))
#define bM4_PORT_PFSRB2_BFE                             *((volatile unsigned int*)(0x42A78960UL))
#define bM4_PORT_PCRB3_POUT                             *((volatile unsigned int*)(0x42A78980UL))
#define bM4_PORT_PCRB3_POUTE                            *((volatile unsigned int*)(0x42A78984UL))
#define bM4_PORT_PCRB3_NOD                              *((volatile unsigned int*)(0x42A78988UL))
#define bM4_PORT_PCRB3_DRV0                             *((volatile unsigned int*)(0x42A78990UL))
#define bM4_PORT_PCRB3_DRV1                             *((volatile unsigned int*)(0x42A78994UL))
#define bM4_PORT_PCRB3_PUU                              *((volatile unsigned int*)(0x42A78998UL))
#define bM4_PORT_PCRB3_PIN                              *((volatile unsigned int*)(0x42A789A0UL))
#define bM4_PORT_PCRB3_INVE                             *((volatile unsigned int*)(0x42A789A4UL))
#define bM4_PORT_PCRB3_INTE                             *((volatile unsigned int*)(0x42A789B0UL))
#define bM4_PORT_PCRB3_LTE                              *((volatile unsigned int*)(0x42A789B8UL))
#define bM4_PORT_PCRB3_DDIS                             *((volatile unsigned int*)(0x42A789BCUL))
#define bM4_PORT_PFSRB3_FSEL0                           *((volatile unsigned int*)(0x42A789C0UL))
#define bM4_PORT_PFSRB3_FSEL1                           *((volatile unsigned int*)(0x42A789C4UL))
#define bM4_PORT_PFSRB3_FSEL2                           *((volatile unsigned int*)(0x42A789C8UL))
#define bM4_PORT_PFSRB3_FSEL3                           *((volatile unsigned int*)(0x42A789CCUL))
#define bM4_PORT_PFSRB3_FSEL4                           *((volatile unsigned int*)(0x42A789D0UL))
#define bM4_PORT_PFSRB3_FSEL5                           *((volatile unsigned int*)(0x42A789D4UL))
#define bM4_PORT_PFSRB3_BFE                             *((volatile unsigned int*)(0x42A789E0UL))
#define bM4_PORT_PCRB4_POUT                             *((volatile unsigned int*)(0x42A78A00UL))
#define bM4_PORT_PCRB4_POUTE                            *((volatile unsigned int*)(0x42A78A04UL))
#define bM4_PORT_PCRB4_NOD                              *((volatile unsigned int*)(0x42A78A08UL))
#define bM4_PORT_PCRB4_DRV0                             *((volatile unsigned int*)(0x42A78A10UL))
#define bM4_PORT_PCRB4_DRV1                             *((volatile unsigned int*)(0x42A78A14UL))
#define bM4_PORT_PCRB4_PUU                              *((volatile unsigned int*)(0x42A78A18UL))
#define bM4_PORT_PCRB4_PIN                              *((volatile unsigned int*)(0x42A78A20UL))
#define bM4_PORT_PCRB4_INVE                             *((volatile unsigned int*)(0x42A78A24UL))
#define bM4_PORT_PCRB4_INTE                             *((volatile unsigned int*)(0x42A78A30UL))
#define bM4_PORT_PCRB4_LTE                              *((volatile unsigned int*)(0x42A78A38UL))
#define bM4_PORT_PCRB4_DDIS                             *((volatile unsigned int*)(0x42A78A3CUL))
#define bM4_PORT_PFSRB4_FSEL0                           *((volatile unsigned int*)(0x42A78A40UL))
#define bM4_PORT_PFSRB4_FSEL1                           *((volatile unsigned int*)(0x42A78A44UL))
#define bM4_PORT_PFSRB4_FSEL2                           *((volatile unsigned int*)(0x42A78A48UL))
#define bM4_PORT_PFSRB4_FSEL3                           *((volatile unsigned int*)(0x42A78A4CUL))
#define bM4_PORT_PFSRB4_FSEL4                           *((volatile unsigned int*)(0x42A78A50UL))
#define bM4_PORT_PFSRB4_FSEL5                           *((volatile unsigned int*)(0x42A78A54UL))
#define bM4_PORT_PFSRB4_BFE                             *((volatile unsigned int*)(0x42A78A60UL))
#define bM4_PORT_PCRB5_POUT                             *((volatile unsigned int*)(0x42A78A80UL))
#define bM4_PORT_PCRB5_POUTE                            *((volatile unsigned int*)(0x42A78A84UL))
#define bM4_PORT_PCRB5_NOD                              *((volatile unsigned int*)(0x42A78A88UL))
#define bM4_PORT_PCRB5_DRV0                             *((volatile unsigned int*)(0x42A78A90UL))
#define bM4_PORT_PCRB5_DRV1                             *((volatile unsigned int*)(0x42A78A94UL))
#define bM4_PORT_PCRB5_PUU                              *((volatile unsigned int*)(0x42A78A98UL))
#define bM4_PORT_PCRB5_PIN                              *((volatile unsigned int*)(0x42A78AA0UL))
#define bM4_PORT_PCRB5_INVE                             *((volatile unsigned int*)(0x42A78AA4UL))
