CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_PORT_PCRD0_DDIS                             *((volatile unsigned int*)(0x42A7983CUL))
#define bM4_PORT_PFSRD0_FSEL0                           *((volatile unsigned int*)(0x42A79840UL))
#define bM4_PORT_PFSRD0_FSEL1                           *((volatile unsigned int*)(0x42A79844UL))
#define bM4_PORT_PFSRD0_FSEL2                           *((volatile unsigned int*)(0x42A79848UL))
#define bM4_PORT_PFSRD0_FSEL3                           *((volatile unsigned int*)(0x42A7984CUL))
#define bM4_PORT_PFSRD0_FSEL4                           *((volatile unsigned int*)(0x42A79850UL))
#define bM4_PORT_PFSRD0_FSEL5                           *((volatile unsigned int*)(0x42A79854UL))
#define bM4_PORT_PFSRD0_BFE                             *((volatile unsigned int*)(0x42A79860UL))
#define bM4_PORT_PCRD1_POUT                             *((volatile unsigned int*)(0x42A79880UL))
#define bM4_PORT_PCRD1_POUTE                            *((volatile unsigned int*)(0x42A79884UL))
#define bM4_PORT_PCRD1_NOD                              *((volatile unsigned int*)(0x42A79888UL))
#define bM4_PORT_PCRD1_DRV0                             *((volatile unsigned int*)(0x42A79890UL))
#define bM4_PORT_PCRD1_DRV1                             *((volatile unsigned int*)(0x42A79894UL))
#define bM4_PORT_PCRD1_PUU                              *((volatile unsigned int*)(0x42A79898UL))
#define bM4_PORT_PCRD1_PIN                              *((volatile unsigned int*)(0x42A798A0UL))
#define bM4_PORT_PCRD1_INVE                             *((volatile unsigned int*)(0x42A798A4UL))
#define bM4_PORT_PCRD1_INTE                             *((volatile unsigned int*)(0x42A798B0UL))
#define bM4_PORT_PCRD1_LTE                              *((volatile unsigned int*)(0x42A798B8UL))
#define bM4_PORT_PCRD1_DDIS                             *((volatile unsigned int*)(0x42A798BCUL))
#define bM4_PORT_PFSRD1_FSEL0                           *((volatile unsigned int*)(0x42A798C0UL))
#define bM4_PORT_PFSRD1_FSEL1                           *((volatile unsigned int*)(0x42A798C4UL))
#define bM4_PORT_PFSRD1_FSEL2                           *((volatile unsigned int*)(0x42A798C8UL))
#define bM4_PORT_PFSRD1_FSEL3                           *((volatile unsigned int*)(0x42A798CCUL))
#define bM4_PORT_PFSRD1_FSEL4                           *((volatile unsigned int*)(0x42A798D0UL))
#define bM4_PORT_PFSRD1_FSEL5                           *((volatile unsigned int*)(0x42A798D4UL))
#define bM4_PORT_PFSRD1_BFE                             *((volatile unsigned int*)(0x42A798E0UL))
#define bM4_PORT_PCRD2_POUT                             *((volatile unsigned int*)(0x42A79900UL))
#define bM4_PORT_PCRD2_POUTE                            *((volatile unsigned int*)(0x42A79904UL))
#define bM4_PORT_PCRD2_NOD                              *((volatile unsigned int*)(0x42A79908UL))
#define bM4_PORT_PCRD2_DRV0                             *((volatile unsigned int*)(0x42A79910UL))
#define bM4_PORT_PCRD2_DRV1                             *((volatile unsigned int*)(0x42A79914UL))
#define bM4_PORT_PCRD2_PUU                              *((volatile unsigned int*)(0x42A79918UL))
#define bM4_PORT_PCRD2_PIN                              *((volatile unsigned int*)(0x42A79920UL))
#define bM4_PORT_PCRD2_INVE                             *((volatile unsigned int*)(0x42A79924UL))
#define bM4_PORT_PCRD2_INTE                             *((volatile unsigned int*)(0x42A79930UL))
#define bM4_PORT_PCRD2_LTE                              *((volatile unsigned int*)(0x42A79938UL))
#define bM4_PORT_PCRD2_DDIS                             *((volatile unsigned int*)(0x42A7993CUL))
#define bM4_PORT_PFSRD2_FSEL0                           *((volatile unsigned int*)(0x42A79940UL))
#define bM4_PORT_PFSRD2_FSEL1                           *((volatile unsigned int*)(0x42A79944UL))
#define bM4_PORT_PFSRD2_FSEL2                           *((volatile unsigned int*)(0x42A79948UL))
#define bM4_PORT_PFSRD2_FSEL3                           *((volatile unsigned int*)(0x42A7994CUL))
#define bM4_PORT_PFSRD2_FSEL4                           *((volatile unsigned int*)(0x42A79950UL))
#define bM4_PORT_PFSRD2_FSEL5                           *((volatile unsigned int*)(0x42A79954UL))
#define bM4_PORT_PFSRD2_BFE                             *((volatile unsigned int*)(0x42A79960UL))
#define bM4_PORT_PCRD3_POUT                             *((volatile unsigned int*)(0x42A79980UL))
#define bM4_PORT_PCRD3_POUTE                            *((volatile unsigned int*)(0x42A79984UL))
#define bM4_PORT_PCRD3_NOD                              *((volatile unsigned int*)(0x42A79988UL))
#define bM4_PORT_PCRD3_DRV0                             *((volatile unsigned int*)(0x42A79990UL))
#define bM4_PORT_PCRD3_DRV1                             *((volatile unsigned int*)(0x42A79994UL))
#define bM4_PORT_PCRD3_PUU                              *((volatile unsigned int*)(0x42A79998UL))
#define bM4_PORT_PCRD3_PIN                              *((volatile unsigned int*)(0x42A799A0UL))
#define bM4_PORT_PCRD3_INVE                             *((volatile unsigned int*)(0x42A799A4UL))
#define bM4_PORT_PCRD3_INTE                             *((volatile unsigned int*)(0x42A799B0UL))
#define bM4_PORT_PCRD3_LTE                              *((volatile unsigned int*)(0x42A799B8UL))
#define bM4_PORT_PCRD3_DDIS                             *((volatile unsigned int*)(0x42A799BCUL))
#define bM4_PORT_PFSRD3_FSEL0                           *((volatile unsigned int*)(0x42A799C0UL))
#define bM4_PORT_PFSRD3_FSEL1                           *((volatile unsigned int*)(0x42A799C4UL))
#define bM4_PORT_PFSRD3_FSEL2                           *((volatile unsigned int*)(0x42A799C8UL))
#define bM4_PORT_PFSRD3_FSEL3                           *((volatile unsigned int*)(0x42A799CCUL))
#define bM4_PORT_PFSRD3_FSEL4                           *((volatile unsigned int*)(0x42A799D0UL))
#define bM4_PORT_PFSRD3_FSEL5                           *((volatile unsigned int*)(0x42A799D4UL))
#define bM4_PORT_PFSRD3_BFE                             *((volatile unsigned int*)(0x42A799E0UL))
#define bM4_PORT_PCRD4_POUT                             *((volatile unsigned int*)(0x42A79A00UL))
#define bM4_PORT_PCRD4_POUTE                            *((volatile unsigned int*)(0x42A79A04UL))
#define bM4_PORT_PCRD4_NOD                              *((volatile unsigned int*)(0x42A79A08UL))
#define bM4_PORT_PCRD4_DRV0                             *((volatile unsigned int*)(0x42A79A10UL))
#define bM4_PORT_PCRD4_DRV1                             *((volatile unsigned int*)(0x42A79A14UL))
#define bM4_PORT_PCRD4_PUU                              *((volatile unsigned int*)(0x42A79A18UL))
#define bM4_PORT_PCRD4_PIN                              *((volatile unsigned int*)(0x42A79A20UL))
#define bM4_PORT_PCRD4_INVE                             *((volatile unsigned int*)(0x42A79A24UL))
#define bM4_PORT_PCRD4_INTE                             *((volatile unsigned int*)(0x42A79A30UL))
#define bM4_PORT_PCRD4_LTE                              *((volatile unsigned int*)(0x42A79A38UL))
#define bM4_PORT_PCRD4_DDIS                             *((volatile unsigned int*)(0x42A79A3CUL))
#define bM4_PORT_PFSRD4_FSEL0                           *((volatile unsigned int*)(0x42A79A40UL))
#define bM4_PORT_PFSRD4_FSEL1                           *((volatile unsigned int*)(0x42A79A44UL))
#define bM4_PORT_PFSRD4_FSEL2                           *((volatile unsigned int*)(0x42A79A48UL))
#define bM4_PORT_PFSRD4_FSEL3                           *((volatile unsigned int*)(0x42A79A4CUL))
#define bM4_PORT_PFSRD4_FSEL4                           *((volatile unsigned int*)(0x42A79A50UL))
#define bM4_PORT_PFSRD4_FSEL5                           *((volatile unsigned int*)(0x42A79A54UL))
#define bM4_PORT_PFSRD4_BFE                             *((volatile unsigned int*)(0x42A79A60UL))
#define bM4_PORT_PCRD5_POUT                             *((volatile unsigned int*)(0x42A79A80UL))
#define bM4_PORT_PCRD5_POUTE                            *((volatile unsigned int*)(0x42A79A84UL))
#define bM4_PORT_PCRD5_NOD                              *((volatile unsigned int*)(0x42A79A88UL))
#define bM4_PORT_PCRD5_DRV0                             *((volatile unsigned int*)(0x42A79A90UL))
#define bM4_PORT_PCRD5_DRV1                             *((volatile unsigned int*)(0x42A79A94UL))
#define bM4_PORT_PCRD5_PUU                              *((volatile unsigned int*)(0x42A79A98UL))
#define bM4_PORT_PCRD5_PIN                              *((volatile unsigned int*)(0x42A79AA0UL))
#define bM4_PORT_PCRD5_INVE                             *((volatile unsigned int*)(0x42A79AA4UL))
#define bM4_PORT_PCRD5_INTE                             *((volatile unsigned int*)(0x42A79AB0UL))
#define bM4_PORT_PCRD5_LTE                              *((volatile unsigned int*)(0x42A79AB8UL))
#define bM4_PORT_PCRD5_DDIS                             *((volatile unsigned int*)(0x42A79ABCUL))
#define bM4_PORT_PFSRD5_FSEL0                           *((volatile unsigned int*)(0x42A79AC0UL))
#define bM4_PORT_PFSRD5_FSEL1                           *((volatile unsigned int*)(0x42A79AC4UL))
#define bM4_PORT_PFSRD5_FSEL2                           *((volatile unsigned int*)(0x42A79AC8UL))
#define bM4_PORT_PFSRD5_FSEL3                           *((volatile unsigned int*)(0x42A79ACCUL))
#define bM4_PORT_PFSRD5_FSEL4                           *((volatile unsigned int*)(0x42A79AD0UL))
#define bM4_PORT_PFSRD5_FSEL5                           *((volatile unsigned int*)(0x42A79AD4UL))
#define bM4_PORT_PFSRD5_BFE                             *((volatile unsigned int*)(0x42A79AE0UL))
#define bM4_PORT_PCRD6_POUT                             *((volatile unsigned int*)(0x42A79B00UL))
#define bM4_PORT_PCRD6_POUTE                            *((volatile unsigned int*)(0x42A79B04UL))
#define bM4_PORT_PCRD6_NOD                              *((volatile unsigned int*)(0x42A79B08UL))
#define bM4_PORT_PCRD6_DRV0                             *((volatile unsigned int*)(0x42A79B10UL))
#define bM4_PORT_PCRD6_DRV1                             *((volatile unsigned int*)(0x42A79B14UL))
#define bM4_PORT_PCRD6_PUU                              *((volatile unsigned int*)(0x42A79B18UL))
#define bM4_PORT_PCRD6_PIN                              *((volatile unsigned int*)(0x42A79B20UL))
#define bM4_PORT_PCRD6_INVE                             *((volatile unsigned int*)(0x42A79B24UL))
#define bM4_PORT_PCRD6_INTE                             *((volatile unsigned int*)(0x42A79B30UL))
#define bM4_PORT_PCRD6_LTE                              *((volatile unsigned int*)(0x42A79B38UL))
#define bM4_PORT_PCRD6_DDIS                             *((volatile unsigned int*)(0x42A79B3CUL))
#define bM4_PORT_PFSRD6_FSEL0                           *((volatile unsigned int*)(0x42A79B40UL))
#define bM4_PORT_PFSRD6_FSEL1                           *((volatile unsigned int*)(0x42A79B44UL))
#define bM4_PORT_PFSRD6_FSEL2                           *((volatile unsigned int*)(0x42A79B48UL))
#define bM4_PORT_PFSRD6_FSEL3                           *((volatile unsigned int*)(0x42A79B4CUL))
#define bM4_PORT_PFSRD6_FSEL4                           *((volatile unsigned int*)(0x42A79B50UL))
#define bM4_PORT_PFSRD6_FSEL5                           *((volatile unsigned int*)(0x42A79B54UL))
#define bM4_PORT_PFSRD6_BFE                             *((volatile unsigned int*)(0x42A79B60UL))
#define bM4_PORT_PCRD7_POUT                             *((volatile unsigned int*)(0x42A79B80UL))
#define bM4_PORT_PCRD7_POUTE                            *((volatile unsigned int*)(0x42A79B84UL))
#define bM4_PORT_PCRD7_NOD                              *((volatile unsigned int*)(0x42A79B88UL))
#define bM4_PORT_PCRD7_DRV0                             *((volatile unsigned int*)(0x42A79B90UL))
#define bM4_PORT_PCRD7_DRV1                             *((volatile unsigned int*)(0x42A79B94UL))
#define bM4_PORT_PCRD7_PUU                              *((volatile unsigned int*)(0x42A79B98UL))
#define bM4_PORT_PCRD7_PIN                              *((volatile unsigned int*)(0x42A79BA0UL))
#define bM4_PORT_PCRD7_INVE                             *((volatile unsigned int*)(0x42A79BA4UL))
#define bM4_PORT_PCRD7_INTE                             *((volatile unsigned int*)(0x42A79BB0UL))
#define bM4_PORT_PCRD7_LTE                              *((volatile unsigned int*)(0x42A79BB8UL))
#define bM4_PORT_PCRD7_DDIS                             *((volatile unsigned int*)(0x42A79BBCUL))
#define bM4_PORT_PFSRD7_FSEL0                           *((volatile unsigned int*)(0x42A79BC0UL))
#define bM4_PORT_PFSRD7_FSEL1                           *((volatile unsigned int*)(0x42A79BC4UL))
#define bM4_PORT_PFSRD7_FSEL2                           *((volatile unsigned int*)(0x42A79BC8UL))
#define bM4_PORT_PFSRD7_FSEL3                           *((volatile unsigned int*)(0x42A79BCCUL))
#define bM4_PORT_PFSRD7_FSEL4                           *((volatile unsigned int*)(0x42A79BD0UL))
#define bM4_PORT_PFSRD7_FSEL5                           *((volatile unsigned int*)(0x42A79BD4UL))
#define bM4_PORT_PFSRD7_BFE                             *((volatile unsigned int*)(0x42A79BE0UL))
#define bM4_PORT_PCRD8_POUT                             *((volatile unsigned int*)(0x42A79C00UL))
#define bM4_PORT_PCRD8_POUTE                            *((volatile unsigned int*)(0x42A79C04UL))
#define bM4_PORT_PCRD8_NOD                              *((volatile unsigned int*)(0x42A79C08UL))
#define bM4_PORT_PCRD8_DRV0                             *((volatile unsigned int*)(0x42A79C10UL))
#define bM4_PORT_PCRD8_DRV1                             *((volatile unsigned int*)(0x42A79C14UL))
#define bM4_PORT_PCRD8_PUU                              *((volatile unsigned int*)(0x42A79C18UL))
#define bM4_PORT_PCRD8_PIN                              *((volatile unsigned int*)(0x42A79C20UL))
#define bM4_PORT_PCRD8_INVE                             *((volatile unsigned int*)(0x42A79C24UL))
#define bM4_PORT_PCRD8_INTE                             *((volatile unsigned int*)(0x42A79C30UL))
#define bM4_PORT_PCRD8_LTE                              *((volatile unsigned int*)(0x42A79C38UL))
#define bM4_PORT_PCRD8_DDIS                             *((volatile unsigned int*)(0x42A79C3CUL))
#define bM4_PORT_PFSRD8_FSEL0                           *((volatile unsigned int*)(0x42A79C40UL))
#define bM4_PORT_PFSRD8_FSEL1                           *((volatile unsigned int*)(0x42A79C44UL))
#define bM4_PORT_PFSRD8_FSEL2                           *((volatile unsigned int*)(0x42A79C48UL))
#define bM4_PORT_PFSRD8_FSEL3                           *((volatile unsigned int*)(0x42A79C4CUL))
#define bM4_PORT_PFSRD8_FSEL4                           *((volatile unsigned int*)(0x42A79C50UL))
#define bM4_PORT_PFSRD8_FSEL5                           *((volatile unsigned int*)(0x42A79C54UL))
#define bM4_PORT_PFSRD8_BFE                             *((volatile unsigned int*)(0x42A79C60UL))
#define bM4_PORT_PCRD9_POUT                             *((volatile unsigned int*)(0x42A79C80UL))
#define bM4_PORT_PCRD9_POUTE                            *((volatile unsigned int*)(0x42A79C84UL))
#define bM4_PORT_PCRD9_NOD                              *((volatile unsigned int*)(0x42A79C88UL))
#define bM4_PORT_PCRD9_DRV0                             *((volatile unsigned int*)(0x42A79C90UL))
#define bM4_PORT_PCRD9_DRV1                             *((volatile unsigned int*)(0x42A79C94UL))
#define bM4_PORT_PCRD9_PUU                              *((volatile unsigned int*)(0x42A79C98UL))
#define bM4_PORT_PCRD9_PIN                              *((volatile unsigned int*)(0x42A79CA0UL))
#define bM4_PORT_PCRD9_INVE                             *((volatile unsigned int*)(0x42A79CA4UL))
#define bM4_PORT_PCRD9_INTE                             *((volatile unsigned int*)(0x42A79CB0UL))
#define bM4_PORT_PCRD9_LTE                              *((volatile unsigned int*)(0x42A79CB8UL))
#define bM4_PORT_PCRD9_DDIS                             *((volatile unsigned int*)(0x42A79CBCUL))
#define bM4_PORT_PFSRD9_FSEL0                           *((volatile unsigned int*)(0x42A79CC0UL))
#define bM4_PORT_PFSRD9_FSEL1                           *((volatile unsigned int*)(0x42A79CC4UL))
#define bM4_PORT_PFSRD9_FSEL2                           *((volatile unsigned int*)(0x42A79CC8UL))
#define bM4_PORT_PFSRD9_FSEL3                           *((volatile unsigned int*)(0x42A79CCCUL))
#define bM4_PORT_PFSRD9_FSEL4                           *((volatile unsigned int*)(0x42A79CD0UL))
#define bM4_PORT_PFSRD9_FSEL5                           *((volatile unsigned int*)(0x42A79CD4UL))
#define bM4_PORT_PFSRD9_BFE                             *((volatile unsigned int*)(0x42A79CE0UL))
#define bM4_PORT_PCRD10_POUT                            *((volatile unsigned int*)(0x42A79D00UL))
#define bM4_PORT_PCRD10_POUTE                           *((volatile unsigned int*)(0x42A79D04UL))
#define bM4_PORT_PCRD10_NOD                             *((volatile unsigned int*)(0x42A79D08UL))
#define bM4_PORT_PCRD10_DRV0                            *((volatile unsigned int*)(0x42A79D10UL))
#define bM4_PORT_PCRD10_DRV1                            *((volatile unsigned int*)(0x42A79D14UL))
#define bM4_PORT_PCRD10_PUU                             *((volatile unsigned int*)(0x42A79D18UL))
#define bM4_PORT_PCRD10_PIN                             *((volatile unsigned int*)(0x42A79D20UL))
#define bM4_PORT_PCRD10_INVE                            *((volatile unsigned int*)(0x42A79D24UL))
#define bM4_PORT_PCRD10_INTE                            *((volatile unsigned int*)(0x42A79D30UL))
#define bM4_PORT_PCRD10_LTE                             *((volatile unsigned int*)(0x42A79D38UL))
#define bM4_PORT_PCRD10_DDIS                            *((volatile unsigned int*)(0x42A79D3CUL))
#define bM4_PORT_PFSRD10_FSEL0                          *((volatile unsigned int*)(0x42A79D40UL))
#define bM4_PORT_PFSRD10_FSEL1                          *((volatile unsigned int*)(0x42A79D44UL))
#define bM4_PORT_PFSRD10_FSEL2                          *((volatile unsigned int*)(0x42A79D48UL))
#define bM4_PORT_PFSRD10_FSEL3                          *((volatile unsigned int*)(0x42A79D4CUL))
#define bM4_PORT_PFSRD10_FSEL4                          *((volatile unsigned int*)(0x42A79D50UL))
#define bM4_PORT_PFSRD10_FSEL5                          *((volatile unsigned int*)(0x42A79D54UL))
#define bM4_PORT_PFSRD10_BFE                            *((volatile unsigned int*)(0x42A79D60UL))
#define bM4_PORT_PCRD11_POUT                            *((volatile unsigned int*)(0x42A79D80UL))
#define bM4_PORT_PCRD11_POUTE                           *((volatile unsigned int*)(0x42A79D84UL))
#define bM4_PORT_PCRD11_NOD                             *((volatile unsigned int*)(0x42A79D88UL))
#define bM4_PORT_PCRD11_DRV0                            *((volatile unsigned int*)(0x42A79D90UL))
#define bM4_PORT_PCRD11_DRV1                            *((volatile unsigned int*)(0x42A79D94UL))
#define bM4_PORT_PCRD11_PUU                             *((volatile unsigned int*)(0x42A79D98UL))
#define bM4_PORT_PCRD11_PIN                             *((volatile unsigned int*)(0x42A79DA0UL))
#define bM4_PORT_PCRD11_INVE                            *((volatile unsigned int*)(0x42A79DA4UL))
#define bM4_PORT_PCRD11_INTE                            *((volatile unsigned int*)(0x42A79DB0UL))
#define bM4_PORT_PCRD11_LTE                             *((volatile unsigned int*)(0x42A79DB8UL))
#define bM4_PORT_PCRD11_DDIS                            *((volatile unsigned int*)(0x42A79DBCUL))
#define bM4_PORT_PFSRD11_FSEL0                          *((volatile unsigned int*)(0x42A79DC0UL))
#define bM4_PORT_PFSRD11_FSEL1                          *((volatile unsigned int*)(0x42A79DC4UL))
#define bM4_PORT_PFSRD11_FSEL2                          *((volatile unsigned int*)(0x42A79DC8UL))
#define bM4_PORT_PFSRD11_FSEL3                          *((volatile unsigned int*)(0x42A79DCCUL))
#define bM4_PORT_PFSRD11_FSEL4                          *((volatile unsigned int*)(0x42A79DD0UL))
#define bM4_PORT_PFSRD11_FSEL5                          *((volatile unsigned int*)(0x42A79DD4UL))
#define bM4_PORT_PFSRD11_BFE                            *((volatile unsigned int*)(0x42A79DE0UL))
#define bM4_PORT_PCRD12_POUT                            *((volatile unsigned int*)(0x42A79E00UL))
#define bM4_PORT_PCRD12_POUTE                           *((volatile unsigned int*)(0x42A79E04UL))
#define bM4_PORT_PCRD12_NOD                             *((volatile unsigned int*)(0x42A79E08UL))
#define bM4_PORT_PCRD12_DRV0                            *((volatile unsigned int*)(0x42A79E10UL))
#define bM4_PORT_PCRD12_DRV1                            *((volatile unsigned int*)(0x42A79E14UL))
#define bM4_PORT_PCRD12_PUU                             *((volatile unsigned int*)(0x42A79E18UL))
#define bM4_PORT_PCRD12_PIN                             *((volatile unsigned int*)(0x42A79E20UL))
#define bM4_PORT_PCRD12_INVE                            *((volatile unsigned int*)(0x42A79E24UL))
#define bM4_PORT_PCRD12_INTE                            *((volatile unsigned int*)(0x42A79E30UL))
#define bM4_PORT_PCRD12_LTE                             *((volatile unsigned int*)(0x42A79E38UL))
#define bM4_PORT_PCRD12_DDIS                            *((volatile unsigned int*)(0x42A79E3CUL))
#define bM4_PORT_PFSRD12_FSEL0                          *((volatile unsigned int*)(0x42A79E40UL))
#define bM4_PORT_PFSRD12_FSEL1                          *((volatile unsigned int*)(0x42A79E44UL))
#define bM4_PORT_PFSRD12_FSEL2                          *((volatile unsigned int*)(0x42A79E48UL))
#define bM4_PORT_PFSRD12_FSEL3                          *((volatile unsigned int*)(0x42A79E4CUL))
#define bM4_PORT_PFSRD12_FSEL4                          *((volatile unsigned int*)(0x42A79E50UL))
#define bM4_PORT_PFSRD12_FSEL5                          *((volatile unsigned int*)(0x42A79E54UL))
#define bM4_PORT_PFSRD12_BFE                            *((volatile unsigned int*)(0x42A79E60UL))
#define bM4_PORT_PCRD13_POUT                            *((volatile unsigned int*)(0x42A79E80UL))
#define bM4_PORT_PCRD13_POUTE                           *((volatile unsigned int*)(0x42A79E84UL))
#define bM4_PORT_PCRD13_NOD                             *((volatile unsigned int*)(0x42A79E88UL))
#define bM4_PORT_PCRD13_DRV0                            *((volatile unsigned int*)(0x42A79E90UL))
#define bM4_PORT_PCRD13_DRV1                            *((volatile unsigned int*)(0x42A79E94UL))
#define bM4_PORT_PCRD13_PUU                             *((volatile unsigned int*)(0x42A79E98UL))
#define bM4_PORT_PCRD13_PIN                             *((volatile unsigned int*)(0x42A79EA0UL))
#define bM4_PORT_PCRD13_INVE                            *((volatile unsigned int*)(0x42A79EA4UL))
#define bM4_PORT_PCRD13_INTE                            *((volatile unsigned int*)(0x42A79EB0UL))
#define bM4_PORT_PCRD13_LTE                             *((volatile unsigned int*)(0x42A79EB8UL))
#define bM4_PORT_PCRD13_DDIS                            *((volatile unsigned int*)(0x42A79EBCUL))
#define bM4_PORT_PFSRD13_FSEL0                          *((volatile unsigned int*)(0x42A79EC0UL))
#define bM4_PORT_PFSRD13_FSEL1                          *((volatile unsigned int*)(0x42A79EC4UL))
#define bM4_PORT_PFSRD13_FSEL2                          *((volatile unsigned int*)(0x42A79EC8UL))
#define bM4_PORT_PFSRD13_FSEL3                          *((volatile unsigned int*)(0x42A79ECCUL))
#define bM4_PORT_PFSRD13_FSEL4                          *((volatile unsigned int*)(0x42A79ED0UL))
#define bM4_PORT_PFSRD13_FSEL5                          *((volatile unsigned int*)(0x42A79ED4UL))
#define bM4_PORT_PFSRD13_BFE                            *((volatile unsigned int*)(0x42A79EE0UL))
#define bM4_PORT_PCRD14_POUT                            *((volatile unsigned int*)(0x42A79F00UL))
#define bM4_PORT_PCRD14_POUTE                           *((volatile unsigned int*)(0x42A79F04UL))
