CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_SYSREG_CMU_PLLCFGR_MPLLN4                   *((volatile unsigned int*)(0x42A82030UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLN5                   *((volatile unsigned int*)(0x42A82034UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLN6                   *((volatile unsigned int*)(0x42A82038UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLN7                   *((volatile unsigned int*)(0x42A8203CUL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLN8                   *((volatile unsigned int*)(0x42A82040UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLR0                   *((volatile unsigned int*)(0x42A82050UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLR1                   *((volatile unsigned int*)(0x42A82054UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLR2                   *((volatile unsigned int*)(0x42A82058UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLR3                   *((volatile unsigned int*)(0x42A8205CUL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLQ0                   *((volatile unsigned int*)(0x42A82060UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLQ1                   *((volatile unsigned int*)(0x42A82064UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLQ2                   *((volatile unsigned int*)(0x42A82068UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLQ3                   *((volatile unsigned int*)(0x42A8206CUL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLP0                   *((volatile unsigned int*)(0x42A82070UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLP1                   *((volatile unsigned int*)(0x42A82074UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLP2                   *((volatile unsigned int*)(0x42A82078UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLP3                   *((volatile unsigned int*)(0x42A8207CUL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLM0                  *((volatile unsigned int*)(0x42A82080UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLM1                  *((volatile unsigned int*)(0x42A82084UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLM2                  *((volatile unsigned int*)(0x42A82088UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLM3                  *((volatile unsigned int*)(0x42A8208CUL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLM4                  *((volatile unsigned int*)(0x42A82090UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLN0                  *((volatile unsigned int*)(0x42A820A0UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLN1                  *((volatile unsigned int*)(0x42A820A4UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLN2                  *((volatile unsigned int*)(0x42A820A8UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLN3                  *((volatile unsigned int*)(0x42A820ACUL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLN4                  *((volatile unsigned int*)(0x42A820B0UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLN5                  *((volatile unsigned int*)(0x42A820B4UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLN6                  *((volatile unsigned int*)(0x42A820B8UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLN7                  *((volatile unsigned int*)(0x42A820BCUL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLN8                  *((volatile unsigned int*)(0x42A820C0UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLR0                  *((volatile unsigned int*)(0x42A820D0UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLR1                  *((volatile unsigned int*)(0x42A820D4UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLR2                  *((volatile unsigned int*)(0x42A820D8UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLR3                  *((volatile unsigned int*)(0x42A820DCUL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLQ0                  *((volatile unsigned int*)(0x42A820E0UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLQ1                  *((volatile unsigned int*)(0x42A820E4UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLQ2                  *((volatile unsigned int*)(0x42A820E8UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLQ3                  *((volatile unsigned int*)(0x42A820ECUL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLP0                  *((volatile unsigned int*)(0x42A820F0UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLP1                  *((volatile unsigned int*)(0x42A820F4UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLP2                  *((volatile unsigned int*)(0x42A820F8UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLP3                  *((volatile unsigned int*)(0x42A820FCUL))
#define bM4_SYSREG_PWR_FPRC_FPRCB0                      *((volatile unsigned int*)(0x42A87FC0UL))
#define bM4_SYSREG_PWR_FPRC_FPRCB1                      *((volatile unsigned int*)(0x42A87FC4UL))
#define bM4_SYSREG_PWR_FPRC_FPRCB2                      *((volatile unsigned int*)(0x42A87FC8UL))
#define bM4_SYSREG_PWR_FPRC_FPRCB3                      *((volatile unsigned int*)(0x42A87FCCUL))
#define bM4_SYSREG_PWR_FPRC_FPRCWE0                     *((volatile unsigned int*)(0x42A87FE0UL))
#define bM4_SYSREG_PWR_FPRC_FPRCWE1                     *((volatile unsigned int*)(0x42A87FE4UL))
#define bM4_SYSREG_PWR_FPRC_FPRCWE2                     *((volatile unsigned int*)(0x42A87FE8UL))
#define bM4_SYSREG_PWR_FPRC_FPRCWE3                     *((volatile unsigned int*)(0x42A87FECUL))
#define bM4_SYSREG_PWR_FPRC_FPRCWE4                     *((volatile unsigned int*)(0x42A87FF0UL))
#define bM4_SYSREG_PWR_FPRC_FPRCWE5                     *((volatile unsigned int*)(0x42A87FF4UL))
#define bM4_SYSREG_PWR_FPRC_FPRCWE6                     *((volatile unsigned int*)(0x42A87FF8UL))
#define bM4_SYSREG_PWR_FPRC_FPRCWE7                     *((volatile unsigned int*)(0x42A87FFCUL))
#define bM4_SYSREG_PWR_PWRC0_PDMDS0                     *((volatile unsigned int*)(0x42A88000UL))
#define bM4_SYSREG_PWR_PWRC0_PDMDS1                     *((volatile unsigned int*)(0x42A88004UL))
#define bM4_SYSREG_PWR_PWRC0_VVDRSD                     *((volatile unsigned int*)(0x42A88008UL))
#define bM4_SYSREG_PWR_PWRC0_RETRAMSD                   *((volatile unsigned int*)(0x42A8800CUL))
#define bM4_SYSREG_PWR_PWRC0_IORTN0                     *((volatile unsigned int*)(0x42A88010UL))
#define bM4_SYSREG_PWR_PWRC0_IORTN1                     *((volatile unsigned int*)(0x42A88014UL))
#define bM4_SYSREG_PWR_PWRC0_PWDN                       *((volatile unsigned int*)(0x42A8801CUL))
#define bM4_SYSREG_PWR_PWRC1_VPLLSD                     *((volatile unsigned int*)(0x42A88020UL))
#define bM4_SYSREG_PWR_PWRC1_VHRCSD                     *((volatile unsigned int*)(0x42A88024UL))
#define bM4_SYSREG_PWR_PWRC1_STPDAS0                    *((volatile unsigned int*)(0x42A88038UL))
#define bM4_SYSREG_PWR_PWRC1_STPDAS1                    *((volatile unsigned int*)(0x42A8803CUL))
#define bM4_SYSREG_PWR_PWRC2_DDAS0                      *((volatile unsigned int*)(0x42A88040UL))
#define bM4_SYSREG_PWR_PWRC2_DDAS1                      *((volatile unsigned int*)(0x42A88044UL))
#define bM4_SYSREG_PWR_PWRC2_DDAS2                      *((volatile unsigned int*)(0x42A88048UL))
#define bM4_SYSREG_PWR_PWRC2_DDAS3                      *((volatile unsigned int*)(0x42A8804CUL))
#define bM4_SYSREG_PWR_PWRC2_DVS0                       *((volatile unsigned int*)(0x42A88050UL))
#define bM4_SYSREG_PWR_PWRC2_DVS1                       *((volatile unsigned int*)(0x42A88054UL))
#define bM4_SYSREG_PWR_PWRC3_PDTS                       *((volatile unsigned int*)(0x42A88068UL))
#define bM4_SYSREG_PWR_PDWKE0_WKE00                     *((volatile unsigned int*)(0x42A88080UL))
#define bM4_SYSREG_PWR_PDWKE0_WKE01                     *((volatile unsigned int*)(0x42A88084UL))
#define bM4_SYSREG_PWR_PDWKE0_WKE02                     *((volatile unsigned int*)(0x42A88088UL))
#define bM4_SYSREG_PWR_PDWKE0_WKE03                     *((volatile unsigned int*)(0x42A8808CUL))
#define bM4_SYSREG_PWR_PDWKE0_WKE10                     *((volatile unsigned int*)(0x42A88090UL))
#define bM4_SYSREG_PWR_PDWKE0_WKE11                     *((volatile unsigned int*)(0x42A88094UL))
#define bM4_SYSREG_PWR_PDWKE0_WKE12                     *((volatile unsigned int*)(0x42A88098UL))
#define bM4_SYSREG_PWR_PDWKE0_WKE13                     *((volatile unsigned int*)(0x42A8809CUL))
#define bM4_SYSREG_PWR_PDWKE1_WKE20                     *((volatile unsigned int*)(0x42A880A0UL))
#define bM4_SYSREG_PWR_PDWKE1_WKE21                     *((volatile unsigned int*)(0x42A880A4UL))
#define bM4_SYSREG_PWR_PDWKE1_WKE22                     *((volatile unsigned int*)(0x42A880A8UL))
#define bM4_SYSREG_PWR_PDWKE1_WKE23                     *((volatile unsigned int*)(0x42A880ACUL))
#define bM4_SYSREG_PWR_PDWKE1_WKE30                     *((volatile unsigned int*)(0x42A880B0UL))
#define bM4_SYSREG_PWR_PDWKE1_WKE31                     *((volatile unsigned int*)(0x42A880B4UL))
#define bM4_SYSREG_PWR_PDWKE1_WKE32                     *((volatile unsigned int*)(0x42A880B8UL))
#define bM4_SYSREG_PWR_PDWKE1_WKE33                     *((volatile unsigned int*)(0x42A880BCUL))
#define bM4_SYSREG_PWR_PDWKE2_VD1WKE                    *((volatile unsigned int*)(0x42A880C0UL))
#define bM4_SYSREG_PWR_PDWKE2_VD2WKE                    *((volatile unsigned int*)(0x42A880C4UL))
#define bM4_SYSREG_PWR_PDWKE2_NMIWKE                    *((volatile unsigned int*)(0x42A880C8UL))
#define bM4_SYSREG_PWR_PDWKE2_RTCPRDWKE                 *((volatile unsigned int*)(0x42A880D0UL))
#define bM4_SYSREG_PWR_PDWKE2_RTCALMWKE                 *((volatile unsigned int*)(0x42A880D4UL))
#define bM4_SYSREG_PWR_PDWKE2_XTAL32ERWKE               *((volatile unsigned int*)(0x42A880D8UL))
#define bM4_SYSREG_PWR_PDWKE2_WKTMWKE                   *((volatile unsigned int*)(0x42A880DCUL))
#define bM4_SYSREG_PWR_PDWKES_WK0EGS                    *((volatile unsigned int*)(0x42A880E0UL))
#define bM4_SYSREG_PWR_PDWKES_WK1EGS                    *((volatile unsigned int*)(0x42A880E4UL))
#define bM4_SYSREG_PWR_PDWKES_WK2EGS                    *((volatile unsigned int*)(0x42A880E8UL))
#define bM4_SYSREG_PWR_PDWKES_WK3EGS                    *((volatile unsigned int*)(0x42A880ECUL))
#define bM4_SYSREG_PWR_PDWKES_VD1EGS                    *((volatile unsigned int*)(0x42A880F0UL))
#define bM4_SYSREG_PWR_PDWKES_VD2EGS                    *((volatile unsigned int*)(0x42A880F4UL))
#define bM4_SYSREG_PWR_PDWKES_NMIEGS                    *((volatile unsigned int*)(0x42A880F8UL))
#define bM4_SYSREG_PWR_PDWKF0_PTWK0F                    *((volatile unsigned int*)(0x42A88100UL))
#define bM4_SYSREG_PWR_PDWKF0_PTWK1F                    *((volatile unsigned int*)(0x42A88104UL))
#define bM4_SYSREG_PWR_PDWKF0_PTWK2F                    *((volatile unsigned int*)(0x42A88108UL))
#define bM4_SYSREG_PWR_PDWKF0_PTWK3F                    *((volatile unsigned int*)(0x42A8810CUL))
#define bM4_SYSREG_PWR_PDWKF0_VD1WKF                    *((volatile unsigned int*)(0x42A88110UL))
#define bM4_SYSREG_PWR_PDWKF0_VD2WKF                    *((volatile unsigned int*)(0x42A88114UL))
#define bM4_SYSREG_PWR_PDWKF0_NMIWKF                    *((volatile unsigned int*)(0x42A88118UL))
#define bM4_SYSREG_PWR_PDWKF1_RXD0WKF                   *((volatile unsigned int*)(0x42A8812CUL))
#define bM4_SYSREG_PWR_PDWKF1_RTCPRDWKF                 *((volatile unsigned int*)(0x42A88130UL))
#define bM4_SYSREG_PWR_PDWKF1_RTCALMWKF                 *((volatile unsigned int*)(0x42A88134UL))
#define bM4_SYSREG_PWR_PDWKF1_XTAL32ERWKF               *((volatile unsigned int*)(0x42A88138UL))
#define bM4_SYSREG_PWR_PDWKF1_WKTMWKF                   *((volatile unsigned int*)(0x42A8813CUL))
#define bM4_SYSREG_PWR_PWCMR_ADBUFE                     *((volatile unsigned int*)(0x42A8815CUL))
#define bM4_SYSREG_CMU_XTALCFGR_XTALDRV0                *((volatile unsigned int*)(0x42A88210UL))
#define bM4_SYSREG_CMU_XTALCFGR_XTALDRV1                *((volatile unsigned int*)(0x42A88214UL))
#define bM4_SYSREG_CMU_XTALCFGR_XTALMS                  *((volatile unsigned int*)(0x42A88218UL))
#define bM4_SYSREG_CMU_XTALCFGR_SUPDRV                  *((volatile unsigned int*)(0x42A8821CUL))
#define bM4_SYSREG_PWR_PVDCR0_EXVCCINEN                 *((volatile unsigned int*)(0x42A88240UL))
#define bM4_SYSREG_PWR_PVDCR0_PVD1EN                    *((volatile unsigned int*)(0x42A88254UL))
#define bM4_SYSREG_PWR_PVDCR0_PVD2EN                    *((volatile unsigned int*)(0x42A88258UL))
#define bM4_SYSREG_PWR_PVDCR1_PVD1IRE                   *((volatile unsigned int*)(0x42A88260UL))
#define bM4_SYSREG_PWR_PVDCR1_PVD1IRS                   *((volatile unsigned int*)(0x42A88264UL))
#define bM4_SYSREG_PWR_PVDCR1_PVD1CMPOE                 *((volatile unsigned int*)(0x42A88268UL))
#define bM4_SYSREG_PWR_PVDCR1_PVD2IRE                   *((volatile unsigned int*)(0x42A88270UL))
#define bM4_SYSREG_PWR_PVDCR1_PVD2IRS                   *((volatile unsigned int*)(0x42A88274UL))
#define bM4_SYSREG_PWR_PVDCR1_PVD2CMPOE                 *((volatile unsigned int*)(0x42A88278UL))
#define bM4_SYSREG_PWR_PVDFCR_PVD1NFDIS                 *((volatile unsigned int*)(0x42A88280UL))
#define bM4_SYSREG_PWR_PVDFCR_PVD1NFCKS0                *((volatile unsigned int*)(0x42A88284UL))
#define bM4_SYSREG_PWR_PVDFCR_PVD1NFCKS1                *((volatile unsigned int*)(0x42A88288UL))
#define bM4_SYSREG_PWR_PVDFCR_PVD2NFDIS                 *((volatile unsigned int*)(0x42A88290UL))
#define bM4_SYSREG_PWR_PVDFCR_PVD2NFCKS0                *((volatile unsigned int*)(0x42A88294UL))
#define bM4_SYSREG_PWR_PVDFCR_PVD2NFCKS1                *((volatile unsigned int*)(0x42A88298UL))
#define bM4_SYSREG_PWR_PVDLCR_PVD1LVL0                  *((volatile unsigned int*)(0x42A882A0UL))
#define bM4_SYSREG_PWR_PVDLCR_PVD1LVL1                  *((volatile unsigned int*)(0x42A882A4UL))
#define bM4_SYSREG_PWR_PVDLCR_PVD1LVL2                  *((volatile unsigned int*)(0x42A882A8UL))
#define bM4_SYSREG_PWR_PVDLCR_PVD2LVL0                  *((volatile unsigned int*)(0x42A882B0UL))
#define bM4_SYSREG_PWR_PVDLCR_PVD2LVL1                  *((volatile unsigned int*)(0x42A882B4UL))
#define bM4_SYSREG_PWR_PVDLCR_PVD2LVL2                  *((volatile unsigned int*)(0x42A882B8UL))
#define bM4_SYSREG_CMU_XTAL32CR_XTAL32STP               *((volatile unsigned int*)(0x42A88400UL))
#define bM4_SYSREG_CMU_XTAL32CFGR_XTAL32DRV0            *((volatile unsigned int*)(0x42A88420UL))
#define bM4_SYSREG_CMU_XTAL32CFGR_XTAL32DRV1            *((volatile unsigned int*)(0x42A88424UL))
#define bM4_SYSREG_CMU_XTAL32CFGR_XTAL32SUPDRV          *((volatile unsigned int*)(0x42A88428UL))
#define bM4_SYSREG_CMU_XTAL32NFR_XTAL32NF0              *((volatile unsigned int*)(0x42A884A0UL))
#define bM4_SYSREG_CMU_XTAL32NFR_XTAL32NF1              *((volatile unsigned int*)(0x42A884A4UL))
#define bM4_SYSREG_CMU_LRCCR_LRCSTP                     *((volatile unsigned int*)(0x42A884E0UL))
#define bM4_SYSREG_PWR_XTAL32CS_CSDIS                   *((volatile unsigned int*)(0x42A8857CUL))
#define bM4_TMR01_CNTAR_CNTA0                           *((volatile unsigned int*)(0x42480000UL))
#define bM4_TMR01_CNTAR_CNTA1                           *((volatile unsigned int*)(0x42480004UL))
#define bM4_TMR01_CNTAR_CNTA2                           *((volatile unsigned int*)(0x42480008UL))
#define bM4_TMR01_CNTAR_CNTA3                           *((volatile unsigned int*)(0x4248000CUL))
#define bM4_TMR01_CNTAR_CNTA4                           *((volatile unsigned int*)(0x42480010UL))
#define bM4_TMR01_CNTAR_CNTA5                           *((volatile unsigned int*)(0x42480014UL))
#define bM4_TMR01_CNTAR_CNTA6                           *((volatile unsigned int*)(0x42480018UL))
#define bM4_TMR01_CNTAR_CNTA7                           *((volatile unsigned int*)(0x4248001CUL))
#define bM4_TMR01_CNTAR_CNTA8                           *((volatile unsigned int*)(0x42480020UL))
#define bM4_TMR01_CNTAR_CNTA9                           *((volatile unsigned int*)(0x42480024UL))
#define bM4_TMR01_CNTAR_CNTA10                          *((volatile unsigned int*)(0x42480028UL))
#define bM4_TMR01_CNTAR_CNTA11                          *((volatile unsigned int*)(0x4248002CUL))
#define bM4_TMR01_CNTAR_CNTA12                          *((volatile unsigned int*)(0x42480030UL))
#define bM4_TMR01_CNTAR_CNTA13                          *((volatile unsigned int*)(0x42480034UL))
#define bM4_TMR01_CNTAR_CNTA14                          *((volatile unsigned int*)(0x42480038UL))
#define bM4_TMR01_CNTAR_CNTA15                          *((volatile unsigned int*)(0x4248003CUL))
#define bM4_TMR01_CNTBR_CNTB0                           *((volatile unsigned int*)(0x42480080UL))
#define bM4_TMR01_CNTBR_CNTB1                           *((volatile unsigned int*)(0x42480084UL))
#define bM4_TMR01_CNTBR_CNTB2                           *((volatile unsigned int*)(0x42480088UL))
#define bM4_TMR01_CNTBR_CNTB3                           *((volatile unsigned int*)(0x4248008CUL))
#define bM4_TMR01_CNTBR_CNTB4                           *((volatile unsigned int*)(0x42480090UL))
#define bM4_TMR01_CNTBR_CNTB5                           *((volatile unsigned int*)(0x42480094UL))
#define bM4_TMR01_CNTBR_CNTB6                           *((volatile unsigned int*)(0x42480098UL))
#define bM4_TMR01_CNTBR_CNTB7                           *((volatile unsigned int*)(0x4248009CUL))
#define bM4_TMR01_CNTBR_CNTB8                           *((volatile unsigned int*)(0x424800A0UL))
#define bM4_TMR01_CNTBR_CNTB9                           *((volatile unsigned int*)(0x424800A4UL))
#define bM4_TMR01_CNTBR_CNTB10                          *((volatile unsigned int*)(0x424800A8UL))
#define bM4_TMR01_CNTBR_CNTB11                          *((volatile unsigned int*)(0x424800ACUL))
#define bM4_TMR01_CNTBR_CNTB12                          *((volatile unsigned int*)(0x424800B0UL))
#define bM4_TMR01_CNTBR_CNTB13                          *((volatile unsigned int*)(0x424800B4UL))
#define bM4_TMR01_CNTBR_CNTB14                          *((volatile unsigned int*)(0x424800B8UL))
#define bM4_TMR01_CNTBR_CNTB15                          *((volatile unsigned int*)(0x424800BCUL))
#define bM4_TMR01_CMPAR_CMPA0                           *((volatile unsigned int*)(0x42480100UL))
#define bM4_TMR01_CMPAR_CMPA1                           *((volatile unsigned int*)(0x42480104UL))
#define bM4_TMR01_CMPAR_CMPA2                           *((volatile unsigned int*)(0x42480108UL))
#define bM4_TMR01_CMPAR_CMPA3                           *((volatile unsigned int*)(0x4248010CUL))
#define bM4_TMR01_CMPAR_CMPA4                           *((volatile unsigned int*)(0x42480110UL))
#define bM4_TMR01_CMPAR_CMPA5                           *((volatile unsigned int*)(0x42480114UL))
#define bM4_TMR01_CMPAR_CMPA6                           *((volatile unsigned int*)(0x42480118UL))
#define bM4_TMR01_CMPAR_CMPA7                           *((volatile unsigned int*)(0x4248011CUL))
#define bM4_TMR01_CMPAR_CMPA8                           *((volatile unsigned int*)(0x42480120UL))
#define bM4_TMR01_CMPAR_CMPA9                           *((volatile unsigned int*)(0x42480124UL))
#define bM4_TMR01_CMPAR_CMPA10                          *((volatile unsigned int*)(0x42480128UL))
#define bM4_TMR01_CMPAR_CMPA11                          *((volatile unsigned int*)(0x4248012CUL))
#define bM4_TMR01_CMPAR_CMPA12                          *((volatile unsigned int*)(0x42480130UL))
#define bM4_TMR01_CMPAR_CMPA13                          *((volatile unsigned int*)(0x42480134UL))
#define bM4_TMR01_CMPAR_CMPA14                          *((volatile unsigned int*)(0x42480138UL))
#define bM4_TMR01_CMPAR_CMPA15                          *((volatile unsigned int*)(0x4248013CUL))
#define bM4_TMR01_CMPBR_CMPB0                           *((volatile unsigned int*)(0x42480180UL))
#define bM4_TMR01_CMPBR_CMPB1                           *((volatile unsigned int*)(0x42480184UL))
#define bM4_TMR01_CMPBR_CMPB2                           *((volatile unsigned int*)(0x42480188UL))
#define bM4_TMR01_CMPBR_CMPB3                           *((volatile unsigned int*)(0x4248018CUL))
#define bM4_TMR01_CMPBR_CMPB4                           *((volatile unsigned int*)(0x42480190UL))
#define bM4_TMR01_CMPBR_CMPB5                           *((volatile unsigned int*)(0x42480194UL))
#define bM4_TMR01_CMPBR_CMPB6                           *((volatile unsigned int*)(0x42480198UL))
#define bM4_TMR01_CMPBR_CMPB7                           *((volatile unsigned int*)(0x4248019CUL))
#define bM4_TMR01_CMPBR_CMPB8                           *((volatile unsigned int*)(0x424801A0UL))
#define bM4_TMR01_CMPBR_CMPB9                           *((volatile unsigned int*)(0x424801A4UL))
#define bM4_TMR01_CMPBR_CMPB10                          *((volatile unsigned int*)(0x424801A8UL))
#define bM4_TMR01_CMPBR_CMPB11                          *((volatile unsigned int*)(0x424801ACUL))
#define bM4_TMR01_CMPBR_CMPB12                          *((volatile unsigned int*)(0x424801B0UL))
#define bM4_TMR01_CMPBR_CMPB13                          *((volatile unsigned int*)(0x424801B4UL))
#define bM4_TMR01_CMPBR_CMPB14                          *((volatile unsigned int*)(0x424801B8UL))
#define bM4_TMR01_CMPBR_CMPB15                          *((volatile unsigned int*)(0x424801BCUL))
#define bM4_TMR01_BCONR_CSTA                            *((volatile unsigned int*)(0x42480200UL))
#define bM4_TMR01_BCONR_CAPMDA                          *((volatile unsigned int*)(0x42480204UL))
#define bM4_TMR01_BCONR_INTENA                          *((volatile unsigned int*)(0x42480208UL))
#define bM4_TMR01_BCONR_CKDIVA0                         *((volatile unsigned int*)(0x42480210UL))
#define bM4_TMR01_BCONR_CKDIVA1                         *((volatile unsigned int*)(0x42480214UL))
#define bM4_TMR01_BCONR_CKDIVA2                         *((volatile unsigned int*)(0x42480218UL))
#define bM4_TMR01_BCONR_CKDIVA3                         *((volatile unsigned int*)(0x4248021CUL))
#define bM4_TMR01_BCONR_SYNSA                           *((volatile unsigned int*)(0x42480220UL))
#define bM4_TMR01_BCONR_SYNCLKA                         *((volatile unsigned int*)(0x42480224UL))
#define bM4_TMR01_BCONR_ASYNCLKA                        *((volatile unsigned int*)(0x42480228UL))
#define bM4_TMR01_BCONR_HSTAA                           *((volatile unsigned int*)(0x42480230UL))
#define bM4_TMR01_BCONR_HSTPA                           *((volatile unsigned int*)(0x42480234UL))
#define bM4_TMR01_BCONR_HCLEA                           *((volatile unsigned int*)(0x42480238UL))
#define bM4_TMR01_BCONR_HICPA                           *((volatile unsigned int*)(0x4248023CUL))
#define bM4_TMR01_BCONR_CSTB                            *((volatile unsigned int*)(0x42480240UL))
#define bM4_TMR01_BCONR_CAPMDB                          *((volatile unsigned int*)(0x42480244UL))
#define bM4_TMR01_BCONR_INTENB                          *((volatile unsigned int*)(0x42480248UL))
#define bM4_TMR01_BCONR_CKDIVB0                         *((volatile unsigned int*)(0x42480250UL))
#define bM4_TMR01_BCONR_CKDIVB1                         *((volatile unsigned int*)(0x42480254UL))
#define bM4_TMR01_BCONR_CKDIVB2                         *((volatile unsigned int*)(0x42480258UL))
#define bM4_TMR01_BCONR_CKDIVB3                         *((volatile unsigned int*)(0x4248025CUL))
#define bM4_TMR01_BCONR_SYNSB                           *((volatile unsigned int*)(0x42480260UL))
#define bM4_TMR01_BCONR_SYNCLKB                         *((volatile unsigned int*)(0x42480264UL))
#define bM4_TMR01_BCONR_ASYNCLKB                        *((volatile unsigned int*)(0x42480268UL))
#define bM4_TMR01_BCONR_HSTAB                           *((volatile unsigned int*)(0x42480270UL))
#define bM4_TMR01_BCONR_HSTPB                           *((volatile unsigned int*)(0x42480274UL))
#define bM4_TMR01_BCONR_HCLEB                           *((volatile unsigned int*)(0x42480278UL))
#define bM4_TMR01_BCONR_HICPB                           *((volatile unsigned int*)(0x4248027CUL))
#define bM4_TMR01_STFLR_CMAF                            *((volatile unsigned int*)(0x42480280UL))
#define bM4_TMR01_STFLR_CMBF                            *((volatile unsigned int*)(0x424802C0UL))
#define bM4_TMR02_CNTAR_CNTA0                           *((volatile unsigned int*)(0x42488000UL))
