CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_TMR02_CNTAR_CNTA1                           *((volatile unsigned int*)(0x42488004UL))
#define bM4_TMR02_CNTAR_CNTA2                           *((volatile unsigned int*)(0x42488008UL))
#define bM4_TMR02_CNTAR_CNTA3                           *((volatile unsigned int*)(0x4248800CUL))
#define bM4_TMR02_CNTAR_CNTA4                           *((volatile unsigned int*)(0x42488010UL))
#define bM4_TMR02_CNTAR_CNTA5                           *((volatile unsigned int*)(0x42488014UL))
#define bM4_TMR02_CNTAR_CNTA6                           *((volatile unsigned int*)(0x42488018UL))
#define bM4_TMR02_CNTAR_CNTA7                           *((volatile unsigned int*)(0x4248801CUL))
#define bM4_TMR02_CNTAR_CNTA8                           *((volatile unsigned int*)(0x42488020UL))
#define bM4_TMR02_CNTAR_CNTA9                           *((volatile unsigned int*)(0x42488024UL))
#define bM4_TMR02_CNTAR_CNTA10                          *((volatile unsigned int*)(0x42488028UL))
#define bM4_TMR02_CNTAR_CNTA11                          *((volatile unsigned int*)(0x4248802CUL))
#define bM4_TMR02_CNTAR_CNTA12                          *((volatile unsigned int*)(0x42488030UL))
#define bM4_TMR02_CNTAR_CNTA13                          *((volatile unsigned int*)(0x42488034UL))
#define bM4_TMR02_CNTAR_CNTA14                          *((volatile unsigned int*)(0x42488038UL))
#define bM4_TMR02_CNTAR_CNTA15                          *((volatile unsigned int*)(0x4248803CUL))
#define bM4_TMR02_CNTBR_CNTB0                           *((volatile unsigned int*)(0x42488080UL))
#define bM4_TMR02_CNTBR_CNTB1                           *((volatile unsigned int*)(0x42488084UL))
#define bM4_TMR02_CNTBR_CNTB2                           *((volatile unsigned int*)(0x42488088UL))
#define bM4_TMR02_CNTBR_CNTB3                           *((volatile unsigned int*)(0x4248808CUL))
#define bM4_TMR02_CNTBR_CNTB4                           *((volatile unsigned int*)(0x42488090UL))
#define bM4_TMR02_CNTBR_CNTB5                           *((volatile unsigned int*)(0x42488094UL))
#define bM4_TMR02_CNTBR_CNTB6                           *((volatile unsigned int*)(0x42488098UL))
#define bM4_TMR02_CNTBR_CNTB7                           *((volatile unsigned int*)(0x4248809CUL))
#define bM4_TMR02_CNTBR_CNTB8                           *((volatile unsigned int*)(0x424880A0UL))
#define bM4_TMR02_CNTBR_CNTB9                           *((volatile unsigned int*)(0x424880A4UL))
#define bM4_TMR02_CNTBR_CNTB10                          *((volatile unsigned int*)(0x424880A8UL))
#define bM4_TMR02_CNTBR_CNTB11                          *((volatile unsigned int*)(0x424880ACUL))
#define bM4_TMR02_CNTBR_CNTB12                          *((volatile unsigned int*)(0x424880B0UL))
#define bM4_TMR02_CNTBR_CNTB13                          *((volatile unsigned int*)(0x424880B4UL))
#define bM4_TMR02_CNTBR_CNTB14                          *((volatile unsigned int*)(0x424880B8UL))
#define bM4_TMR02_CNTBR_CNTB15                          *((volatile unsigned int*)(0x424880BCUL))
#define bM4_TMR02_CMPAR_CMPA0                           *((volatile unsigned int*)(0x42488100UL))
#define bM4_TMR02_CMPAR_CMPA1                           *((volatile unsigned int*)(0x42488104UL))
#define bM4_TMR02_CMPAR_CMPA2                           *((volatile unsigned int*)(0x42488108UL))
#define bM4_TMR02_CMPAR_CMPA3                           *((volatile unsigned int*)(0x4248810CUL))
#define bM4_TMR02_CMPAR_CMPA4                           *((volatile unsigned int*)(0x42488110UL))
#define bM4_TMR02_CMPAR_CMPA5                           *((volatile unsigned int*)(0x42488114UL))
#define bM4_TMR02_CMPAR_CMPA6                           *((volatile unsigned int*)(0x42488118UL))
#define bM4_TMR02_CMPAR_CMPA7                           *((volatile unsigned int*)(0x4248811CUL))
#define bM4_TMR02_CMPAR_CMPA8                           *((volatile unsigned int*)(0x42488120UL))
#define bM4_TMR02_CMPAR_CMPA9                           *((volatile unsigned int*)(0x42488124UL))
#define bM4_TMR02_CMPAR_CMPA10                          *((volatile unsigned int*)(0x42488128UL))
#define bM4_TMR02_CMPAR_CMPA11                          *((volatile unsigned int*)(0x4248812CUL))
#define bM4_TMR02_CMPAR_CMPA12                          *((volatile unsigned int*)(0x42488130UL))
#define bM4_TMR02_CMPAR_CMPA13                          *((volatile unsigned int*)(0x42488134UL))
#define bM4_TMR02_CMPAR_CMPA14                          *((volatile unsigned int*)(0x42488138UL))
#define bM4_TMR02_CMPAR_CMPA15                          *((volatile unsigned int*)(0x4248813CUL))
#define bM4_TMR02_CMPBR_CMPB0                           *((volatile unsigned int*)(0x42488180UL))
#define bM4_TMR02_CMPBR_CMPB1                           *((volatile unsigned int*)(0x42488184UL))
#define bM4_TMR02_CMPBR_CMPB2                           *((volatile unsigned int*)(0x42488188UL))
#define bM4_TMR02_CMPBR_CMPB3                           *((volatile unsigned int*)(0x4248818CUL))
#define bM4_TMR02_CMPBR_CMPB4                           *((volatile unsigned int*)(0x42488190UL))
#define bM4_TMR02_CMPBR_CMPB5                           *((volatile unsigned int*)(0x42488194UL))
#define bM4_TMR02_CMPBR_CMPB6                           *((volatile unsigned int*)(0x42488198UL))
#define bM4_TMR02_CMPBR_CMPB7                           *((volatile unsigned int*)(0x4248819CUL))
#define bM4_TMR02_CMPBR_CMPB8                           *((volatile unsigned int*)(0x424881A0UL))
#define bM4_TMR02_CMPBR_CMPB9                           *((volatile unsigned int*)(0x424881A4UL))
#define bM4_TMR02_CMPBR_CMPB10                          *((volatile unsigned int*)(0x424881A8UL))
#define bM4_TMR02_CMPBR_CMPB11                          *((volatile unsigned int*)(0x424881ACUL))
#define bM4_TMR02_CMPBR_CMPB12                          *((volatile unsigned int*)(0x424881B0UL))
#define bM4_TMR02_CMPBR_CMPB13                          *((volatile unsigned int*)(0x424881B4UL))
#define bM4_TMR02_CMPBR_CMPB14                          *((volatile unsigned int*)(0x424881B8UL))
#define bM4_TMR02_CMPBR_CMPB15                          *((volatile unsigned int*)(0x424881BCUL))
#define bM4_TMR02_BCONR_CSTA                            *((volatile unsigned int*)(0x42488200UL))
#define bM4_TMR02_BCONR_CAPMDA                          *((volatile unsigned int*)(0x42488204UL))
#define bM4_TMR02_BCONR_INTENA                          *((volatile unsigned int*)(0x42488208UL))
#define bM4_TMR02_BCONR_CKDIVA0                         *((volatile unsigned int*)(0x42488210UL))
#define bM4_TMR02_BCONR_CKDIVA1                         *((volatile unsigned int*)(0x42488214UL))
#define bM4_TMR02_BCONR_CKDIVA2                         *((volatile unsigned int*)(0x42488218UL))
#define bM4_TMR02_BCONR_CKDIVA3                         *((volatile unsigned int*)(0x4248821CUL))
#define bM4_TMR02_BCONR_SYNSA                           *((volatile unsigned int*)(0x42488220UL))
#define bM4_TMR02_BCONR_SYNCLKA                         *((volatile unsigned int*)(0x42488224UL))
#define bM4_TMR02_BCONR_ASYNCLKA                        *((volatile unsigned int*)(0x42488228UL))
#define bM4_TMR02_BCONR_HSTAA                           *((volatile unsigned int*)(0x42488230UL))
#define bM4_TMR02_BCONR_HSTPA                           *((volatile unsigned int*)(0x42488234UL))
#define bM4_TMR02_BCONR_HCLEA                           *((volatile unsigned int*)(0x42488238UL))
#define bM4_TMR02_BCONR_HICPA                           *((volatile unsigned int*)(0x4248823CUL))
#define bM4_TMR02_BCONR_CSTB                            *((volatile unsigned int*)(0x42488240UL))
#define bM4_TMR02_BCONR_CAPMDB                          *((volatile unsigned int*)(0x42488244UL))
#define bM4_TMR02_BCONR_INTENB                          *((volatile unsigned int*)(0x42488248UL))
#define bM4_TMR02_BCONR_CKDIVB0                         *((volatile unsigned int*)(0x42488250UL))
#define bM4_TMR02_BCONR_CKDIVB1                         *((volatile unsigned int*)(0x42488254UL))
#define bM4_TMR02_BCONR_CKDIVB2                         *((volatile unsigned int*)(0x42488258UL))
#define bM4_TMR02_BCONR_CKDIVB3                         *((volatile unsigned int*)(0x4248825CUL))
#define bM4_TMR02_BCONR_SYNSB                           *((volatile unsigned int*)(0x42488260UL))
#define bM4_TMR02_BCONR_SYNCLKB                         *((volatile unsigned int*)(0x42488264UL))
#define bM4_TMR02_BCONR_ASYNCLKB                        *((volatile unsigned int*)(0x42488268UL))
#define bM4_TMR02_BCONR_HSTAB                           *((volatile unsigned int*)(0x42488270UL))
#define bM4_TMR02_BCONR_HSTPB                           *((volatile unsigned int*)(0x42488274UL))
#define bM4_TMR02_BCONR_HCLEB                           *((volatile unsigned int*)(0x42488278UL))
#define bM4_TMR02_BCONR_HICPB                           *((volatile unsigned int*)(0x4248827CUL))
#define bM4_TMR02_STFLR_CMAF                            *((volatile unsigned int*)(0x42488280UL))
#define bM4_TMR02_STFLR_CMBF                            *((volatile unsigned int*)(0x424882C0UL))
#define bM4_TMR41_OCSRU_OCEHU                           *((volatile unsigned int*)(0x422E0300UL))
#define bM4_TMR41_OCSRU_OCELU                           *((volatile unsigned int*)(0x422E0304UL))
#define bM4_TMR41_OCSRU_OCPHU                           *((volatile unsigned int*)(0x422E0308UL))
#define bM4_TMR41_OCSRU_OCPLU                           *((volatile unsigned int*)(0x422E030CUL))
#define bM4_TMR41_OCSRU_OCIEHU                          *((volatile unsigned int*)(0x422E0310UL))
#define bM4_TMR41_OCSRU_OCIELU                          *((volatile unsigned int*)(0x422E0314UL))
#define bM4_TMR41_OCSRU_OCFHU                           *((volatile unsigned int*)(0x422E0318UL))
#define bM4_TMR41_OCSRU_OCFLU                           *((volatile unsigned int*)(0x422E031CUL))
#define bM4_TMR41_OCERU_CHBUFENU0                       *((volatile unsigned int*)(0x422E0340UL))
#define bM4_TMR41_OCERU_CHBUFENU1                       *((volatile unsigned int*)(0x422E0344UL))
#define bM4_TMR41_OCERU_CLBUFENU0                       *((volatile unsigned int*)(0x422E0348UL))
#define bM4_TMR41_OCERU_CLBUFENU1                       *((volatile unsigned int*)(0x422E034CUL))
#define bM4_TMR41_OCERU_MHBUFENU0                       *((volatile unsigned int*)(0x422E0350UL))
#define bM4_TMR41_OCERU_MHBUFENU1                       *((volatile unsigned int*)(0x422E0354UL))
#define bM4_TMR41_OCERU_MLBUFENU0                       *((volatile unsigned int*)(0x422E0358UL))
#define bM4_TMR41_OCERU_MLBUFENU1                       *((volatile unsigned int*)(0x422E035CUL))
#define bM4_TMR41_OCERU_LMCHU                           *((volatile unsigned int*)(0x422E0360UL))
#define bM4_TMR41_OCERU_LMCLU                           *((volatile unsigned int*)(0x422E0364UL))
#define bM4_TMR41_OCERU_LMMHU                           *((volatile unsigned int*)(0x422E0368UL))
#define bM4_TMR41_OCERU_LMMLU                           *((volatile unsigned int*)(0x422E036CUL))
#define bM4_TMR41_OCERU_MCECHU                          *((volatile unsigned int*)(0x422E0370UL))
#define bM4_TMR41_OCERU_MCECLU                          *((volatile unsigned int*)(0x422E0374UL))
#define bM4_TMR41_OCSRV_OCEHV                           *((volatile unsigned int*)(0x422E0380UL))
#define bM4_TMR41_OCSRV_OCELV                           *((volatile unsigned int*)(0x422E0384UL))
#define bM4_TMR41_OCSRV_OCPHV                           *((volatile unsigned int*)(0x422E0388UL))
#define bM4_TMR41_OCSRV_OCPLV                           *((volatile unsigned int*)(0x422E038CUL))
#define bM4_TMR41_OCSRV_OCIEHV                          *((volatile unsigned int*)(0x422E0390UL))
#define bM4_TMR41_OCSRV_OCIELV                          *((volatile unsigned int*)(0x422E0394UL))
#define bM4_TMR41_OCSRV_OCFHV                           *((volatile unsigned int*)(0x422E0398UL))
#define bM4_TMR41_OCSRV_OCFLV                           *((volatile unsigned int*)(0x422E039CUL))
#define bM4_TMR41_OCERV_CHBUFENV0                       *((volatile unsigned int*)(0x422E03C0UL))
#define bM4_TMR41_OCERV_CHBUFENV1                       *((volatile unsigned int*)(0x422E03C4UL))
#define bM4_TMR41_OCERV_CLBUFENV0                       *((volatile unsigned int*)(0x422E03C8UL))
#define bM4_TMR41_OCERV_CLBUFENV1                       *((volatile unsigned int*)(0x422E03CCUL))
#define bM4_TMR41_OCERV_MHBUFENV0                       *((volatile unsigned int*)(0x422E03D0UL))
#define bM4_TMR41_OCERV_MHBUFENV1                       *((volatile unsigned int*)(0x422E03D4UL))
#define bM4_TMR41_OCERV_MLBUFENV0                       *((volatile unsigned int*)(0x422E03D8UL))
#define bM4_TMR41_OCERV_MLBUFENV1                       *((volatile unsigned int*)(0x422E03DCUL))
#define bM4_TMR41_OCERV_LMCHV                           *((volatile unsigned int*)(0x422E03E0UL))
#define bM4_TMR41_OCERV_LMCLV                           *((volatile unsigned int*)(0x422E03E4UL))
#define bM4_TMR41_OCERV_LMMHV                           *((volatile unsigned int*)(0x422E03E8UL))
#define bM4_TMR41_OCERV_LMMLV                           *((volatile unsigned int*)(0x422E03ECUL))
#define bM4_TMR41_OCERV_MCECHV                          *((volatile unsigned int*)(0x422E03F0UL))
#define bM4_TMR41_OCERV_MCECLV                          *((volatile unsigned int*)(0x422E03F4UL))
#define bM4_TMR41_OCSRW_OCEHW                           *((volatile unsigned int*)(0x422E0400UL))
#define bM4_TMR41_OCSRW_OCELW                           *((volatile unsigned int*)(0x422E0404UL))
#define bM4_TMR41_OCSRW_OCPHW                           *((volatile unsigned int*)(0x422E0408UL))
#define bM4_TMR41_OCSRW_OCPLW                           *((volatile unsigned int*)(0x422E040CUL))
#define bM4_TMR41_OCSRW_OCIEHW                          *((volatile unsigned int*)(0x422E0410UL))
#define bM4_TMR41_OCSRW_OCIELW                          *((volatile unsigned int*)(0x422E0414UL))
#define bM4_TMR41_OCSRW_OCFHW                           *((volatile unsigned int*)(0x422E0418UL))
#define bM4_TMR41_OCSRW_OCFLW                           *((volatile unsigned int*)(0x422E041CUL))
#define bM4_TMR41_OCERW_CHBUFENW0                       *((volatile unsigned int*)(0x422E0440UL))
#define bM4_TMR41_OCERW_CHBUFENW1                       *((volatile unsigned int*)(0x422E0444UL))
#define bM4_TMR41_OCERW_CLBUFENW0                       *((volatile unsigned int*)(0x422E0448UL))
#define bM4_TMR41_OCERW_CLBUFENW1                       *((volatile unsigned int*)(0x422E044CUL))
#define bM4_TMR41_OCERW_MHBUFENW0                       *((volatile unsigned int*)(0x422E0450UL))
#define bM4_TMR41_OCERW_MHBUFENW1                       *((volatile unsigned int*)(0x422E0454UL))
#define bM4_TMR41_OCERW_MLBUFENW0                       *((volatile unsigned int*)(0x422E0458UL))
#define bM4_TMR41_OCERW_MLBUFENW1                       *((volatile unsigned int*)(0x422E045CUL))
#define bM4_TMR41_OCERW_LMCHW                           *((volatile unsigned int*)(0x422E0460UL))
#define bM4_TMR41_OCERW_LMCLW                           *((volatile unsigned int*)(0x422E0464UL))
#define bM4_TMR41_OCERW_LMMHW                           *((volatile unsigned int*)(0x422E0468UL))
#define bM4_TMR41_OCERW_LMMLW                           *((volatile unsigned int*)(0x422E046CUL))
#define bM4_TMR41_OCERW_MCECHW                          *((volatile unsigned int*)(0x422E0470UL))
#define bM4_TMR41_OCERW_MCECLW                          *((volatile unsigned int*)(0x422E0474UL))
#define bM4_TMR41_OCMRUH_OCFDCHUH                       *((volatile unsigned int*)(0x422E0480UL))
#define bM4_TMR41_OCMRUH_OCFPKHUH                       *((volatile unsigned int*)(0x422E0484UL))
#define bM4_TMR41_OCMRUH_OCFUCHUH                       *((volatile unsigned int*)(0x422E0488UL))
#define bM4_TMR41_OCMRUH_OCFZRHUH                       *((volatile unsigned int*)(0x422E048CUL))
#define bM4_TMR41_OCMRUH_OPDCHUH0                       *((volatile unsigned int*)(0x422E0490UL))
#define bM4_TMR41_OCMRUH_OPDCHUH1                       *((volatile unsigned int*)(0x422E0494UL))
#define bM4_TMR41_OCMRUH_OPPKHUH0                       *((volatile unsigned int*)(0x422E0498UL))
#define bM4_TMR41_OCMRUH_OPPKHUH1                       *((volatile unsigned int*)(0x422E049CUL))
#define bM4_TMR41_OCMRUH_OPUCHUH0                       *((volatile unsigned int*)(0x422E04A0UL))
#define bM4_TMR41_OCMRUH_OPUCHUH1                       *((volatile unsigned int*)(0x422E04A4UL))
#define bM4_TMR41_OCMRUH_OPZRHUH0                       *((volatile unsigned int*)(0x422E04A8UL))
#define bM4_TMR41_OCMRUH_OPZRHUH1                       *((volatile unsigned int*)(0x422E04ACUL))
#define bM4_TMR41_OCMRUH_OPNPKHUH0                      *((volatile unsigned int*)(0x422E04B0UL))
#define bM4_TMR41_OCMRUH_OPNPKHUH1                      *((volatile unsigned int*)(0x422E04B4UL))
#define bM4_TMR41_OCMRUH_OPNZRHUH0                      *((volatile unsigned int*)(0x422E04B8UL))
#define bM4_TMR41_OCMRUH_OPNZRHUH1                      *((volatile unsigned int*)(0x422E04BCUL))
#define bM4_TMR41_OCMRUL_OCFDCLUL                       *((volatile unsigned int*)(0x422E0500UL))
#define bM4_TMR41_OCMRUL_OCFPKLUL                       *((volatile unsigned int*)(0x422E0504UL))
#define bM4_TMR41_OCMRUL_OCFUCLUL                       *((volatile unsigned int*)(0x422E0508UL))
#define bM4_TMR41_OCMRUL_OCFZRLUL                       *((volatile unsigned int*)(0x422E050CUL))
#define bM4_TMR41_OCMRUL_OPDCLUL0                       *((volatile unsigned int*)(0x422E0510UL))
#define bM4_TMR41_OCMRUL_OPDCLUL1                       *((volatile unsigned int*)(0x422E0514UL))
#define bM4_TMR41_OCMRUL_OPPKLUL0                       *((volatile unsigned int*)(0x422E0518UL))
#define bM4_TMR41_OCMRUL_OPPKLUL1                       *((volatile unsigned int*)(0x422E051CUL))
#define bM4_TMR41_OCMRUL_OPUCLUL0                       *((volatile unsigned int*)(0x422E0520UL))
#define bM4_TMR41_OCMRUL_OPUCLUL1                       *((volatile unsigned int*)(0x422E0524UL))
#define bM4_TMR41_OCMRUL_OPZRLUL0                       *((volatile unsigned int*)(0x422E0528UL))
#define bM4_TMR41_OCMRUL_OPZRLUL1                       *((volatile unsigned int*)(0x422E052CUL))
#define bM4_TMR41_OCMRUL_OPNPKLUL0                      *((volatile unsigned int*)(0x422E0530UL))
#define bM4_TMR41_OCMRUL_OPNPKLUL1                      *((volatile unsigned int*)(0x422E0534UL))
#define bM4_TMR41_OCMRUL_OPNZRLUL0                      *((volatile unsigned int*)(0x422E0538UL))
#define bM4_TMR41_OCMRUL_OPNZRLUL1                      *((volatile unsigned int*)(0x422E053CUL))
#define bM4_TMR41_OCMRUL_EOPNDCLUL0                     *((volatile unsigned int*)(0x422E0540UL))
#define bM4_TMR41_OCMRUL_EOPNDCLUL1                     *((volatile unsigned int*)(0x422E0544UL))
#define bM4_TMR41_OCMRUL_EOPNUCLUL0                     *((volatile unsigned int*)(0x422E0548UL))
#define bM4_TMR41_OCMRUL_EOPNUCLUL1                     *((volatile unsigned int*)(0x422E054CUL))
#define bM4_TMR41_OCMRUL_EOPDCLUL0                      *((volatile unsigned int*)(0x422E0550UL))
#define bM4_TMR41_OCMRUL_EOPDCLUL1                      *((volatile unsigned int*)(0x422E0554UL))
#define bM4_TMR41_OCMRUL_EOPPKLUL0                      *((volatile unsigned int*)(0x422E0558UL))
#define bM4_TMR41_OCMRUL_EOPPKLUL1                      *((volatile unsigned int*)(0x422E055CUL))
#define bM4_TMR41_OCMRUL_EOPUCLUL0                      *((volatile unsigned int*)(0x422E0560UL))
#define bM4_TMR41_OCMRUL_EOPUCLUL1                      *((volatile unsigned int*)(0x422E0564UL))
#define bM4_TMR41_OCMRUL_EOPZRLUL0                      *((volatile unsigned int*)(0x422E0568UL))
#define bM4_TMR41_OCMRUL_EOPZRLUL1                      *((volatile unsigned int*)(0x422E056CUL))
#define bM4_TMR41_OCMRUL_EOPNPKLUL0                     *((volatile unsigned int*)(0x422E0570UL))
#define bM4_TMR41_OCMRUL_EOPNPKLUL1                     *((volatile unsigned int*)(0x422E0574UL))
#define bM4_TMR41_OCMRUL_EOPNZRLUL0                     *((volatile unsigned int*)(0x422E0578UL))
#define bM4_TMR41_OCMRUL_EOPNZRLUL1                     *((volatile unsigned int*)(0x422E057CUL))
#define bM4_TMR41_OCMRVH_OCFDCHVH                       *((volatile unsigned int*)(0x422E0580UL))
#define bM4_TMR41_OCMRVH_OCFPKHVH                       *((volatile unsigned int*)(0x422E0584UL))
#define bM4_TMR41_OCMRVH_OCFUCHVH                       *((volatile unsigned int*)(0x422E0588UL))
#define bM4_TMR41_OCMRVH_OCFZRHVH                       *((volatile unsigned int*)(0x422E058CUL))
#define bM4_TMR41_OCMRVH_OPDCHVH0                       *((volatile unsigned int*)(0x422E0590UL))
#define bM4_TMR41_OCMRVH_OPDCHVH1                       *((volatile unsigned int*)(0x422E0594UL))
#define bM4_TMR41_OCMRVH_OPPKHVH0                       *((volatile unsigned int*)(0x422E0598UL))
#define bM4_TMR41_OCMRVH_OPPKHVH1                       *((volatile unsigned int*)(0x422E059CUL))
#define bM4_TMR41_OCMRVH_OPUCHVH0                       *((volatile unsigned int*)(0x422E05A0UL))
#define bM4_TMR41_OCMRVH_OPUCHVH1                       *((volatile unsigned int*)(0x422E05A4UL))
#define bM4_TMR41_OCMRVH_OPZRHVH0                       *((volatile unsigned int*)(0x422E05A8UL))
#define bM4_TMR41_OCMRVH_OPZRHVH1                       *((volatile unsigned int*)(0x422E05ACUL))
#define bM4_TMR41_OCMRVH_OPNPKHVH0                      *((volatile unsigned int*)(0x422E05B0UL))
#define bM4_TMR41_OCMRVH_OPNPKHVH1                      *((volatile unsigned int*)(0x422E05B4UL))
#define bM4_TMR41_OCMRVH_OPNZRHVH0                      *((volatile unsigned int*)(0x422E05B8UL))
#define bM4_TMR41_OCMRVH_OPNZRHVH1                      *((volatile unsigned int*)(0x422E05BCUL))
#define bM4_TMR41_OCMRVL_OCFDCLVL                       *((volatile unsigned int*)(0x422E0600UL))
#define bM4_TMR41_OCMRVL_OCFPKLVL                       *((volatile unsigned int*)(0x422E0604UL))
#define bM4_TMR41_OCMRVL_OCFUCLVL                       *((volatile unsigned int*)(0x422E0608UL))
#define bM4_TMR41_OCMRVL_OCFZRLVL                       *((volatile unsigned int*)(0x422E060CUL))
#define bM4_TMR41_OCMRVL_OPDCLVL0                       *((volatile unsigned int*)(0x422E0610UL))
#define bM4_TMR41_OCMRVL_OPDCLVL1                       *((volatile unsigned int*)(0x422E0614UL))
#define bM4_TMR41_OCMRVL_OPPKLVL0                       *((volatile unsigned int*)(0x422E0618UL))
#define bM4_TMR41_OCMRVL_OPPKLVL1                       *((volatile unsigned int*)(0x422E061CUL))
#define bM4_TMR41_OCMRVL_OPUCLVL0                       *((volatile unsigned int*)(0x422E0620UL))
#define bM4_TMR41_OCMRVL_OPUCLVL1                       *((volatile unsigned int*)(0x422E0624UL))
#define bM4_TMR41_OCMRVL_OPZRLVL0                       *((volatile unsigned int*)(0x422E0628UL))
#define bM4_TMR41_OCMRVL_OPZRLVL1                       *((volatile unsigned int*)(0x422E062CUL))
#define bM4_TMR41_OCMRVL_OPNPKLVL0                      *((volatile unsigned int*)(0x422E0630UL))
#define bM4_TMR41_OCMRVL_OPNPKLVL1                      *((volatile unsigned int*)(0x422E0634UL))
#define bM4_TMR41_OCMRVL_OPNZRLVL0                      *((volatile unsigned int*)(0x422E0638UL))
#define bM4_TMR41_OCMRVL_OPNZRLVL1                      *((volatile unsigned int*)(0x422E063CUL))
#define bM4_TMR41_OCMRVL_EOPNDCLVL0                     *((volatile unsigned int*)(0x422E0640UL))
#define bM4_TMR41_OCMRVL_EOPNDCLVL1                     *((volatile unsigned int*)(0x422E0644UL))
#define bM4_TMR41_OCMRVL_EOPNUCLVL0                     *((volatile unsigned int*)(0x422E0648UL))
#define bM4_TMR41_OCMRVL_EOPNUCLVL1                     *((volatile unsigned int*)(0x422E064CUL))
#define bM4_TMR41_OCMRVL_EOPDCLVL0                      *((volatile unsigned int*)(0x422E0650UL))
