CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_TMR41_OCMRVL_EOPDCLVL1                      *((volatile unsigned int*)(0x422E0654UL))
#define bM4_TMR41_OCMRVL_EOPPKLVL0                      *((volatile unsigned int*)(0x422E0658UL))
#define bM4_TMR41_OCMRVL_EOPPKLVL1                      *((volatile unsigned int*)(0x422E065CUL))
#define bM4_TMR41_OCMRVL_EOPUCLVL0                      *((volatile unsigned int*)(0x422E0660UL))
#define bM4_TMR41_OCMRVL_EOPUCLVL1                      *((volatile unsigned int*)(0x422E0664UL))
#define bM4_TMR41_OCMRVL_EOPZRLVL0                      *((volatile unsigned int*)(0x422E0668UL))
#define bM4_TMR41_OCMRVL_EOPZRLVL1                      *((volatile unsigned int*)(0x422E066CUL))
#define bM4_TMR41_OCMRVL_EOPNPKLVL0                     *((volatile unsigned int*)(0x422E0670UL))
#define bM4_TMR41_OCMRVL_EOPNPKLVL1                     *((volatile unsigned int*)(0x422E0674UL))
#define bM4_TMR41_OCMRVL_EOPNZRLVL0                     *((volatile unsigned int*)(0x422E0678UL))
#define bM4_TMR41_OCMRVL_EOPNZRLVL1                     *((volatile unsigned int*)(0x422E067CUL))
#define bM4_TMR41_OCMRWH_OCFDCHWH                       *((volatile unsigned int*)(0x422E0680UL))
#define bM4_TMR41_OCMRWH_OCFPKHWH                       *((volatile unsigned int*)(0x422E0684UL))
#define bM4_TMR41_OCMRWH_OCFUCHWH                       *((volatile unsigned int*)(0x422E0688UL))
#define bM4_TMR41_OCMRWH_OCFZRHWH                       *((volatile unsigned int*)(0x422E068CUL))
#define bM4_TMR41_OCMRWH_OPDCHWH0                       *((volatile unsigned int*)(0x422E0690UL))
#define bM4_TMR41_OCMRWH_OPDCHWH1                       *((volatile unsigned int*)(0x422E0694UL))
#define bM4_TMR41_OCMRWH_OPPKHWH0                       *((volatile unsigned int*)(0x422E0698UL))
#define bM4_TMR41_OCMRWH_OPPKHWH1                       *((volatile unsigned int*)(0x422E069CUL))
#define bM4_TMR41_OCMRWH_OPUCHWH0                       *((volatile unsigned int*)(0x422E06A0UL))
#define bM4_TMR41_OCMRWH_OPUCHWH1                       *((volatile unsigned int*)(0x422E06A4UL))
#define bM4_TMR41_OCMRWH_OPZRHWH0                       *((volatile unsigned int*)(0x422E06A8UL))
#define bM4_TMR41_OCMRWH_OPZRHWH1                       *((volatile unsigned int*)(0x422E06ACUL))
#define bM4_TMR41_OCMRWH_OPNPKHWH0                      *((volatile unsigned int*)(0x422E06B0UL))
#define bM4_TMR41_OCMRWH_OPNPKHWH1                      *((volatile unsigned int*)(0x422E06B4UL))
#define bM4_TMR41_OCMRWH_OPNZRHWH0                      *((volatile unsigned int*)(0x422E06B8UL))
#define bM4_TMR41_OCMRWH_OPNZRHWH1                      *((volatile unsigned int*)(0x422E06BCUL))
#define bM4_TMR41_OCMRWL_OCFDCLWL                       *((volatile unsigned int*)(0x422E0700UL))
#define bM4_TMR41_OCMRWL_OCFPKLWL                       *((volatile unsigned int*)(0x422E0704UL))
#define bM4_TMR41_OCMRWL_OCFUCLWL                       *((volatile unsigned int*)(0x422E0708UL))
#define bM4_TMR41_OCMRWL_OCFZRLWL                       *((volatile unsigned int*)(0x422E070CUL))
#define bM4_TMR41_OCMRWL_OPDCLWL0                       *((volatile unsigned int*)(0x422E0710UL))
#define bM4_TMR41_OCMRWL_OPDCLWL1                       *((volatile unsigned int*)(0x422E0714UL))
#define bM4_TMR41_OCMRWL_OPPKLWL0                       *((volatile unsigned int*)(0x422E0718UL))
#define bM4_TMR41_OCMRWL_OPPKLWL1                       *((volatile unsigned int*)(0x422E071CUL))
#define bM4_TMR41_OCMRWL_OPUCLWL0                       *((volatile unsigned int*)(0x422E0720UL))
#define bM4_TMR41_OCMRWL_OPUCLWL1                       *((volatile unsigned int*)(0x422E0724UL))
#define bM4_TMR41_OCMRWL_OPZRLWL0                       *((volatile unsigned int*)(0x422E0728UL))
#define bM4_TMR41_OCMRWL_OPZRLWL1                       *((volatile unsigned int*)(0x422E072CUL))
#define bM4_TMR41_OCMRWL_OPNPKLWL0                      *((volatile unsigned int*)(0x422E0730UL))
#define bM4_TMR41_OCMRWL_OPNPKLWL1                      *((volatile unsigned int*)(0x422E0734UL))
#define bM4_TMR41_OCMRWL_OPNZRLWL0                      *((volatile unsigned int*)(0x422E0738UL))
#define bM4_TMR41_OCMRWL_OPNZRLWL1                      *((volatile unsigned int*)(0x422E073CUL))
#define bM4_TMR41_OCMRWL_EOPNDCLWL0                     *((volatile unsigned int*)(0x422E0740UL))
#define bM4_TMR41_OCMRWL_EOPNDCLWL1                     *((volatile unsigned int*)(0x422E0744UL))
#define bM4_TMR41_OCMRWL_EOPNUCLWL0                     *((volatile unsigned int*)(0x422E0748UL))
#define bM4_TMR41_OCMRWL_EOPNUCLWL1                     *((volatile unsigned int*)(0x422E074CUL))
#define bM4_TMR41_OCMRWL_EOPDCLWL0                      *((volatile unsigned int*)(0x422E0750UL))
#define bM4_TMR41_OCMRWL_EOPDCLWL1                      *((volatile unsigned int*)(0x422E0754UL))
#define bM4_TMR41_OCMRWL_EOPPKLWL0                      *((volatile unsigned int*)(0x422E0758UL))
#define bM4_TMR41_OCMRWL_EOPPKLWL1                      *((volatile unsigned int*)(0x422E075CUL))
#define bM4_TMR41_OCMRWL_EOPUCLWL0                      *((volatile unsigned int*)(0x422E0760UL))
#define bM4_TMR41_OCMRWL_EOPUCLWL1                      *((volatile unsigned int*)(0x422E0764UL))
#define bM4_TMR41_OCMRWL_EOPZRLWL0                      *((volatile unsigned int*)(0x422E0768UL))
#define bM4_TMR41_OCMRWL_EOPZRLWL1                      *((volatile unsigned int*)(0x422E076CUL))
#define bM4_TMR41_OCMRWL_EOPNPKLWL0                     *((volatile unsigned int*)(0x422E0770UL))
#define bM4_TMR41_OCMRWL_EOPNPKLWL1                     *((volatile unsigned int*)(0x422E0774UL))
#define bM4_TMR41_OCMRWL_EOPNZRLWL0                     *((volatile unsigned int*)(0x422E0778UL))
#define bM4_TMR41_OCMRWL_EOPNZRLWL1                     *((volatile unsigned int*)(0x422E077CUL))
#define bM4_TMR41_CCSR_CKDIV0                           *((volatile unsigned int*)(0x422E0900UL))
#define bM4_TMR41_CCSR_CKDIV1                           *((volatile unsigned int*)(0x422E0904UL))
#define bM4_TMR41_CCSR_CKDIV2                           *((volatile unsigned int*)(0x422E0908UL))
#define bM4_TMR41_CCSR_CKDIV3                           *((volatile unsigned int*)(0x422E090CUL))
#define bM4_TMR41_CCSR_CLEAR                            *((volatile unsigned int*)(0x422E0910UL))
#define bM4_TMR41_CCSR_MODE                             *((volatile unsigned int*)(0x422E0914UL))
#define bM4_TMR41_CCSR_STOP                             *((volatile unsigned int*)(0x422E0918UL))
#define bM4_TMR41_CCSR_BUFEN                            *((volatile unsigned int*)(0x422E091CUL))
#define bM4_TMR41_CCSR_IRQPEN                           *((volatile unsigned int*)(0x422E0920UL))
#define bM4_TMR41_CCSR_IRQPF                            *((volatile unsigned int*)(0x422E0924UL))
#define bM4_TMR41_CCSR_IRQZEN                           *((volatile unsigned int*)(0x422E0934UL))
#define bM4_TMR41_CCSR_IRQZF                            *((volatile unsigned int*)(0x422E0938UL))
#define bM4_TMR41_CCSR_ECKEN                            *((volatile unsigned int*)(0x422E093CUL))
#define bM4_TMR41_CVPR_ZIM0                             *((volatile unsigned int*)(0x422E0940UL))
#define bM4_TMR41_CVPR_ZIM1                             *((volatile unsigned int*)(0x422E0944UL))
#define bM4_TMR41_CVPR_ZIM2                             *((volatile unsigned int*)(0x422E0948UL))
#define bM4_TMR41_CVPR_ZIM3                             *((volatile unsigned int*)(0x422E094CUL))
#define bM4_TMR41_CVPR_PIM0                             *((volatile unsigned int*)(0x422E0950UL))
#define bM4_TMR41_CVPR_PIM1                             *((volatile unsigned int*)(0x422E0954UL))
#define bM4_TMR41_CVPR_PIM2                             *((volatile unsigned int*)(0x422E0958UL))
#define bM4_TMR41_CVPR_PIM3                             *((volatile unsigned int*)(0x422E095CUL))
#define bM4_TMR41_CVPR_ZIC0                             *((volatile unsigned int*)(0x422E0960UL))
#define bM4_TMR41_CVPR_ZIC1                             *((volatile unsigned int*)(0x422E0964UL))
#define bM4_TMR41_CVPR_ZIC2                             *((volatile unsigned int*)(0x422E0968UL))
#define bM4_TMR41_CVPR_ZIC3                             *((volatile unsigned int*)(0x422E096CUL))
#define bM4_TMR41_CVPR_PIC0                             *((volatile unsigned int*)(0x422E0970UL))
#define bM4_TMR41_CVPR_PIC1                             *((volatile unsigned int*)(0x422E0974UL))
#define bM4_TMR41_CVPR_PIC2                             *((volatile unsigned int*)(0x422E0978UL))
#define bM4_TMR41_CVPR_PIC3                             *((volatile unsigned int*)(0x422E097CUL))
#define bM4_TMR41_POCRU_DIVCKU0                         *((volatile unsigned int*)(0x422E1300UL))
#define bM4_TMR41_POCRU_DIVCKU1                         *((volatile unsigned int*)(0x422E1304UL))
#define bM4_TMR41_POCRU_DIVCKU2                         *((volatile unsigned int*)(0x422E1308UL))
#define bM4_TMR41_POCRU_DIVCKU3                         *((volatile unsigned int*)(0x422E130CUL))
#define bM4_TMR41_POCRU_PWMMDU0                         *((volatile unsigned int*)(0x422E1310UL))
#define bM4_TMR41_POCRU_PWMMDU1                         *((volatile unsigned int*)(0x422E1314UL))
#define bM4_TMR41_POCRU_LVLSU0                          *((volatile unsigned int*)(0x422E1318UL))
#define bM4_TMR41_POCRU_LVLSU1                          *((volatile unsigned int*)(0x422E131CUL))
#define bM4_TMR41_POCRV_DIVCKV0                         *((volatile unsigned int*)(0x422E1380UL))
#define bM4_TMR41_POCRV_DIVCKV1                         *((volatile unsigned int*)(0x422E1384UL))
#define bM4_TMR41_POCRV_DIVCKV2                         *((volatile unsigned int*)(0x422E1388UL))
#define bM4_TMR41_POCRV_DIVCKV3                         *((volatile unsigned int*)(0x422E138CUL))
#define bM4_TMR41_POCRV_PWMMDV0                         *((volatile unsigned int*)(0x422E1390UL))
#define bM4_TMR41_POCRV_PWMMDV1                         *((volatile unsigned int*)(0x422E1394UL))
#define bM4_TMR41_POCRV_LVLSV0                          *((volatile unsigned int*)(0x422E1398UL))
#define bM4_TMR41_POCRV_LVLSV1                          *((volatile unsigned int*)(0x422E139CUL))
#define bM4_TMR41_POCRW_DIVCKW0                         *((volatile unsigned int*)(0x422E1400UL))
#define bM4_TMR41_POCRW_DIVCKW1                         *((volatile unsigned int*)(0x422E1404UL))
#define bM4_TMR41_POCRW_DIVCKW2                         *((volatile unsigned int*)(0x422E1408UL))
#define bM4_TMR41_POCRW_DIVCKW3                         *((volatile unsigned int*)(0x422E140CUL))
#define bM4_TMR41_POCRW_PWMMDW0                         *((volatile unsigned int*)(0x422E1410UL))
#define bM4_TMR41_POCRW_PWMMDW1                         *((volatile unsigned int*)(0x422E1414UL))
#define bM4_TMR41_POCRW_LVLSW0                          *((volatile unsigned int*)(0x422E1418UL))
#define bM4_TMR41_POCRW_LVLSW1                          *((volatile unsigned int*)(0x422E141CUL))
#define bM4_TMR41_RCSR_RTIDU                            *((volatile unsigned int*)(0x422E1480UL))
#define bM4_TMR41_RCSR_RTIDV                            *((volatile unsigned int*)(0x422E1484UL))
#define bM4_TMR41_RCSR_RTIDW                            *((volatile unsigned int*)(0x422E1488UL))
#define bM4_TMR41_RCSR_RTIFU                            *((volatile unsigned int*)(0x422E1490UL))
#define bM4_TMR41_RCSR_RTICU                            *((volatile unsigned int*)(0x422E1494UL))
#define bM4_TMR41_RCSR_RTEU                             *((volatile unsigned int*)(0x422E1498UL))
#define bM4_TMR41_RCSR_RTSU                             *((volatile unsigned int*)(0x422E149CUL))
#define bM4_TMR41_RCSR_RTIFV                            *((volatile unsigned int*)(0x422E14A0UL))
#define bM4_TMR41_RCSR_RTICV                            *((volatile unsigned int*)(0x422E14A4UL))
#define bM4_TMR41_RCSR_RTEV                             *((volatile unsigned int*)(0x422E14A8UL))
#define bM4_TMR41_RCSR_RTSV                             *((volatile unsigned int*)(0x422E14ACUL))
#define bM4_TMR41_RCSR_RTIFW                            *((volatile unsigned int*)(0x422E14B0UL))
#define bM4_TMR41_RCSR_RTICW                            *((volatile unsigned int*)(0x422E14B4UL))
#define bM4_TMR41_RCSR_RTEW                             *((volatile unsigned int*)(0x422E14B8UL))
#define bM4_TMR41_RCSR_RTSW                             *((volatile unsigned int*)(0x422E14BCUL))
#define bM4_TMR41_SCSRUH_BUFENUH0                       *((volatile unsigned int*)(0x422E1900UL))
#define bM4_TMR41_SCSRUH_BUFENUH1                       *((volatile unsigned int*)(0x422E1904UL))
#define bM4_TMR41_SCSRUH_EVTOSUH0                       *((volatile unsigned int*)(0x422E1908UL))
#define bM4_TMR41_SCSRUH_EVTOSUH1                       *((volatile unsigned int*)(0x422E190CUL))
#define bM4_TMR41_SCSRUH_EVTOSUH2                       *((volatile unsigned int*)(0x422E1910UL))
#define bM4_TMR41_SCSRUH_LMCUH                          *((volatile unsigned int*)(0x422E1914UL))
#define bM4_TMR41_SCSRUH_EVTMSUH                        *((volatile unsigned int*)(0x422E1920UL))
#define bM4_TMR41_SCSRUH_EVTDSUH                        *((volatile unsigned int*)(0x422E1924UL))
#define bM4_TMR41_SCSRUH_DENUH                          *((volatile unsigned int*)(0x422E1930UL))
#define bM4_TMR41_SCSRUH_PENUH                          *((volatile unsigned int*)(0x422E1934UL))
#define bM4_TMR41_SCSRUH_UENUH                          *((volatile unsigned int*)(0x422E1938UL))
#define bM4_TMR41_SCSRUH_ZENUH                          *((volatile unsigned int*)(0x422E193CUL))
#define bM4_TMR41_SCMRUH_AMCUH0                         *((volatile unsigned int*)(0x422E1940UL))
#define bM4_TMR41_SCMRUH_AMCUH1                         *((volatile unsigned int*)(0x422E1944UL))
#define bM4_TMR41_SCMRUH_AMCUH2                         *((volatile unsigned int*)(0x422E1948UL))
#define bM4_TMR41_SCMRUH_AMCUH3                         *((volatile unsigned int*)(0x422E194CUL))
#define bM4_TMR41_SCMRUH_MZCEUH                         *((volatile unsigned int*)(0x422E1958UL))
#define bM4_TMR41_SCMRUH_MPCEUH                         *((volatile unsigned int*)(0x422E195CUL))
#define bM4_TMR41_SCSRUL_BUFENUL0                       *((volatile unsigned int*)(0x422E1980UL))
#define bM4_TMR41_SCSRUL_BUFENUL1                       *((volatile unsigned int*)(0x422E1984UL))
#define bM4_TMR41_SCSRUL_EVTOSUL0                       *((volatile unsigned int*)(0x422E1988UL))
#define bM4_TMR41_SCSRUL_EVTOSUL1                       *((volatile unsigned int*)(0x422E198CUL))
#define bM4_TMR41_SCSRUL_EVTOSUL2                       *((volatile unsigned int*)(0x422E1990UL))
#define bM4_TMR41_SCSRUL_LMCUL                          *((volatile unsigned int*)(0x422E1994UL))
#define bM4_TMR41_SCSRUL_EVTMSUL                        *((volatile unsigned int*)(0x422E19A0UL))
#define bM4_TMR41_SCSRUL_EVTDSUL                        *((volatile unsigned int*)(0x422E19A4UL))
#define bM4_TMR41_SCSRUL_DENUL                          *((volatile unsigned int*)(0x422E19B0UL))
#define bM4_TMR41_SCSRUL_PENUL                          *((volatile unsigned int*)(0x422E19B4UL))
#define bM4_TMR41_SCSRUL_UENUL                          *((volatile unsigned int*)(0x422E19B8UL))
#define bM4_TMR41_SCSRUL_ZENUL                          *((volatile unsigned int*)(0x422E19BCUL))
#define bM4_TMR41_SCMRUL_AMCUL0                         *((volatile unsigned int*)(0x422E19C0UL))
#define bM4_TMR41_SCMRUL_AMCUL1                         *((volatile unsigned int*)(0x422E19C4UL))
#define bM4_TMR41_SCMRUL_AMCUL2                         *((volatile unsigned int*)(0x422E19C8UL))
#define bM4_TMR41_SCMRUL_AMCUL3                         *((volatile unsigned int*)(0x422E19CCUL))
#define bM4_TMR41_SCMRUL_MZCEUL                         *((volatile unsigned int*)(0x422E19D8UL))
#define bM4_TMR41_SCMRUL_MPCEUL                         *((volatile unsigned int*)(0x422E19DCUL))
#define bM4_TMR41_SCSRVH_BUFENVH0                       *((volatile unsigned int*)(0x422E1A00UL))
#define bM4_TMR41_SCSRVH_BUFENVH1                       *((volatile unsigned int*)(0x422E1A04UL))
#define bM4_TMR41_SCSRVH_EVTOSVH0                       *((volatile unsigned int*)(0x422E1A08UL))
#define bM4_TMR41_SCSRVH_EVTOSVH1                       *((volatile unsigned int*)(0x422E1A0CUL))
#define bM4_TMR41_SCSRVH_EVTOSVH2                       *((volatile unsigned int*)(0x422E1A10UL))
#define bM4_TMR41_SCSRVH_LMCVH                          *((volatile unsigned int*)(0x422E1A14UL))
#define bM4_TMR41_SCSRVH_EVTMSVH                        *((volatile unsigned int*)(0x422E1A20UL))
#define bM4_TMR41_SCSRVH_EVTDSVH                        *((volatile unsigned int*)(0x422E1A24UL))
#define bM4_TMR41_SCSRVH_DENVH                          *((volatile unsigned int*)(0x422E1A30UL))
#define bM4_TMR41_SCSRVH_PENVH                          *((volatile unsigned int*)(0x422E1A34UL))
#define bM4_TMR41_SCSRVH_UENVH                          *((volatile unsigned int*)(0x422E1A38UL))
#define bM4_TMR41_SCSRVH_ZENVH                          *((volatile unsigned int*)(0x422E1A3CUL))
#define bM4_TMR41_SCMRVH_AMCVH0                         *((volatile unsigned int*)(0x422E1A40UL))
#define bM4_TMR41_SCMRVH_AMCVH1                         *((volatile unsigned int*)(0x422E1A44UL))
#define bM4_TMR41_SCMRVH_AMCVH2                         *((volatile unsigned int*)(0x422E1A48UL))
#define bM4_TMR41_SCMRVH_AMCVH3                         *((volatile unsigned int*)(0x422E1A4CUL))
#define bM4_TMR41_SCMRVH_MZCEVH                         *((volatile unsigned int*)(0x422E1A58UL))
#define bM4_TMR41_SCMRVH_MPCEVH                         *((volatile unsigned int*)(0x422E1A5CUL))
#define bM4_TMR41_SCSRVL_BUFENVL0                       *((volatile unsigned int*)(0x422E1A80UL))
#define bM4_TMR41_SCSRVL_BUFENVL1                       *((volatile unsigned int*)(0x422E1A84UL))
#define bM4_TMR41_SCSRVL_EVTOSVL0                       *((volatile unsigned int*)(0x422E1A88UL))
#define bM4_TMR41_SCSRVL_EVTOSVL1                       *((volatile unsigned int*)(0x422E1A8CUL))
#define bM4_TMR41_SCSRVL_EVTOSVL2                       *((volatile unsigned int*)(0x422E1A90UL))
#define bM4_TMR41_SCSRVL_LMCVL                          *((volatile unsigned int*)(0x422E1A94UL))
#define bM4_TMR41_SCSRVL_EVTMSVL                        *((volatile unsigned int*)(0x422E1AA0UL))
#define bM4_TMR41_SCSRVL_EVTDSVL                        *((volatile unsigned int*)(0x422E1AA4UL))
#define bM4_TMR41_SCSRVL_DENVL                          *((volatile unsigned int*)(0x422E1AB0UL))
#define bM4_TMR41_SCSRVL_PENVL                          *((volatile unsigned int*)(0x422E1AB4UL))
#define bM4_TMR41_SCSRVL_UENVL                          *((volatile unsigned int*)(0x422E1AB8UL))
#define bM4_TMR41_SCSRVL_ZENVL                          *((volatile unsigned int*)(0x422E1ABCUL))
#define bM4_TMR41_SCMRVL_AMCVL0                         *((volatile unsigned int*)(0x422E1AC0UL))
#define bM4_TMR41_SCMRVL_AMCVL1                         *((volatile unsigned int*)(0x422E1AC4UL))
#define bM4_TMR41_SCMRVL_AMCVL2                         *((volatile unsigned int*)(0x422E1AC8UL))
#define bM4_TMR41_SCMRVL_AMCVL3                         *((volatile unsigned int*)(0x422E1ACCUL))
#define bM4_TMR41_SCMRVL_MZCEVL                         *((volatile unsigned int*)(0x422E1AD8UL))
#define bM4_TMR41_SCMRVL_MPCEVL                         *((volatile unsigned int*)(0x422E1ADCUL))
#define bM4_TMR41_SCSRWH_BUFENWH0                       *((volatile unsigned int*)(0x422E1B00UL))
#define bM4_TMR41_SCSRWH_BUFENWH1                       *((volatile unsigned int*)(0x422E1B04UL))
#define bM4_TMR41_SCSRWH_EVTOSWH0                       *((volatile unsigned int*)(0x422E1B08UL))
#define bM4_TMR41_SCSRWH_EVTOSWH1                       *((volatile unsigned int*)(0x422E1B0CUL))
#define bM4_TMR41_SCSRWH_EVTOSWH2                       *((volatile unsigned int*)(0x422E1B10UL))
#define bM4_TMR41_SCSRWH_LMCWH                          *((volatile unsigned int*)(0x422E1B14UL))
#define bM4_TMR41_SCSRWH_EVTMSWH                        *((volatile unsigned int*)(0x422E1B20UL))
#define bM4_TMR41_SCSRWH_EVTDSWH                        *((volatile unsigned int*)(0x422E1B24UL))
#define bM4_TMR41_SCSRWH_DENWH                          *((volatile unsigned int*)(0x422E1B30UL))
#define bM4_TMR41_SCSRWH_PENWH                          *((volatile unsigned int*)(0x422E1B34UL))
#define bM4_TMR41_SCSRWH_UENWH                          *((volatile unsigned int*)(0x422E1B38UL))
#define bM4_TMR41_SCSRWH_ZENWH                          *((volatile unsigned int*)(0x422E1B3CUL))
#define bM4_TMR41_SCMRWH_AMCWH0                         *((volatile unsigned int*)(0x422E1B40UL))
#define bM4_TMR41_SCMRWH_AMCWH1                         *((volatile unsigned int*)(0x422E1B44UL))
#define bM4_TMR41_SCMRWH_AMCWH2                         *((volatile unsigned int*)(0x422E1B48UL))
#define bM4_TMR41_SCMRWH_AMCWH3                         *((volatile unsigned int*)(0x422E1B4CUL))
#define bM4_TMR41_SCMRWH_MZCEWH                         *((volatile unsigned int*)(0x422E1B58UL))
#define bM4_TMR41_SCMRWH_MPCEWH                         *((volatile unsigned int*)(0x422E1B5CUL))
#define bM4_TMR41_SCSRWL_BUFENWL0                       *((volatile unsigned int*)(0x422E1B80UL))
#define bM4_TMR41_SCSRWL_BUFENWL1                       *((volatile unsigned int*)(0x422E1B84UL))
#define bM4_TMR41_SCSRWL_EVTOSWL0                       *((volatile unsigned int*)(0x422E1B88UL))
#define bM4_TMR41_SCSRWL_EVTOSWL1                       *((volatile unsigned int*)(0x422E1B8CUL))
#define bM4_TMR41_SCSRWL_EVTOSWL2                       *((volatile unsigned int*)(0x422E1B90UL))
#define bM4_TMR41_SCSRWL_LMCWL                          *((volatile unsigned int*)(0x422E1B94UL))
#define bM4_TMR41_SCSRWL_EVTMSWL                        *((volatile unsigned int*)(0x422E1BA0UL))
#define bM4_TMR41_SCSRWL_EVTDSWL                        *((volatile unsigned int*)(0x422E1BA4UL))
#define bM4_TMR41_SCSRWL_DENWL                          *((volatile unsigned int*)(0x422E1BB0UL))
#define bM4_TMR41_SCSRWL_PENWL                          *((volatile unsigned int*)(0x422E1BB4UL))
#define bM4_TMR41_SCSRWL_UENWL                          *((volatile unsigned int*)(0x422E1BB8UL))
#define bM4_TMR41_SCSRWL_ZENWL                          *((volatile unsigned int*)(0x422E1BBCUL))
#define bM4_TMR41_SCMRWL_AMCWL0                         *((volatile unsigned int*)(0x422E1BC0UL))
#define bM4_TMR41_SCMRWL_AMCWL1                         *((volatile unsigned int*)(0x422E1BC4UL))
#define bM4_TMR41_SCMRWL_AMCWL2                         *((volatile unsigned int*)(0x422E1BC8UL))
#define bM4_TMR41_SCMRWL_AMCWL3                         *((volatile unsigned int*)(0x422E1BCCUL))
#define bM4_TMR41_SCMRWL_MZCEWL                         *((volatile unsigned int*)(0x422E1BD8UL))
#define bM4_TMR41_SCMRWL_MPCEWL                         *((volatile unsigned int*)(0x422E1BDCUL))
#define bM4_TMR41_ECSR_HOLD                             *((volatile unsigned int*)(0x422E1E1CUL))
#define bM4_TMR42_OCSRU_OCEHU                           *((volatile unsigned int*)(0x42490300UL))
#define bM4_TMR42_OCSRU_OCELU                           *((volatile unsigned int*)(0x42490304UL))
#define bM4_TMR42_OCSRU_OCPHU                           *((volatile unsigned int*)(0x42490308UL))
#define bM4_TMR42_OCSRU_OCPLU                           *((volatile unsigned int*)(0x4249030CUL))
#define bM4_TMR42_OCSRU_OCIEHU                          *((volatile unsigned int*)(0x42490310UL))
#define bM4_TMR42_OCSRU_OCIELU                          *((volatile unsigned int*)(0x42490314UL))
#define bM4_TMR42_OCSRU_OCFHU                           *((volatile unsigned int*)(0x42490318UL))
#define bM4_TMR42_OCSRU_OCFLU                           *((volatile unsigned int*)(0x4249031CUL))
