CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_TMR42_OCERU_CHBUFENU0                       *((volatile unsigned int*)(0x42490340UL))
#define bM4_TMR42_OCERU_CHBUFENU1                       *((volatile unsigned int*)(0x42490344UL))
#define bM4_TMR42_OCERU_CLBUFENU0                       *((volatile unsigned int*)(0x42490348UL))
#define bM4_TMR42_OCERU_CLBUFENU1                       *((volatile unsigned int*)(0x4249034CUL))
#define bM4_TMR42_OCERU_MHBUFENU0                       *((volatile unsigned int*)(0x42490350UL))
#define bM4_TMR42_OCERU_MHBUFENU1                       *((volatile unsigned int*)(0x42490354UL))
#define bM4_TMR42_OCERU_MLBUFENU0                       *((volatile unsigned int*)(0x42490358UL))
#define bM4_TMR42_OCERU_MLBUFENU1                       *((volatile unsigned int*)(0x4249035CUL))
#define bM4_TMR42_OCERU_LMCHU                           *((volatile unsigned int*)(0x42490360UL))
#define bM4_TMR42_OCERU_LMCLU                           *((volatile unsigned int*)(0x42490364UL))
#define bM4_TMR42_OCERU_LMMHU                           *((volatile unsigned int*)(0x42490368UL))
#define bM4_TMR42_OCERU_LMMLU                           *((volatile unsigned int*)(0x4249036CUL))
#define bM4_TMR42_OCERU_MCECHU                          *((volatile unsigned int*)(0x42490370UL))
#define bM4_TMR42_OCERU_MCECLU                          *((volatile unsigned int*)(0x42490374UL))
#define bM4_TMR42_OCSRV_OCEHV                           *((volatile unsigned int*)(0x42490380UL))
#define bM4_TMR42_OCSRV_OCELV                           *((volatile unsigned int*)(0x42490384UL))
#define bM4_TMR42_OCSRV_OCPHV                           *((volatile unsigned int*)(0x42490388UL))
#define bM4_TMR42_OCSRV_OCPLV                           *((volatile unsigned int*)(0x4249038CUL))
#define bM4_TMR42_OCSRV_OCIEHV                          *((volatile unsigned int*)(0x42490390UL))
#define bM4_TMR42_OCSRV_OCIELV                          *((volatile unsigned int*)(0x42490394UL))
#define bM4_TMR42_OCSRV_OCFHV                           *((volatile unsigned int*)(0x42490398UL))
#define bM4_TMR42_OCSRV_OCFLV                           *((volatile unsigned int*)(0x4249039CUL))
#define bM4_TMR42_OCERV_CHBUFENV0                       *((volatile unsigned int*)(0x424903C0UL))
#define bM4_TMR42_OCERV_CHBUFENV1                       *((volatile unsigned int*)(0x424903C4UL))
#define bM4_TMR42_OCERV_CLBUFENV0                       *((volatile unsigned int*)(0x424903C8UL))
#define bM4_TMR42_OCERV_CLBUFENV1                       *((volatile unsigned int*)(0x424903CCUL))
#define bM4_TMR42_OCERV_MHBUFENV0                       *((volatile unsigned int*)(0x424903D0UL))
#define bM4_TMR42_OCERV_MHBUFENV1                       *((volatile unsigned int*)(0x424903D4UL))
#define bM4_TMR42_OCERV_MLBUFENV0                       *((volatile unsigned int*)(0x424903D8UL))
#define bM4_TMR42_OCERV_MLBUFENV1                       *((volatile unsigned int*)(0x424903DCUL))
#define bM4_TMR42_OCERV_LMCHV                           *((volatile unsigned int*)(0x424903E0UL))
#define bM4_TMR42_OCERV_LMCLV                           *((volatile unsigned int*)(0x424903E4UL))
#define bM4_TMR42_OCERV_LMMHV                           *((volatile unsigned int*)(0x424903E8UL))
#define bM4_TMR42_OCERV_LMMLV                           *((volatile unsigned int*)(0x424903ECUL))
#define bM4_TMR42_OCERV_MCECHV                          *((volatile unsigned int*)(0x424903F0UL))
#define bM4_TMR42_OCERV_MCECLV                          *((volatile unsigned int*)(0x424903F4UL))
#define bM4_TMR42_OCSRW_OCEHW                           *((volatile unsigned int*)(0x42490400UL))
#define bM4_TMR42_OCSRW_OCELW                           *((volatile unsigned int*)(0x42490404UL))
#define bM4_TMR42_OCSRW_OCPHW                           *((volatile unsigned int*)(0x42490408UL))
#define bM4_TMR42_OCSRW_OCPLW                           *((volatile unsigned int*)(0x4249040CUL))
#define bM4_TMR42_OCSRW_OCIEHW                          *((volatile unsigned int*)(0x42490410UL))
#define bM4_TMR42_OCSRW_OCIELW                          *((volatile unsigned int*)(0x42490414UL))
#define bM4_TMR42_OCSRW_OCFHW                           *((volatile unsigned int*)(0x42490418UL))
#define bM4_TMR42_OCSRW_OCFLW                           *((volatile unsigned int*)(0x4249041CUL))
#define bM4_TMR42_OCERW_CHBUFENW0                       *((volatile unsigned int*)(0x42490440UL))
#define bM4_TMR42_OCERW_CHBUFENW1                       *((volatile unsigned int*)(0x42490444UL))
#define bM4_TMR42_OCERW_CLBUFENW0                       *((volatile unsigned int*)(0x42490448UL))
#define bM4_TMR42_OCERW_CLBUFENW1                       *((volatile unsigned int*)(0x4249044CUL))
#define bM4_TMR42_OCERW_MHBUFENW0                       *((volatile unsigned int*)(0x42490450UL))
#define bM4_TMR42_OCERW_MHBUFENW1                       *((volatile unsigned int*)(0x42490454UL))
#define bM4_TMR42_OCERW_MLBUFENW0                       *((volatile unsigned int*)(0x42490458UL))
#define bM4_TMR42_OCERW_MLBUFENW1                       *((volatile unsigned int*)(0x4249045CUL))
#define bM4_TMR42_OCERW_LMCHW                           *((volatile unsigned int*)(0x42490460UL))
#define bM4_TMR42_OCERW_LMCLW                           *((volatile unsigned int*)(0x42490464UL))
#define bM4_TMR42_OCERW_LMMHW                           *((volatile unsigned int*)(0x42490468UL))
#define bM4_TMR42_OCERW_LMMLW                           *((volatile unsigned int*)(0x4249046CUL))
#define bM4_TMR42_OCERW_MCECHW                          *((volatile unsigned int*)(0x42490470UL))
#define bM4_TMR42_OCERW_MCECLW                          *((volatile unsigned int*)(0x42490474UL))
#define bM4_TMR42_OCMRUH_OCFDCHUH                       *((volatile unsigned int*)(0x42490480UL))
#define bM4_TMR42_OCMRUH_OCFPKHUH                       *((volatile unsigned int*)(0x42490484UL))
#define bM4_TMR42_OCMRUH_OCFUCHUH                       *((volatile unsigned int*)(0x42490488UL))
#define bM4_TMR42_OCMRUH_OCFZRHUH                       *((volatile unsigned int*)(0x4249048CUL))
#define bM4_TMR42_OCMRUH_OPDCHUH0                       *((volatile unsigned int*)(0x42490490UL))
#define bM4_TMR42_OCMRUH_OPDCHUH1                       *((volatile unsigned int*)(0x42490494UL))
#define bM4_TMR42_OCMRUH_OPPKHUH0                       *((volatile unsigned int*)(0x42490498UL))
#define bM4_TMR42_OCMRUH_OPPKHUH1                       *((volatile unsigned int*)(0x4249049CUL))
#define bM4_TMR42_OCMRUH_OPUCHUH0                       *((volatile unsigned int*)(0x424904A0UL))
#define bM4_TMR42_OCMRUH_OPUCHUH1                       *((volatile unsigned int*)(0x424904A4UL))
#define bM4_TMR42_OCMRUH_OPZRHUH0                       *((volatile unsigned int*)(0x424904A8UL))
#define bM4_TMR42_OCMRUH_OPZRHUH1                       *((volatile unsigned int*)(0x424904ACUL))
#define bM4_TMR42_OCMRUH_OPNPKHUH0                      *((volatile unsigned int*)(0x424904B0UL))
#define bM4_TMR42_OCMRUH_OPNPKHUH1                      *((volatile unsigned int*)(0x424904B4UL))
#define bM4_TMR42_OCMRUH_OPNZRHUH0                      *((volatile unsigned int*)(0x424904B8UL))
#define bM4_TMR42_OCMRUH_OPNZRHUH1                      *((volatile unsigned int*)(0x424904BCUL))
#define bM4_TMR42_OCMRUL_OCFDCLUL                       *((volatile unsigned int*)(0x42490500UL))
#define bM4_TMR42_OCMRUL_OCFPKLUL                       *((volatile unsigned int*)(0x42490504UL))
#define bM4_TMR42_OCMRUL_OCFUCLUL                       *((volatile unsigned int*)(0x42490508UL))
#define bM4_TMR42_OCMRUL_OCFZRLUL                       *((volatile unsigned int*)(0x4249050CUL))
#define bM4_TMR42_OCMRUL_OPDCLUL0                       *((volatile unsigned int*)(0x42490510UL))
#define bM4_TMR42_OCMRUL_OPDCLUL1                       *((volatile unsigned int*)(0x42490514UL))
#define bM4_TMR42_OCMRUL_OPPKLUL0                       *((volatile unsigned int*)(0x42490518UL))
#define bM4_TMR42_OCMRUL_OPPKLUL1                       *((volatile unsigned int*)(0x4249051CUL))
#define bM4_TMR42_OCMRUL_OPUCLUL0                       *((volatile unsigned int*)(0x42490520UL))
#define bM4_TMR42_OCMRUL_OPUCLUL1                       *((volatile unsigned int*)(0x42490524UL))
#define bM4_TMR42_OCMRUL_OPZRLUL0                       *((volatile unsigned int*)(0x42490528UL))
#define bM4_TMR42_OCMRUL_OPZRLUL1                       *((volatile unsigned int*)(0x4249052CUL))
#define bM4_TMR42_OCMRUL_OPNPKLUL0                      *((volatile unsigned int*)(0x42490530UL))
#define bM4_TMR42_OCMRUL_OPNPKLUL1                      *((volatile unsigned int*)(0x42490534UL))
#define bM4_TMR42_OCMRUL_OPNZRLUL0                      *((volatile unsigned int*)(0x42490538UL))
#define bM4_TMR42_OCMRUL_OPNZRLUL1                      *((volatile unsigned int*)(0x4249053CUL))
#define bM4_TMR42_OCMRUL_EOPNDCLUL0                     *((volatile unsigned int*)(0x42490540UL))
#define bM4_TMR42_OCMRUL_EOPNDCLUL1                     *((volatile unsigned int*)(0x42490544UL))
#define bM4_TMR42_OCMRUL_EOPNUCLUL0                     *((volatile unsigned int*)(0x42490548UL))
#define bM4_TMR42_OCMRUL_EOPNUCLUL1                     *((volatile unsigned int*)(0x4249054CUL))
#define bM4_TMR42_OCMRUL_EOPDCLUL0                      *((volatile unsigned int*)(0x42490550UL))
#define bM4_TMR42_OCMRUL_EOPDCLUL1                      *((volatile unsigned int*)(0x42490554UL))
#define bM4_TMR42_OCMRUL_EOPPKLUL0                      *((volatile unsigned int*)(0x42490558UL))
#define bM4_TMR42_OCMRUL_EOPPKLUL1                      *((volatile unsigned int*)(0x4249055CUL))
#define bM4_TMR42_OCMRUL_EOPUCLUL0                      *((volatile unsigned int*)(0x42490560UL))
#define bM4_TMR42_OCMRUL_EOPUCLUL1                      *((volatile unsigned int*)(0x42490564UL))
#define bM4_TMR42_OCMRUL_EOPZRLUL0                      *((volatile unsigned int*)(0x42490568UL))
#define bM4_TMR42_OCMRUL_EOPZRLUL1                      *((volatile unsigned int*)(0x4249056CUL))
#define bM4_TMR42_OCMRUL_EOPNPKLUL0                     *((volatile unsigned int*)(0x42490570UL))
#define bM4_TMR42_OCMRUL_EOPNPKLUL1                     *((volatile unsigned int*)(0x42490574UL))
#define bM4_TMR42_OCMRUL_EOPNZRLUL0                     *((volatile unsigned int*)(0x42490578UL))
#define bM4_TMR42_OCMRUL_EOPNZRLUL1                     *((volatile unsigned int*)(0x4249057CUL))
#define bM4_TMR42_OCMRVH_OCFDCHVH                       *((volatile unsigned int*)(0x42490580UL))
#define bM4_TMR42_OCMRVH_OCFPKHVH                       *((volatile unsigned int*)(0x42490584UL))
#define bM4_TMR42_OCMRVH_OCFUCHVH                       *((volatile unsigned int*)(0x42490588UL))
#define bM4_TMR42_OCMRVH_OCFZRHVH                       *((volatile unsigned int*)(0x4249058CUL))
#define bM4_TMR42_OCMRVH_OPDCHVH0                       *((volatile unsigned int*)(0x42490590UL))
#define bM4_TMR42_OCMRVH_OPDCHVH1                       *((volatile unsigned int*)(0x42490594UL))
#define bM4_TMR42_OCMRVH_OPPKHVH0                       *((volatile unsigned int*)(0x42490598UL))
#define bM4_TMR42_OCMRVH_OPPKHVH1                       *((volatile unsigned int*)(0x4249059CUL))
#define bM4_TMR42_OCMRVH_OPUCHVH0                       *((volatile unsigned int*)(0x424905A0UL))
#define bM4_TMR42_OCMRVH_OPUCHVH1                       *((volatile unsigned int*)(0x424905A4UL))
#define bM4_TMR42_OCMRVH_OPZRHVH0                       *((volatile unsigned int*)(0x424905A8UL))
#define bM4_TMR42_OCMRVH_OPZRHVH1                       *((volatile unsigned int*)(0x424905ACUL))
#define bM4_TMR42_OCMRVH_OPNPKHVH0                      *((volatile unsigned int*)(0x424905B0UL))
#define bM4_TMR42_OCMRVH_OPNPKHVH1                      *((volatile unsigned int*)(0x424905B4UL))
#define bM4_TMR42_OCMRVH_OPNZRHVH0                      *((volatile unsigned int*)(0x424905B8UL))
#define bM4_TMR42_OCMRVH_OPNZRHVH1                      *((volatile unsigned int*)(0x424905BCUL))
#define bM4_TMR42_OCMRVL_OCFDCLVL                       *((volatile unsigned int*)(0x42490600UL))
#define bM4_TMR42_OCMRVL_OCFPKLVL                       *((volatile unsigned int*)(0x42490604UL))
#define bM4_TMR42_OCMRVL_OCFUCLVL                       *((volatile unsigned int*)(0x42490608UL))
#define bM4_TMR42_OCMRVL_OCFZRLVL                       *((volatile unsigned int*)(0x4249060CUL))
#define bM4_TMR42_OCMRVL_OPDCLVL0                       *((volatile unsigned int*)(0x42490610UL))
#define bM4_TMR42_OCMRVL_OPDCLVL1                       *((volatile unsigned int*)(0x42490614UL))
#define bM4_TMR42_OCMRVL_OPPKLVL0                       *((volatile unsigned int*)(0x42490618UL))
#define bM4_TMR42_OCMRVL_OPPKLVL1                       *((volatile unsigned int*)(0x4249061CUL))
#define bM4_TMR42_OCMRVL_OPUCLVL0                       *((volatile unsigned int*)(0x42490620UL))
#define bM4_TMR42_OCMRVL_OPUCLVL1                       *((volatile unsigned int*)(0x42490624UL))
#define bM4_TMR42_OCMRVL_OPZRLVL0                       *((volatile unsigned int*)(0x42490628UL))
#define bM4_TMR42_OCMRVL_OPZRLVL1                       *((volatile unsigned int*)(0x4249062CUL))
#define bM4_TMR42_OCMRVL_OPNPKLVL0                      *((volatile unsigned int*)(0x42490630UL))
#define bM4_TMR42_OCMRVL_OPNPKLVL1                      *((volatile unsigned int*)(0x42490634UL))
#define bM4_TMR42_OCMRVL_OPNZRLVL0                      *((volatile unsigned int*)(0x42490638UL))
#define bM4_TMR42_OCMRVL_OPNZRLVL1                      *((volatile unsigned int*)(0x4249063CUL))
#define bM4_TMR42_OCMRVL_EOPNDCLVL0                     *((volatile unsigned int*)(0x42490640UL))
#define bM4_TMR42_OCMRVL_EOPNDCLVL1                     *((volatile unsigned int*)(0x42490644UL))
#define bM4_TMR42_OCMRVL_EOPNUCLVL0                     *((volatile unsigned int*)(0x42490648UL))
#define bM4_TMR42_OCMRVL_EOPNUCLVL1                     *((volatile unsigned int*)(0x4249064CUL))
#define bM4_TMR42_OCMRVL_EOPDCLVL0                      *((volatile unsigned int*)(0x42490650UL))
#define bM4_TMR42_OCMRVL_EOPDCLVL1                      *((volatile unsigned int*)(0x42490654UL))
#define bM4_TMR42_OCMRVL_EOPPKLVL0                      *((volatile unsigned int*)(0x42490658UL))
#define bM4_TMR42_OCMRVL_EOPPKLVL1                      *((volatile unsigned int*)(0x4249065CUL))
#define bM4_TMR42_OCMRVL_EOPUCLVL0                      *((volatile unsigned int*)(0x42490660UL))
#define bM4_TMR42_OCMRVL_EOPUCLVL1                      *((volatile unsigned int*)(0x42490664UL))
#define bM4_TMR42_OCMRVL_EOPZRLVL0                      *((volatile unsigned int*)(0x42490668UL))
#define bM4_TMR42_OCMRVL_EOPZRLVL1                      *((volatile unsigned int*)(0x4249066CUL))
#define bM4_TMR42_OCMRVL_EOPNPKLVL0                     *((volatile unsigned int*)(0x42490670UL))
#define bM4_TMR42_OCMRVL_EOPNPKLVL1                     *((volatile unsigned int*)(0x42490674UL))
#define bM4_TMR42_OCMRVL_EOPNZRLVL0                     *((volatile unsigned int*)(0x42490678UL))
#define bM4_TMR42_OCMRVL_EOPNZRLVL1                     *((volatile unsigned int*)(0x4249067CUL))
#define bM4_TMR42_OCMRWH_OCFDCHWH                       *((volatile unsigned int*)(0x42490680UL))
#define bM4_TMR42_OCMRWH_OCFPKHWH                       *((volatile unsigned int*)(0x42490684UL))
#define bM4_TMR42_OCMRWH_OCFUCHWH                       *((volatile unsigned int*)(0x42490688UL))
#define bM4_TMR42_OCMRWH_OCFZRHWH                       *((volatile unsigned int*)(0x4249068CUL))
#define bM4_TMR42_OCMRWH_OPDCHWH0                       *((volatile unsigned int*)(0x42490690UL))
#define bM4_TMR42_OCMRWH_OPDCHWH1                       *((volatile unsigned int*)(0x42490694UL))
#define bM4_TMR42_OCMRWH_OPPKHWH0                       *((volatile unsigned int*)(0x42490698UL))
#define bM4_TMR42_OCMRWH_OPPKHWH1                       *((volatile unsigned int*)(0x4249069CUL))
#define bM4_TMR42_OCMRWH_OPUCHWH0                       *((volatile unsigned int*)(0x424906A0UL))
#define bM4_TMR42_OCMRWH_OPUCHWH1                       *((volatile unsigned int*)(0x424906A4UL))
#define bM4_TMR42_OCMRWH_OPZRHWH0                       *((volatile unsigned int*)(0x424906A8UL))
#define bM4_TMR42_OCMRWH_OPZRHWH1                       *((volatile unsigned int*)(0x424906ACUL))
#define bM4_TMR42_OCMRWH_OPNPKHWH0                      *((volatile unsigned int*)(0x424906B0UL))
#define bM4_TMR42_OCMRWH_OPNPKHWH1                      *((volatile unsigned int*)(0x424906B4UL))
#define bM4_TMR42_OCMRWH_OPNZRHWH0                      *((volatile unsigned int*)(0x424906B8UL))
#define bM4_TMR42_OCMRWH_OPNZRHWH1                      *((volatile unsigned int*)(0x424906BCUL))
#define bM4_TMR42_OCMRWL_OCFDCLWL                       *((volatile unsigned int*)(0x42490700UL))
#define bM4_TMR42_OCMRWL_OCFPKLWL                       *((volatile unsigned int*)(0x42490704UL))
#define bM4_TMR42_OCMRWL_OCFUCLWL                       *((volatile unsigned int*)(0x42490708UL))
#define bM4_TMR42_OCMRWL_OCFZRLWL                       *((volatile unsigned int*)(0x4249070CUL))
#define bM4_TMR42_OCMRWL_OPDCLWL0                       *((volatile unsigned int*)(0x42490710UL))
#define bM4_TMR42_OCMRWL_OPDCLWL1                       *((volatile unsigned int*)(0x42490714UL))
#define bM4_TMR42_OCMRWL_OPPKLWL0                       *((volatile unsigned int*)(0x42490718UL))
#define bM4_TMR42_OCMRWL_OPPKLWL1                       *((volatile unsigned int*)(0x4249071CUL))
#define bM4_TMR42_OCMRWL_OPUCLWL0                       *((volatile unsigned int*)(0x42490720UL))
#define bM4_TMR42_OCMRWL_OPUCLWL1                       *((volatile unsigned int*)(0x42490724UL))
#define bM4_TMR42_OCMRWL_OPZRLWL0                       *((volatile unsigned int*)(0x42490728UL))
#define bM4_TMR42_OCMRWL_OPZRLWL1                       *((volatile unsigned int*)(0x4249072CUL))
#define bM4_TMR42_OCMRWL_OPNPKLWL0                      *((volatile unsigned int*)(0x42490730UL))
#define bM4_TMR42_OCMRWL_OPNPKLWL1                      *((volatile unsigned int*)(0x42490734UL))
#define bM4_TMR42_OCMRWL_OPNZRLWL0                      *((volatile unsigned int*)(0x42490738UL))
#define bM4_TMR42_OCMRWL_OPNZRLWL1                      *((volatile unsigned int*)(0x4249073CUL))
#define bM4_TMR42_OCMRWL_EOPNDCLWL0                     *((volatile unsigned int*)(0x42490740UL))
#define bM4_TMR42_OCMRWL_EOPNDCLWL1                     *((volatile unsigned int*)(0x42490744UL))
#define bM4_TMR42_OCMRWL_EOPNUCLWL0                     *((volatile unsigned int*)(0x42490748UL))
#define bM4_TMR42_OCMRWL_EOPNUCLWL1                     *((volatile unsigned int*)(0x4249074CUL))
#define bM4_TMR42_OCMRWL_EOPDCLWL0                      *((volatile unsigned int*)(0x42490750UL))
#define bM4_TMR42_OCMRWL_EOPDCLWL1                      *((volatile unsigned int*)(0x42490754UL))
#define bM4_TMR42_OCMRWL_EOPPKLWL0                      *((volatile unsigned int*)(0x42490758UL))
#define bM4_TMR42_OCMRWL_EOPPKLWL1                      *((volatile unsigned int*)(0x4249075CUL))
#define bM4_TMR42_OCMRWL_EOPUCLWL0                      *((volatile unsigned int*)(0x42490760UL))
#define bM4_TMR42_OCMRWL_EOPUCLWL1                      *((volatile unsigned int*)(0x42490764UL))
#define bM4_TMR42_OCMRWL_EOPZRLWL0                      *((volatile unsigned int*)(0x42490768UL))
#define bM4_TMR42_OCMRWL_EOPZRLWL1                      *((volatile unsigned int*)(0x4249076CUL))
#define bM4_TMR42_OCMRWL_EOPNPKLWL0                     *((volatile unsigned int*)(0x42490770UL))
#define bM4_TMR42_OCMRWL_EOPNPKLWL1                     *((volatile unsigned int*)(0x42490774UL))
#define bM4_TMR42_OCMRWL_EOPNZRLWL0                     *((volatile unsigned int*)(0x42490778UL))
#define bM4_TMR42_OCMRWL_EOPNZRLWL1                     *((volatile unsigned int*)(0x4249077CUL))
#define bM4_TMR42_CCSR_CKDIV0                           *((volatile unsigned int*)(0x42490900UL))
#define bM4_TMR42_CCSR_CKDIV1                           *((volatile unsigned int*)(0x42490904UL))
#define bM4_TMR42_CCSR_CKDIV2                           *((volatile unsigned int*)(0x42490908UL))
#define bM4_TMR42_CCSR_CKDIV3                           *((volatile unsigned int*)(0x4249090CUL))
#define bM4_TMR42_CCSR_CLEAR                            *((volatile unsigned int*)(0x42490910UL))
#define bM4_TMR42_CCSR_MODE                             *((volatile unsigned int*)(0x42490914UL))
#define bM4_TMR42_CCSR_STOP                             *((volatile unsigned int*)(0x42490918UL))
#define bM4_TMR42_CCSR_BUFEN                            *((volatile unsigned int*)(0x4249091CUL))
#define bM4_TMR42_CCSR_IRQPEN                           *((volatile unsigned int*)(0x42490920UL))
#define bM4_TMR42_CCSR_IRQPF                            *((volatile unsigned int*)(0x42490924UL))
#define bM4_TMR42_CCSR_IRQZEN                           *((volatile unsigned int*)(0x42490934UL))
#define bM4_TMR42_CCSR_IRQZF                            *((volatile unsigned int*)(0x42490938UL))
#define bM4_TMR42_CCSR_ECKEN                            *((volatile unsigned int*)(0x4249093CUL))
#define bM4_TMR42_CVPR_ZIM0                             *((volatile unsigned int*)(0x42490940UL))
#define bM4_TMR42_CVPR_ZIM1                             *((volatile unsigned int*)(0x42490944UL))
#define bM4_TMR42_CVPR_ZIM2                             *((volatile unsigned int*)(0x42490948UL))
#define bM4_TMR42_CVPR_ZIM3                             *((volatile unsigned int*)(0x4249094CUL))
#define bM4_TMR42_CVPR_PIM0                             *((volatile unsigned int*)(0x42490950UL))
#define bM4_TMR42_CVPR_PIM1                             *((volatile unsigned int*)(0x42490954UL))
#define bM4_TMR42_CVPR_PIM2                             *((volatile unsigned int*)(0x42490958UL))
#define bM4_TMR42_CVPR_PIM3                             *((volatile unsigned int*)(0x4249095CUL))
#define bM4_TMR42_CVPR_ZIC0                             *((volatile unsigned int*)(0x42490960UL))
#define bM4_TMR42_CVPR_ZIC1                             *((volatile unsigned int*)(0x42490964UL))
#define bM4_TMR42_CVPR_ZIC2                             *((volatile unsigned int*)(0x42490968UL))
#define bM4_TMR42_CVPR_ZIC3                             *((volatile unsigned int*)(0x4249096CUL))
#define bM4_TMR42_CVPR_PIC0                             *((volatile unsigned int*)(0x42490970UL))
#define bM4_TMR42_CVPR_PIC1                             *((volatile unsigned int*)(0x42490974UL))
#define bM4_TMR42_CVPR_PIC2                             *((volatile unsigned int*)(0x42490978UL))
#define bM4_TMR42_CVPR_PIC3                             *((volatile unsigned int*)(0x4249097CUL))
#define bM4_TMR42_POCRU_DIVCKU0                         *((volatile unsigned int*)(0x42491300UL))
#define bM4_TMR42_POCRU_DIVCKU1                         *((volatile unsigned int*)(0x42491304UL))
#define bM4_TMR42_POCRU_DIVCKU2                         *((volatile unsigned int*)(0x42491308UL))
#define bM4_TMR42_POCRU_DIVCKU3                         *((volatile unsigned int*)(0x4249130CUL))
#define bM4_TMR42_POCRU_PWMMDU0                         *((volatile unsigned int*)(0x42491310UL))
#define bM4_TMR42_POCRU_PWMMDU1                         *((volatile unsigned int*)(0x42491314UL))
#define bM4_TMR42_POCRU_LVLSU0                          *((volatile unsigned int*)(0x42491318UL))
#define bM4_TMR42_POCRU_LVLSU1                          *((volatile unsigned int*)(0x4249131CUL))
#define bM4_TMR42_POCRV_DIVCKV0                         *((volatile unsigned int*)(0x42491380UL))
#define bM4_TMR42_POCRV_DIVCKV1                         *((volatile unsigned int*)(0x42491384UL))
#define bM4_TMR42_POCRV_DIVCKV2                         *((volatile unsigned int*)(0x42491388UL))
#define bM4_TMR42_POCRV_DIVCKV3                         *((volatile unsigned int*)(0x4249138CUL))
#define bM4_TMR42_POCRV_PWMMDV0                         *((volatile unsigned int*)(0x42491390UL))
