CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_TMR42_POCRV_PWMMDV1                         *((volatile unsigned int*)(0x42491394UL))
#define bM4_TMR42_POCRV_LVLSV0                          *((volatile unsigned int*)(0x42491398UL))
#define bM4_TMR42_POCRV_LVLSV1                          *((volatile unsigned int*)(0x4249139CUL))
#define bM4_TMR42_POCRW_DIVCKW0                         *((volatile unsigned int*)(0x42491400UL))
#define bM4_TMR42_POCRW_DIVCKW1                         *((volatile unsigned int*)(0x42491404UL))
#define bM4_TMR42_POCRW_DIVCKW2                         *((volatile unsigned int*)(0x42491408UL))
#define bM4_TMR42_POCRW_DIVCKW3                         *((volatile unsigned int*)(0x4249140CUL))
#define bM4_TMR42_POCRW_PWMMDW0                         *((volatile unsigned int*)(0x42491410UL))
#define bM4_TMR42_POCRW_PWMMDW1                         *((volatile unsigned int*)(0x42491414UL))
#define bM4_TMR42_POCRW_LVLSW0                          *((volatile unsigned int*)(0x42491418UL))
#define bM4_TMR42_POCRW_LVLSW1                          *((volatile unsigned int*)(0x4249141CUL))
#define bM4_TMR42_RCSR_RTIDU                            *((volatile unsigned int*)(0x42491480UL))
#define bM4_TMR42_RCSR_RTIDV                            *((volatile unsigned int*)(0x42491484UL))
#define bM4_TMR42_RCSR_RTIDW                            *((volatile unsigned int*)(0x42491488UL))
#define bM4_TMR42_RCSR_RTIFU                            *((volatile unsigned int*)(0x42491490UL))
#define bM4_TMR42_RCSR_RTICU                            *((volatile unsigned int*)(0x42491494UL))
#define bM4_TMR42_RCSR_RTEU                             *((volatile unsigned int*)(0x42491498UL))
#define bM4_TMR42_RCSR_RTSU                             *((volatile unsigned int*)(0x4249149CUL))
#define bM4_TMR42_RCSR_RTIFV                            *((volatile unsigned int*)(0x424914A0UL))
#define bM4_TMR42_RCSR_RTICV                            *((volatile unsigned int*)(0x424914A4UL))
#define bM4_TMR42_RCSR_RTEV                             *((volatile unsigned int*)(0x424914A8UL))
#define bM4_TMR42_RCSR_RTSV                             *((volatile unsigned int*)(0x424914ACUL))
#define bM4_TMR42_RCSR_RTIFW                            *((volatile unsigned int*)(0x424914B0UL))
#define bM4_TMR42_RCSR_RTICW                            *((volatile unsigned int*)(0x424914B4UL))
#define bM4_TMR42_RCSR_RTEW                             *((volatile unsigned int*)(0x424914B8UL))
#define bM4_TMR42_RCSR_RTSW                             *((volatile unsigned int*)(0x424914BCUL))
#define bM4_TMR42_SCSRUH_BUFENUH0                       *((volatile unsigned int*)(0x42491900UL))
#define bM4_TMR42_SCSRUH_BUFENUH1                       *((volatile unsigned int*)(0x42491904UL))
#define bM4_TMR42_SCSRUH_EVTOSUH0                       *((volatile unsigned int*)(0x42491908UL))
#define bM4_TMR42_SCSRUH_EVTOSUH1                       *((volatile unsigned int*)(0x4249190CUL))
#define bM4_TMR42_SCSRUH_EVTOSUH2                       *((volatile unsigned int*)(0x42491910UL))
#define bM4_TMR42_SCSRUH_LMCUH                          *((volatile unsigned int*)(0x42491914UL))
#define bM4_TMR42_SCSRUH_EVTMSUH                        *((volatile unsigned int*)(0x42491920UL))
#define bM4_TMR42_SCSRUH_EVTDSUH                        *((volatile unsigned int*)(0x42491924UL))
#define bM4_TMR42_SCSRUH_DENUH                          *((volatile unsigned int*)(0x42491930UL))
#define bM4_TMR42_SCSRUH_PENUH                          *((volatile unsigned int*)(0x42491934UL))
#define bM4_TMR42_SCSRUH_UENUH                          *((volatile unsigned int*)(0x42491938UL))
#define bM4_TMR42_SCSRUH_ZENUH                          *((volatile unsigned int*)(0x4249193CUL))
#define bM4_TMR42_SCMRUH_AMCUH0                         *((volatile unsigned int*)(0x42491940UL))
#define bM4_TMR42_SCMRUH_AMCUH1                         *((volatile unsigned int*)(0x42491944UL))
#define bM4_TMR42_SCMRUH_AMCUH2                         *((volatile unsigned int*)(0x42491948UL))
#define bM4_TMR42_SCMRUH_AMCUH3                         *((volatile unsigned int*)(0x4249194CUL))
#define bM4_TMR42_SCMRUH_MZCEUH                         *((volatile unsigned int*)(0x42491958UL))
#define bM4_TMR42_SCMRUH_MPCEUH                         *((volatile unsigned int*)(0x4249195CUL))
#define bM4_TMR42_SCSRUL_BUFENUL0                       *((volatile unsigned int*)(0x42491980UL))
#define bM4_TMR42_SCSRUL_BUFENUL1                       *((volatile unsigned int*)(0x42491984UL))
#define bM4_TMR42_SCSRUL_EVTOSUL0                       *((volatile unsigned int*)(0x42491988UL))
#define bM4_TMR42_SCSRUL_EVTOSUL1                       *((volatile unsigned int*)(0x4249198CUL))
#define bM4_TMR42_SCSRUL_EVTOSUL2                       *((volatile unsigned int*)(0x42491990UL))
#define bM4_TMR42_SCSRUL_LMCUL                          *((volatile unsigned int*)(0x42491994UL))
#define bM4_TMR42_SCSRUL_EVTMSUL                        *((volatile unsigned int*)(0x424919A0UL))
#define bM4_TMR42_SCSRUL_EVTDSUL                        *((volatile unsigned int*)(0x424919A4UL))
#define bM4_TMR42_SCSRUL_DENUL                          *((volatile unsigned int*)(0x424919B0UL))
#define bM4_TMR42_SCSRUL_PENUL                          *((volatile unsigned int*)(0x424919B4UL))
#define bM4_TMR42_SCSRUL_UENUL                          *((volatile unsigned int*)(0x424919B8UL))
#define bM4_TMR42_SCSRUL_ZENUL                          *((volatile unsigned int*)(0x424919BCUL))
#define bM4_TMR42_SCMRUL_AMCUL0                         *((volatile unsigned int*)(0x424919C0UL))
#define bM4_TMR42_SCMRUL_AMCUL1                         *((volatile unsigned int*)(0x424919C4UL))
#define bM4_TMR42_SCMRUL_AMCUL2                         *((volatile unsigned int*)(0x424919C8UL))
#define bM4_TMR42_SCMRUL_AMCUL3                         *((volatile unsigned int*)(0x424919CCUL))
#define bM4_TMR42_SCMRUL_MZCEUL                         *((volatile unsigned int*)(0x424919D8UL))
#define bM4_TMR42_SCMRUL_MPCEUL                         *((volatile unsigned int*)(0x424919DCUL))
#define bM4_TMR42_SCSRVH_BUFENVH0                       *((volatile unsigned int*)(0x42491A00UL))
#define bM4_TMR42_SCSRVH_BUFENVH1                       *((volatile unsigned int*)(0x42491A04UL))
#define bM4_TMR42_SCSRVH_EVTOSVH0                       *((volatile unsigned int*)(0x42491A08UL))
#define bM4_TMR42_SCSRVH_EVTOSVH1                       *((volatile unsigned int*)(0x42491A0CUL))
#define bM4_TMR42_SCSRVH_EVTOSVH2                       *((volatile unsigned int*)(0x42491A10UL))
#define bM4_TMR42_SCSRVH_LMCVH                          *((volatile unsigned int*)(0x42491A14UL))
#define bM4_TMR42_SCSRVH_EVTMSVH                        *((volatile unsigned int*)(0x42491A20UL))
#define bM4_TMR42_SCSRVH_EVTDSVH                        *((volatile unsigned int*)(0x42491A24UL))
#define bM4_TMR42_SCSRVH_DENVH                          *((volatile unsigned int*)(0x42491A30UL))
#define bM4_TMR42_SCSRVH_PENVH                          *((volatile unsigned int*)(0x42491A34UL))
#define bM4_TMR42_SCSRVH_UENVH                          *((volatile unsigned int*)(0x42491A38UL))
#define bM4_TMR42_SCSRVH_ZENVH                          *((volatile unsigned int*)(0x42491A3CUL))
#define bM4_TMR42_SCMRVH_AMCVH0                         *((volatile unsigned int*)(0x42491A40UL))
#define bM4_TMR42_SCMRVH_AMCVH1                         *((volatile unsigned int*)(0x42491A44UL))
#define bM4_TMR42_SCMRVH_AMCVH2                         *((volatile unsigned int*)(0x42491A48UL))
#define bM4_TMR42_SCMRVH_AMCVH3                         *((volatile unsigned int*)(0x42491A4CUL))
#define bM4_TMR42_SCMRVH_MZCEVH                         *((volatile unsigned int*)(0x42491A58UL))
#define bM4_TMR42_SCMRVH_MPCEVH                         *((volatile unsigned int*)(0x42491A5CUL))
#define bM4_TMR42_SCSRVL_BUFENVL0                       *((volatile unsigned int*)(0x42491A80UL))
#define bM4_TMR42_SCSRVL_BUFENVL1                       *((volatile unsigned int*)(0x42491A84UL))
#define bM4_TMR42_SCSRVL_EVTOSVL0                       *((volatile unsigned int*)(0x42491A88UL))
#define bM4_TMR42_SCSRVL_EVTOSVL1                       *((volatile unsigned int*)(0x42491A8CUL))
#define bM4_TMR42_SCSRVL_EVTOSVL2                       *((volatile unsigned int*)(0x42491A90UL))
#define bM4_TMR42_SCSRVL_LMCVL                          *((volatile unsigned int*)(0x42491A94UL))
#define bM4_TMR42_SCSRVL_EVTMSVL                        *((volatile unsigned int*)(0x42491AA0UL))
#define bM4_TMR42_SCSRVL_EVTDSVL                        *((volatile unsigned int*)(0x42491AA4UL))
#define bM4_TMR42_SCSRVL_DENVL                          *((volatile unsigned int*)(0x42491AB0UL))
#define bM4_TMR42_SCSRVL_PENVL                          *((volatile unsigned int*)(0x42491AB4UL))
#define bM4_TMR42_SCSRVL_UENVL                          *((volatile unsigned int*)(0x42491AB8UL))
#define bM4_TMR42_SCSRVL_ZENVL                          *((volatile unsigned int*)(0x42491ABCUL))
#define bM4_TMR42_SCMRVL_AMCVL0                         *((volatile unsigned int*)(0x42491AC0UL))
#define bM4_TMR42_SCMRVL_AMCVL1                         *((volatile unsigned int*)(0x42491AC4UL))
#define bM4_TMR42_SCMRVL_AMCVL2                         *((volatile unsigned int*)(0x42491AC8UL))
#define bM4_TMR42_SCMRVL_AMCVL3                         *((volatile unsigned int*)(0x42491ACCUL))
#define bM4_TMR42_SCMRVL_MZCEVL                         *((volatile unsigned int*)(0x42491AD8UL))
#define bM4_TMR42_SCMRVL_MPCEVL                         *((volatile unsigned int*)(0x42491ADCUL))
#define bM4_TMR42_SCSRWH_BUFENWH0                       *((volatile unsigned int*)(0x42491B00UL))
#define bM4_TMR42_SCSRWH_BUFENWH1                       *((volatile unsigned int*)(0x42491B04UL))
#define bM4_TMR42_SCSRWH_EVTOSWH0                       *((volatile unsigned int*)(0x42491B08UL))
#define bM4_TMR42_SCSRWH_EVTOSWH1                       *((volatile unsigned int*)(0x42491B0CUL))
#define bM4_TMR42_SCSRWH_EVTOSWH2                       *((volatile unsigned int*)(0x42491B10UL))
#define bM4_TMR42_SCSRWH_LMCWH                          *((volatile unsigned int*)(0x42491B14UL))
#define bM4_TMR42_SCSRWH_EVTMSWH                        *((volatile unsigned int*)(0x42491B20UL))
#define bM4_TMR42_SCSRWH_EVTDSWH                        *((volatile unsigned int*)(0x42491B24UL))
#define bM4_TMR42_SCSRWH_DENWH                          *((volatile unsigned int*)(0x42491B30UL))
#define bM4_TMR42_SCSRWH_PENWH                          *((volatile unsigned int*)(0x42491B34UL))
#define bM4_TMR42_SCSRWH_UENWH                          *((volatile unsigned int*)(0x42491B38UL))
#define bM4_TMR42_SCSRWH_ZENWH                          *((volatile unsigned int*)(0x42491B3CUL))
#define bM4_TMR42_SCMRWH_AMCWH0                         *((volatile unsigned int*)(0x42491B40UL))
#define bM4_TMR42_SCMRWH_AMCWH1                         *((volatile unsigned int*)(0x42491B44UL))
#define bM4_TMR42_SCMRWH_AMCWH2                         *((volatile unsigned int*)(0x42491B48UL))
#define bM4_TMR42_SCMRWH_AMCWH3                         *((volatile unsigned int*)(0x42491B4CUL))
#define bM4_TMR42_SCMRWH_MZCEWH                         *((volatile unsigned int*)(0x42491B58UL))
#define bM4_TMR42_SCMRWH_MPCEWH                         *((volatile unsigned int*)(0x42491B5CUL))
#define bM4_TMR42_SCSRWL_BUFENWL0                       *((volatile unsigned int*)(0x42491B80UL))
#define bM4_TMR42_SCSRWL_BUFENWL1                       *((volatile unsigned int*)(0x42491B84UL))
#define bM4_TMR42_SCSRWL_EVTOSWL0                       *((volatile unsigned int*)(0x42491B88UL))
#define bM4_TMR42_SCSRWL_EVTOSWL1                       *((volatile unsigned int*)(0x42491B8CUL))
#define bM4_TMR42_SCSRWL_EVTOSWL2                       *((volatile unsigned int*)(0x42491B90UL))
#define bM4_TMR42_SCSRWL_LMCWL                          *((volatile unsigned int*)(0x42491B94UL))
#define bM4_TMR42_SCSRWL_EVTMSWL                        *((volatile unsigned int*)(0x42491BA0UL))
#define bM4_TMR42_SCSRWL_EVTDSWL                        *((volatile unsigned int*)(0x42491BA4UL))
#define bM4_TMR42_SCSRWL_DENWL                          *((volatile unsigned int*)(0x42491BB0UL))
#define bM4_TMR42_SCSRWL_PENWL                          *((volatile unsigned int*)(0x42491BB4UL))
#define bM4_TMR42_SCSRWL_UENWL                          *((volatile unsigned int*)(0x42491BB8UL))
#define bM4_TMR42_SCSRWL_ZENWL                          *((volatile unsigned int*)(0x42491BBCUL))
#define bM4_TMR42_SCMRWL_AMCWL0                         *((volatile unsigned int*)(0x42491BC0UL))
#define bM4_TMR42_SCMRWL_AMCWL1                         *((volatile unsigned int*)(0x42491BC4UL))
#define bM4_TMR42_SCMRWL_AMCWL2                         *((volatile unsigned int*)(0x42491BC8UL))
#define bM4_TMR42_SCMRWL_AMCWL3                         *((volatile unsigned int*)(0x42491BCCUL))
#define bM4_TMR42_SCMRWL_MZCEWL                         *((volatile unsigned int*)(0x42491BD8UL))
#define bM4_TMR42_SCMRWL_MPCEWL                         *((volatile unsigned int*)(0x42491BDCUL))
#define bM4_TMR42_ECSR_HOLD                             *((volatile unsigned int*)(0x42491E1CUL))
#define bM4_TMR43_OCSRU_OCEHU                           *((volatile unsigned int*)(0x42498300UL))
#define bM4_TMR43_OCSRU_OCELU                           *((volatile unsigned int*)(0x42498304UL))
#define bM4_TMR43_OCSRU_OCPHU                           *((volatile unsigned int*)(0x42498308UL))
#define bM4_TMR43_OCSRU_OCPLU                           *((volatile unsigned int*)(0x4249830CUL))
#define bM4_TMR43_OCSRU_OCIEHU                          *((volatile unsigned int*)(0x42498310UL))
#define bM4_TMR43_OCSRU_OCIELU                          *((volatile unsigned int*)(0x42498314UL))
#define bM4_TMR43_OCSRU_OCFHU                           *((volatile unsigned int*)(0x42498318UL))
#define bM4_TMR43_OCSRU_OCFLU                           *((volatile unsigned int*)(0x4249831CUL))
#define bM4_TMR43_OCERU_CHBUFENU0                       *((volatile unsigned int*)(0x42498340UL))
#define bM4_TMR43_OCERU_CHBUFENU1                       *((volatile unsigned int*)(0x42498344UL))
#define bM4_TMR43_OCERU_CLBUFENU0                       *((volatile unsigned int*)(0x42498348UL))
#define bM4_TMR43_OCERU_CLBUFENU1                       *((volatile unsigned int*)(0x4249834CUL))
#define bM4_TMR43_OCERU_MHBUFENU0                       *((volatile unsigned int*)(0x42498350UL))
#define bM4_TMR43_OCERU_MHBUFENU1                       *((volatile unsigned int*)(0x42498354UL))
#define bM4_TMR43_OCERU_MLBUFENU0                       *((volatile unsigned int*)(0x42498358UL))
#define bM4_TMR43_OCERU_MLBUFENU1                       *((volatile unsigned int*)(0x4249835CUL))
#define bM4_TMR43_OCERU_LMCHU                           *((volatile unsigned int*)(0x42498360UL))
#define bM4_TMR43_OCERU_LMCLU                           *((volatile unsigned int*)(0x42498364UL))
#define bM4_TMR43_OCERU_LMMHU                           *((volatile unsigned int*)(0x42498368UL))
#define bM4_TMR43_OCERU_LMMLU                           *((volatile unsigned int*)(0x4249836CUL))
#define bM4_TMR43_OCERU_MCECHU                          *((volatile unsigned int*)(0x42498370UL))
#define bM4_TMR43_OCERU_MCECLU                          *((volatile unsigned int*)(0x42498374UL))
#define bM4_TMR43_OCSRV_OCEHV                           *((volatile unsigned int*)(0x42498380UL))
#define bM4_TMR43_OCSRV_OCELV                           *((volatile unsigned int*)(0x42498384UL))
#define bM4_TMR43_OCSRV_OCPHV                           *((volatile unsigned int*)(0x42498388UL))
#define bM4_TMR43_OCSRV_OCPLV                           *((volatile unsigned int*)(0x4249838CUL))
#define bM4_TMR43_OCSRV_OCIEHV                          *((volatile unsigned int*)(0x42498390UL))
#define bM4_TMR43_OCSRV_OCIELV                          *((volatile unsigned int*)(0x42498394UL))
#define bM4_TMR43_OCSRV_OCFHV                           *((volatile unsigned int*)(0x42498398UL))
#define bM4_TMR43_OCSRV_OCFLV                           *((volatile unsigned int*)(0x4249839CUL))
#define bM4_TMR43_OCERV_CHBUFENV0                       *((volatile unsigned int*)(0x424983C0UL))
#define bM4_TMR43_OCERV_CHBUFENV1                       *((volatile unsigned int*)(0x424983C4UL))
#define bM4_TMR43_OCERV_CLBUFENV0                       *((volatile unsigned int*)(0x424983C8UL))
#define bM4_TMR43_OCERV_CLBUFENV1                       *((volatile unsigned int*)(0x424983CCUL))
#define bM4_TMR43_OCERV_MHBUFENV0                       *((volatile unsigned int*)(0x424983D0UL))
#define bM4_TMR43_OCERV_MHBUFENV1                       *((volatile unsigned int*)(0x424983D4UL))
#define bM4_TMR43_OCERV_MLBUFENV0                       *((volatile unsigned int*)(0x424983D8UL))
#define bM4_TMR43_OCERV_MLBUFENV1                       *((volatile unsigned int*)(0x424983DCUL))
#define bM4_TMR43_OCERV_LMCHV                           *((volatile unsigned int*)(0x424983E0UL))
#define bM4_TMR43_OCERV_LMCLV                           *((volatile unsigned int*)(0x424983E4UL))
#define bM4_TMR43_OCERV_LMMHV                           *((volatile unsigned int*)(0x424983E8UL))
#define bM4_TMR43_OCERV_LMMLV                           *((volatile unsigned int*)(0x424983ECUL))
#define bM4_TMR43_OCERV_MCECHV                          *((volatile unsigned int*)(0x424983F0UL))
#define bM4_TMR43_OCERV_MCECLV                          *((volatile unsigned int*)(0x424983F4UL))
#define bM4_TMR43_OCSRW_OCEHW                           *((volatile unsigned int*)(0x42498400UL))
#define bM4_TMR43_OCSRW_OCELW                           *((volatile unsigned int*)(0x42498404UL))
#define bM4_TMR43_OCSRW_OCPHW                           *((volatile unsigned int*)(0x42498408UL))
#define bM4_TMR43_OCSRW_OCPLW                           *((volatile unsigned int*)(0x4249840CUL))
#define bM4_TMR43_OCSRW_OCIEHW                          *((volatile unsigned int*)(0x42498410UL))
#define bM4_TMR43_OCSRW_OCIELW                          *((volatile unsigned int*)(0x42498414UL))
#define bM4_TMR43_OCSRW_OCFHW                           *((volatile unsigned int*)(0x42498418UL))
#define bM4_TMR43_OCSRW_OCFLW                           *((volatile unsigned int*)(0x4249841CUL))
#define bM4_TMR43_OCERW_CHBUFENW0                       *((volatile unsigned int*)(0x42498440UL))
#define bM4_TMR43_OCERW_CHBUFENW1                       *((volatile unsigned int*)(0x42498444UL))
#define bM4_TMR43_OCERW_CLBUFENW0                       *((volatile unsigned int*)(0x42498448UL))
#define bM4_TMR43_OCERW_CLBUFENW1                       *((volatile unsigned int*)(0x4249844CUL))
#define bM4_TMR43_OCERW_MHBUFENW0                       *((volatile unsigned int*)(0x42498450UL))
#define bM4_TMR43_OCERW_MHBUFENW1                       *((volatile unsigned int*)(0x42498454UL))
#define bM4_TMR43_OCERW_MLBUFENW0                       *((volatile unsigned int*)(0x42498458UL))
#define bM4_TMR43_OCERW_MLBUFENW1                       *((volatile unsigned int*)(0x4249845CUL))
#define bM4_TMR43_OCERW_LMCHW                           *((volatile unsigned int*)(0x42498460UL))
#define bM4_TMR43_OCERW_LMCLW                           *((volatile unsigned int*)(0x42498464UL))
#define bM4_TMR43_OCERW_LMMHW                           *((volatile unsigned int*)(0x42498468UL))
#define bM4_TMR43_OCERW_LMMLW                           *((volatile unsigned int*)(0x4249846CUL))
#define bM4_TMR43_OCERW_MCECHW                          *((volatile unsigned int*)(0x42498470UL))
#define bM4_TMR43_OCERW_MCECLW                          *((volatile unsigned int*)(0x42498474UL))
#define bM4_TMR43_OCMRUH_OCFDCHUH                       *((volatile unsigned int*)(0x42498480UL))
#define bM4_TMR43_OCMRUH_OCFPKHUH                       *((volatile unsigned int*)(0x42498484UL))
#define bM4_TMR43_OCMRUH_OCFUCHUH                       *((volatile unsigned int*)(0x42498488UL))
#define bM4_TMR43_OCMRUH_OCFZRHUH                       *((volatile unsigned int*)(0x4249848CUL))
#define bM4_TMR43_OCMRUH_OPDCHUH0                       *((volatile unsigned int*)(0x42498490UL))
#define bM4_TMR43_OCMRUH_OPDCHUH1                       *((volatile unsigned int*)(0x42498494UL))
#define bM4_TMR43_OCMRUH_OPPKHUH0                       *((volatile unsigned int*)(0x42498498UL))
#define bM4_TMR43_OCMRUH_OPPKHUH1                       *((volatile unsigned int*)(0x4249849CUL))
#define bM4_TMR43_OCMRUH_OPUCHUH0                       *((volatile unsigned int*)(0x424984A0UL))
#define bM4_TMR43_OCMRUH_OPUCHUH1                       *((volatile unsigned int*)(0x424984A4UL))
#define bM4_TMR43_OCMRUH_OPZRHUH0                       *((volatile unsigned int*)(0x424984A8UL))
#define bM4_TMR43_OCMRUH_OPZRHUH1                       *((volatile unsigned int*)(0x424984ACUL))
#define bM4_TMR43_OCMRUH_OPNPKHUH0                      *((volatile unsigned int*)(0x424984B0UL))
#define bM4_TMR43_OCMRUH_OPNPKHUH1                      *((volatile unsigned int*)(0x424984B4UL))
#define bM4_TMR43_OCMRUH_OPNZRHUH0                      *((volatile unsigned int*)(0x424984B8UL))
#define bM4_TMR43_OCMRUH_OPNZRHUH1                      *((volatile unsigned int*)(0x424984BCUL))
#define bM4_TMR43_OCMRUL_OCFDCLUL                       *((volatile unsigned int*)(0x42498500UL))
#define bM4_TMR43_OCMRUL_OCFPKLUL                       *((volatile unsigned int*)(0x42498504UL))
#define bM4_TMR43_OCMRUL_OCFUCLUL                       *((volatile unsigned int*)(0x42498508UL))
#define bM4_TMR43_OCMRUL_OCFZRLUL                       *((volatile unsigned int*)(0x4249850CUL))
#define bM4_TMR43_OCMRUL_OPDCLUL0                       *((volatile unsigned int*)(0x42498510UL))
#define bM4_TMR43_OCMRUL_OPDCLUL1                       *((volatile unsigned int*)(0x42498514UL))
#define bM4_TMR43_OCMRUL_OPPKLUL0                       *((volatile unsigned int*)(0x42498518UL))
#define bM4_TMR43_OCMRUL_OPPKLUL1                       *((volatile unsigned int*)(0x4249851CUL))
#define bM4_TMR43_OCMRUL_OPUCLUL0                       *((volatile unsigned int*)(0x42498520UL))
#define bM4_TMR43_OCMRUL_OPUCLUL1                       *((volatile unsigned int*)(0x42498524UL))
#define bM4_TMR43_OCMRUL_OPZRLUL0                       *((volatile unsigned int*)(0x42498528UL))
#define bM4_TMR43_OCMRUL_OPZRLUL1                       *((volatile unsigned int*)(0x4249852CUL))
#define bM4_TMR43_OCMRUL_OPNPKLUL0                      *((volatile unsigned int*)(0x42498530UL))
#define bM4_TMR43_OCMRUL_OPNPKLUL1                      *((volatile unsigned int*)(0x42498534UL))
#define bM4_TMR43_OCMRUL_OPNZRLUL0                      *((volatile unsigned int*)(0x42498538UL))
#define bM4_TMR43_OCMRUL_OPNZRLUL1                      *((volatile unsigned int*)(0x4249853CUL))
#define bM4_TMR43_OCMRUL_EOPNDCLUL0                     *((volatile unsigned int*)(0x42498540UL))
#define bM4_TMR43_OCMRUL_EOPNDCLUL1                     *((volatile unsigned int*)(0x42498544UL))
#define bM4_TMR43_OCMRUL_EOPNUCLUL0                     *((volatile unsigned int*)(0x42498548UL))
#define bM4_TMR43_OCMRUL_EOPNUCLUL1                     *((volatile unsigned int*)(0x4249854CUL))
#define bM4_TMR43_OCMRUL_EOPDCLUL0                      *((volatile unsigned int*)(0x42498550UL))
#define bM4_TMR43_OCMRUL_EOPDCLUL1                      *((volatile unsigned int*)(0x42498554UL))
#define bM4_TMR43_OCMRUL_EOPPKLUL0                      *((volatile unsigned int*)(0x42498558UL))
#define bM4_TMR43_OCMRUL_EOPPKLUL1                      *((volatile unsigned int*)(0x4249855CUL))
#define bM4_TMR43_OCMRUL_EOPUCLUL0                      *((volatile unsigned int*)(0x42498560UL))
#define bM4_TMR43_OCMRUL_EOPUCLUL1                      *((volatile unsigned int*)(0x42498564UL))
#define bM4_TMR43_OCMRUL_EOPZRLUL0                      *((volatile unsigned int*)(0x42498568UL))
