CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_TMR43_OCMRUL_EOPZRLUL1                      *((volatile unsigned int*)(0x4249856CUL))
#define bM4_TMR43_OCMRUL_EOPNPKLUL0                     *((volatile unsigned int*)(0x42498570UL))
#define bM4_TMR43_OCMRUL_EOPNPKLUL1                     *((volatile unsigned int*)(0x42498574UL))
#define bM4_TMR43_OCMRUL_EOPNZRLUL0                     *((volatile unsigned int*)(0x42498578UL))
#define bM4_TMR43_OCMRUL_EOPNZRLUL1                     *((volatile unsigned int*)(0x4249857CUL))
#define bM4_TMR43_OCMRVH_OCFDCHVH                       *((volatile unsigned int*)(0x42498580UL))
#define bM4_TMR43_OCMRVH_OCFPKHVH                       *((volatile unsigned int*)(0x42498584UL))
#define bM4_TMR43_OCMRVH_OCFUCHVH                       *((volatile unsigned int*)(0x42498588UL))
#define bM4_TMR43_OCMRVH_OCFZRHVH                       *((volatile unsigned int*)(0x4249858CUL))
#define bM4_TMR43_OCMRVH_OPDCHVH0                       *((volatile unsigned int*)(0x42498590UL))
#define bM4_TMR43_OCMRVH_OPDCHVH1                       *((volatile unsigned int*)(0x42498594UL))
#define bM4_TMR43_OCMRVH_OPPKHVH0                       *((volatile unsigned int*)(0x42498598UL))
#define bM4_TMR43_OCMRVH_OPPKHVH1                       *((volatile unsigned int*)(0x4249859CUL))
#define bM4_TMR43_OCMRVH_OPUCHVH0                       *((volatile unsigned int*)(0x424985A0UL))
#define bM4_TMR43_OCMRVH_OPUCHVH1                       *((volatile unsigned int*)(0x424985A4UL))
#define bM4_TMR43_OCMRVH_OPZRHVH0                       *((volatile unsigned int*)(0x424985A8UL))
#define bM4_TMR43_OCMRVH_OPZRHVH1                       *((volatile unsigned int*)(0x424985ACUL))
#define bM4_TMR43_OCMRVH_OPNPKHVH0                      *((volatile unsigned int*)(0x424985B0UL))
#define bM4_TMR43_OCMRVH_OPNPKHVH1                      *((volatile unsigned int*)(0x424985B4UL))
#define bM4_TMR43_OCMRVH_OPNZRHVH0                      *((volatile unsigned int*)(0x424985B8UL))
#define bM4_TMR43_OCMRVH_OPNZRHVH1                      *((volatile unsigned int*)(0x424985BCUL))
#define bM4_TMR43_OCMRVL_OCFDCLVL                       *((volatile unsigned int*)(0x42498600UL))
#define bM4_TMR43_OCMRVL_OCFPKLVL                       *((volatile unsigned int*)(0x42498604UL))
#define bM4_TMR43_OCMRVL_OCFUCLVL                       *((volatile unsigned int*)(0x42498608UL))
#define bM4_TMR43_OCMRVL_OCFZRLVL                       *((volatile unsigned int*)(0x4249860CUL))
#define bM4_TMR43_OCMRVL_OPDCLVL0                       *((volatile unsigned int*)(0x42498610UL))
#define bM4_TMR43_OCMRVL_OPDCLVL1                       *((volatile unsigned int*)(0x42498614UL))
#define bM4_TMR43_OCMRVL_OPPKLVL0                       *((volatile unsigned int*)(0x42498618UL))
#define bM4_TMR43_OCMRVL_OPPKLVL1                       *((volatile unsigned int*)(0x4249861CUL))
#define bM4_TMR43_OCMRVL_OPUCLVL0                       *((volatile unsigned int*)(0x42498620UL))
#define bM4_TMR43_OCMRVL_OPUCLVL1                       *((volatile unsigned int*)(0x42498624UL))
#define bM4_TMR43_OCMRVL_OPZRLVL0                       *((volatile unsigned int*)(0x42498628UL))
#define bM4_TMR43_OCMRVL_OPZRLVL1                       *((volatile unsigned int*)(0x4249862CUL))
#define bM4_TMR43_OCMRVL_OPNPKLVL0                      *((volatile unsigned int*)(0x42498630UL))
#define bM4_TMR43_OCMRVL_OPNPKLVL1                      *((volatile unsigned int*)(0x42498634UL))
#define bM4_TMR43_OCMRVL_OPNZRLVL0                      *((volatile unsigned int*)(0x42498638UL))
#define bM4_TMR43_OCMRVL_OPNZRLVL1                      *((volatile unsigned int*)(0x4249863CUL))
#define bM4_TMR43_OCMRVL_EOPNDCLVL0                     *((volatile unsigned int*)(0x42498640UL))
#define bM4_TMR43_OCMRVL_EOPNDCLVL1                     *((volatile unsigned int*)(0x42498644UL))
#define bM4_TMR43_OCMRVL_EOPNUCLVL0                     *((volatile unsigned int*)(0x42498648UL))
#define bM4_TMR43_OCMRVL_EOPNUCLVL1                     *((volatile unsigned int*)(0x4249864CUL))
#define bM4_TMR43_OCMRVL_EOPDCLVL0                      *((volatile unsigned int*)(0x42498650UL))
#define bM4_TMR43_OCMRVL_EOPDCLVL1                      *((volatile unsigned int*)(0x42498654UL))
#define bM4_TMR43_OCMRVL_EOPPKLVL0                      *((volatile unsigned int*)(0x42498658UL))
#define bM4_TMR43_OCMRVL_EOPPKLVL1                      *((volatile unsigned int*)(0x4249865CUL))
#define bM4_TMR43_OCMRVL_EOPUCLVL0                      *((volatile unsigned int*)(0x42498660UL))
#define bM4_TMR43_OCMRVL_EOPUCLVL1                      *((volatile unsigned int*)(0x42498664UL))
#define bM4_TMR43_OCMRVL_EOPZRLVL0                      *((volatile unsigned int*)(0x42498668UL))
#define bM4_TMR43_OCMRVL_EOPZRLVL1                      *((volatile unsigned int*)(0x4249866CUL))
#define bM4_TMR43_OCMRVL_EOPNPKLVL0                     *((volatile unsigned int*)(0x42498670UL))
#define bM4_TMR43_OCMRVL_EOPNPKLVL1                     *((volatile unsigned int*)(0x42498674UL))
#define bM4_TMR43_OCMRVL_EOPNZRLVL0                     *((volatile unsigned int*)(0x42498678UL))
#define bM4_TMR43_OCMRVL_EOPNZRLVL1                     *((volatile unsigned int*)(0x4249867CUL))
#define bM4_TMR43_OCMRWH_OCFDCHWH                       *((volatile unsigned int*)(0x42498680UL))
#define bM4_TMR43_OCMRWH_OCFPKHWH                       *((volatile unsigned int*)(0x42498684UL))
#define bM4_TMR43_OCMRWH_OCFUCHWH                       *((volatile unsigned int*)(0x42498688UL))
#define bM4_TMR43_OCMRWH_OCFZRHWH                       *((volatile unsigned int*)(0x4249868CUL))
#define bM4_TMR43_OCMRWH_OPDCHWH0                       *((volatile unsigned int*)(0x42498690UL))
#define bM4_TMR43_OCMRWH_OPDCHWH1                       *((volatile unsigned int*)(0x42498694UL))
#define bM4_TMR43_OCMRWH_OPPKHWH0                       *((volatile unsigned int*)(0x42498698UL))
#define bM4_TMR43_OCMRWH_OPPKHWH1                       *((volatile unsigned int*)(0x4249869CUL))
#define bM4_TMR43_OCMRWH_OPUCHWH0                       *((volatile unsigned int*)(0x424986A0UL))
#define bM4_TMR43_OCMRWH_OPUCHWH1                       *((volatile unsigned int*)(0x424986A4UL))
#define bM4_TMR43_OCMRWH_OPZRHWH0                       *((volatile unsigned int*)(0x424986A8UL))
#define bM4_TMR43_OCMRWH_OPZRHWH1                       *((volatile unsigned int*)(0x424986ACUL))
#define bM4_TMR43_OCMRWH_OPNPKHWH0                      *((volatile unsigned int*)(0x424986B0UL))
#define bM4_TMR43_OCMRWH_OPNPKHWH1                      *((volatile unsigned int*)(0x424986B4UL))
#define bM4_TMR43_OCMRWH_OPNZRHWH0                      *((volatile unsigned int*)(0x424986B8UL))
#define bM4_TMR43_OCMRWH_OPNZRHWH1                      *((volatile unsigned int*)(0x424986BCUL))
#define bM4_TMR43_OCMRWL_OCFDCLWL                       *((volatile unsigned int*)(0x42498700UL))
#define bM4_TMR43_OCMRWL_OCFPKLWL                       *((volatile unsigned int*)(0x42498704UL))
#define bM4_TMR43_OCMRWL_OCFUCLWL                       *((volatile unsigned int*)(0x42498708UL))
#define bM4_TMR43_OCMRWL_OCFZRLWL                       *((volatile unsigned int*)(0x4249870CUL))
#define bM4_TMR43_OCMRWL_OPDCLWL0                       *((volatile unsigned int*)(0x42498710UL))
#define bM4_TMR43_OCMRWL_OPDCLWL1                       *((volatile unsigned int*)(0x42498714UL))
#define bM4_TMR43_OCMRWL_OPPKLWL0                       *((volatile unsigned int*)(0x42498718UL))
#define bM4_TMR43_OCMRWL_OPPKLWL1                       *((volatile unsigned int*)(0x4249871CUL))
#define bM4_TMR43_OCMRWL_OPUCLWL0                       *((volatile unsigned int*)(0x42498720UL))
#define bM4_TMR43_OCMRWL_OPUCLWL1                       *((volatile unsigned int*)(0x42498724UL))
#define bM4_TMR43_OCMRWL_OPZRLWL0                       *((volatile unsigned int*)(0x42498728UL))
#define bM4_TMR43_OCMRWL_OPZRLWL1                       *((volatile unsigned int*)(0x4249872CUL))
#define bM4_TMR43_OCMRWL_OPNPKLWL0                      *((volatile unsigned int*)(0x42498730UL))
#define bM4_TMR43_OCMRWL_OPNPKLWL1                      *((volatile unsigned int*)(0x42498734UL))
#define bM4_TMR43_OCMRWL_OPNZRLWL0                      *((volatile unsigned int*)(0x42498738UL))
#define bM4_TMR43_OCMRWL_OPNZRLWL1                      *((volatile unsigned int*)(0x4249873CUL))
#define bM4_TMR43_OCMRWL_EOPNDCLWL0                     *((volatile unsigned int*)(0x42498740UL))
#define bM4_TMR43_OCMRWL_EOPNDCLWL1                     *((volatile unsigned int*)(0x42498744UL))
#define bM4_TMR43_OCMRWL_EOPNUCLWL0                     *((volatile unsigned int*)(0x42498748UL))
#define bM4_TMR43_OCMRWL_EOPNUCLWL1                     *((volatile unsigned int*)(0x4249874CUL))
#define bM4_TMR43_OCMRWL_EOPDCLWL0                      *((volatile unsigned int*)(0x42498750UL))
#define bM4_TMR43_OCMRWL_EOPDCLWL1                      *((volatile unsigned int*)(0x42498754UL))
#define bM4_TMR43_OCMRWL_EOPPKLWL0                      *((volatile unsigned int*)(0x42498758UL))
#define bM4_TMR43_OCMRWL_EOPPKLWL1                      *((volatile unsigned int*)(0x4249875CUL))
#define bM4_TMR43_OCMRWL_EOPUCLWL0                      *((volatile unsigned int*)(0x42498760UL))
#define bM4_TMR43_OCMRWL_EOPUCLWL1                      *((volatile unsigned int*)(0x42498764UL))
#define bM4_TMR43_OCMRWL_EOPZRLWL0                      *((volatile unsigned int*)(0x42498768UL))
#define bM4_TMR43_OCMRWL_EOPZRLWL1                      *((volatile unsigned int*)(0x4249876CUL))
#define bM4_TMR43_OCMRWL_EOPNPKLWL0                     *((volatile unsigned int*)(0x42498770UL))
#define bM4_TMR43_OCMRWL_EOPNPKLWL1                     *((volatile unsigned int*)(0x42498774UL))
#define bM4_TMR43_OCMRWL_EOPNZRLWL0                     *((volatile unsigned int*)(0x42498778UL))
#define bM4_TMR43_OCMRWL_EOPNZRLWL1                     *((volatile unsigned int*)(0x4249877CUL))
#define bM4_TMR43_CCSR_CKDIV0                           *((volatile unsigned int*)(0x42498900UL))
#define bM4_TMR43_CCSR_CKDIV1                           *((volatile unsigned int*)(0x42498904UL))
#define bM4_TMR43_CCSR_CKDIV2                           *((volatile unsigned int*)(0x42498908UL))
#define bM4_TMR43_CCSR_CKDIV3                           *((volatile unsigned int*)(0x4249890CUL))
#define bM4_TMR43_CCSR_CLEAR                            *((volatile unsigned int*)(0x42498910UL))
#define bM4_TMR43_CCSR_MODE                             *((volatile unsigned int*)(0x42498914UL))
#define bM4_TMR43_CCSR_STOP                             *((volatile unsigned int*)(0x42498918UL))
#define bM4_TMR43_CCSR_BUFEN                            *((volatile unsigned int*)(0x4249891CUL))
#define bM4_TMR43_CCSR_IRQPEN                           *((volatile unsigned int*)(0x42498920UL))
#define bM4_TMR43_CCSR_IRQPF                            *((volatile unsigned int*)(0x42498924UL))
#define bM4_TMR43_CCSR_IRQZEN                           *((volatile unsigned int*)(0x42498934UL))
#define bM4_TMR43_CCSR_IRQZF                            *((volatile unsigned int*)(0x42498938UL))
#define bM4_TMR43_CCSR_ECKEN                            *((volatile unsigned int*)(0x4249893CUL))
#define bM4_TMR43_CVPR_ZIM0                             *((volatile unsigned int*)(0x42498940UL))
#define bM4_TMR43_CVPR_ZIM1                             *((volatile unsigned int*)(0x42498944UL))
#define bM4_TMR43_CVPR_ZIM2                             *((volatile unsigned int*)(0x42498948UL))
#define bM4_TMR43_CVPR_ZIM3                             *((volatile unsigned int*)(0x4249894CUL))
#define bM4_TMR43_CVPR_PIM0                             *((volatile unsigned int*)(0x42498950UL))
#define bM4_TMR43_CVPR_PIM1                             *((volatile unsigned int*)(0x42498954UL))
#define bM4_TMR43_CVPR_PIM2                             *((volatile unsigned int*)(0x42498958UL))
#define bM4_TMR43_CVPR_PIM3                             *((volatile unsigned int*)(0x4249895CUL))
#define bM4_TMR43_CVPR_ZIC0                             *((volatile unsigned int*)(0x42498960UL))
#define bM4_TMR43_CVPR_ZIC1                             *((volatile unsigned int*)(0x42498964UL))
#define bM4_TMR43_CVPR_ZIC2                             *((volatile unsigned int*)(0x42498968UL))
#define bM4_TMR43_CVPR_ZIC3                             *((volatile unsigned int*)(0x4249896CUL))
#define bM4_TMR43_CVPR_PIC0                             *((volatile unsigned int*)(0x42498970UL))
#define bM4_TMR43_CVPR_PIC1                             *((volatile unsigned int*)(0x42498974UL))
#define bM4_TMR43_CVPR_PIC2                             *((volatile unsigned int*)(0x42498978UL))
#define bM4_TMR43_CVPR_PIC3                             *((volatile unsigned int*)(0x4249897CUL))
#define bM4_TMR43_POCRU_DIVCKU0                         *((volatile unsigned int*)(0x42499300UL))
#define bM4_TMR43_POCRU_DIVCKU1                         *((volatile unsigned int*)(0x42499304UL))
#define bM4_TMR43_POCRU_DIVCKU2                         *((volatile unsigned int*)(0x42499308UL))
#define bM4_TMR43_POCRU_DIVCKU3                         *((volatile unsigned int*)(0x4249930CUL))
#define bM4_TMR43_POCRU_PWMMDU0                         *((volatile unsigned int*)(0x42499310UL))
#define bM4_TMR43_POCRU_PWMMDU1                         *((volatile unsigned int*)(0x42499314UL))
#define bM4_TMR43_POCRU_LVLSU0                          *((volatile unsigned int*)(0x42499318UL))
#define bM4_TMR43_POCRU_LVLSU1                          *((volatile unsigned int*)(0x4249931CUL))
#define bM4_TMR43_POCRV_DIVCKV0                         *((volatile unsigned int*)(0x42499380UL))
#define bM4_TMR43_POCRV_DIVCKV1                         *((volatile unsigned int*)(0x42499384UL))
#define bM4_TMR43_POCRV_DIVCKV2                         *((volatile unsigned int*)(0x42499388UL))
#define bM4_TMR43_POCRV_DIVCKV3                         *((volatile unsigned int*)(0x4249938CUL))
#define bM4_TMR43_POCRV_PWMMDV0                         *((volatile unsigned int*)(0x42499390UL))
#define bM4_TMR43_POCRV_PWMMDV1                         *((volatile unsigned int*)(0x42499394UL))
#define bM4_TMR43_POCRV_LVLSV0                          *((volatile unsigned int*)(0x42499398UL))
#define bM4_TMR43_POCRV_LVLSV1                          *((volatile unsigned int*)(0x4249939CUL))
#define bM4_TMR43_POCRW_DIVCKW0                         *((volatile unsigned int*)(0x42499400UL))
#define bM4_TMR43_POCRW_DIVCKW1                         *((volatile unsigned int*)(0x42499404UL))
#define bM4_TMR43_POCRW_DIVCKW2                         *((volatile unsigned int*)(0x42499408UL))
#define bM4_TMR43_POCRW_DIVCKW3                         *((volatile unsigned int*)(0x4249940CUL))
#define bM4_TMR43_POCRW_PWMMDW0                         *((volatile unsigned int*)(0x42499410UL))
#define bM4_TMR43_POCRW_PWMMDW1                         *((volatile unsigned int*)(0x42499414UL))
#define bM4_TMR43_POCRW_LVLSW0                          *((volatile unsigned int*)(0x42499418UL))
#define bM4_TMR43_POCRW_LVLSW1                          *((volatile unsigned int*)(0x4249941CUL))
#define bM4_TMR43_RCSR_RTIDU                            *((volatile unsigned int*)(0x42499480UL))
#define bM4_TMR43_RCSR_RTIDV                            *((volatile unsigned int*)(0x42499484UL))
#define bM4_TMR43_RCSR_RTIDW                            *((volatile unsigned int*)(0x42499488UL))
#define bM4_TMR43_RCSR_RTIFU                            *((volatile unsigned int*)(0x42499490UL))
#define bM4_TMR43_RCSR_RTICU                            *((volatile unsigned int*)(0x42499494UL))
#define bM4_TMR43_RCSR_RTEU                             *((volatile unsigned int*)(0x42499498UL))
#define bM4_TMR43_RCSR_RTSU                             *((volatile unsigned int*)(0x4249949CUL))
#define bM4_TMR43_RCSR_RTIFV                            *((volatile unsigned int*)(0x424994A0UL))
#define bM4_TMR43_RCSR_RTICV                            *((volatile unsigned int*)(0x424994A4UL))
#define bM4_TMR43_RCSR_RTEV                             *((volatile unsigned int*)(0x424994A8UL))
#define bM4_TMR43_RCSR_RTSV                             *((volatile unsigned int*)(0x424994ACUL))
#define bM4_TMR43_RCSR_RTIFW                            *((volatile unsigned int*)(0x424994B0UL))
#define bM4_TMR43_RCSR_RTICW                            *((volatile unsigned int*)(0x424994B4UL))
#define bM4_TMR43_RCSR_RTEW                             *((volatile unsigned int*)(0x424994B8UL))
#define bM4_TMR43_RCSR_RTSW                             *((volatile unsigned int*)(0x424994BCUL))
#define bM4_TMR43_SCSRUH_BUFENUH0                       *((volatile unsigned int*)(0x42499900UL))
#define bM4_TMR43_SCSRUH_BUFENUH1                       *((volatile unsigned int*)(0x42499904UL))
#define bM4_TMR43_SCSRUH_EVTOSUH0                       *((volatile unsigned int*)(0x42499908UL))
#define bM4_TMR43_SCSRUH_EVTOSUH1                       *((volatile unsigned int*)(0x4249990CUL))
#define bM4_TMR43_SCSRUH_EVTOSUH2                       *((volatile unsigned int*)(0x42499910UL))
#define bM4_TMR43_SCSRUH_LMCUH                          *((volatile unsigned int*)(0x42499914UL))
#define bM4_TMR43_SCSRUH_EVTMSUH                        *((volatile unsigned int*)(0x42499920UL))
#define bM4_TMR43_SCSRUH_EVTDSUH                        *((volatile unsigned int*)(0x42499924UL))
#define bM4_TMR43_SCSRUH_DENUH                          *((volatile unsigned int*)(0x42499930UL))
#define bM4_TMR43_SCSRUH_PENUH                          *((volatile unsigned int*)(0x42499934UL))
#define bM4_TMR43_SCSRUH_UENUH                          *((volatile unsigned int*)(0x42499938UL))
#define bM4_TMR43_SCSRUH_ZENUH                          *((volatile unsigned int*)(0x4249993CUL))
#define bM4_TMR43_SCMRUH_AMCUH0                         *((volatile unsigned int*)(0x42499940UL))
#define bM4_TMR43_SCMRUH_AMCUH1                         *((volatile unsigned int*)(0x42499944UL))
#define bM4_TMR43_SCMRUH_AMCUH2                         *((volatile unsigned int*)(0x42499948UL))
#define bM4_TMR43_SCMRUH_AMCUH3                         *((volatile unsigned int*)(0x4249994CUL))
#define bM4_TMR43_SCMRUH_MZCEUH                         *((volatile unsigned int*)(0x42499958UL))
#define bM4_TMR43_SCMRUH_MPCEUH                         *((volatile unsigned int*)(0x4249995CUL))
#define bM4_TMR43_SCSRUL_BUFENUL0                       *((volatile unsigned int*)(0x42499980UL))
#define bM4_TMR43_SCSRUL_BUFENUL1                       *((volatile unsigned int*)(0x42499984UL))
#define bM4_TMR43_SCSRUL_EVTOSUL0                       *((volatile unsigned int*)(0x42499988UL))
#define bM4_TMR43_SCSRUL_EVTOSUL1                       *((volatile unsigned int*)(0x4249998CUL))
#define bM4_TMR43_SCSRUL_EVTOSUL2                       *((volatile unsigned int*)(0x42499990UL))
#define bM4_TMR43_SCSRUL_LMCUL                          *((volatile unsigned int*)(0x42499994UL))
#define bM4_TMR43_SCSRUL_EVTMSUL                        *((volatile unsigned int*)(0x424999A0UL))
#define bM4_TMR43_SCSRUL_EVTDSUL                        *((volatile unsigned int*)(0x424999A4UL))
#define bM4_TMR43_SCSRUL_DENUL                          *((volatile unsigned int*)(0x424999B0UL))
#define bM4_TMR43_SCSRUL_PENUL                          *((volatile unsigned int*)(0x424999B4UL))
#define bM4_TMR43_SCSRUL_UENUL                          *((volatile unsigned int*)(0x424999B8UL))
#define bM4_TMR43_SCSRUL_ZENUL                          *((volatile unsigned int*)(0x424999BCUL))
#define bM4_TMR43_SCMRUL_AMCUL0                         *((volatile unsigned int*)(0x424999C0UL))
#define bM4_TMR43_SCMRUL_AMCUL1                         *((volatile unsigned int*)(0x424999C4UL))
#define bM4_TMR43_SCMRUL_AMCUL2                         *((volatile unsigned int*)(0x424999C8UL))
#define bM4_TMR43_SCMRUL_AMCUL3                         *((volatile unsigned int*)(0x424999CCUL))
#define bM4_TMR43_SCMRUL_MZCEUL                         *((volatile unsigned int*)(0x424999D8UL))
#define bM4_TMR43_SCMRUL_MPCEUL                         *((volatile unsigned int*)(0x424999DCUL))
#define bM4_TMR43_SCSRVH_BUFENVH0                       *((volatile unsigned int*)(0x42499A00UL))
#define bM4_TMR43_SCSRVH_BUFENVH1                       *((volatile unsigned int*)(0x42499A04UL))
#define bM4_TMR43_SCSRVH_EVTOSVH0                       *((volatile unsigned int*)(0x42499A08UL))
#define bM4_TMR43_SCSRVH_EVTOSVH1                       *((volatile unsigned int*)(0x42499A0CUL))
#define bM4_TMR43_SCSRVH_EVTOSVH2                       *((volatile unsigned int*)(0x42499A10UL))
#define bM4_TMR43_SCSRVH_LMCVH                          *((volatile unsigned int*)(0x42499A14UL))
#define bM4_TMR43_SCSRVH_EVTMSVH                        *((volatile unsigned int*)(0x42499A20UL))
#define bM4_TMR43_SCSRVH_EVTDSVH                        *((volatile unsigned int*)(0x42499A24UL))
#define bM4_TMR43_SCSRVH_DENVH                          *((volatile unsigned int*)(0x42499A30UL))
#define bM4_TMR43_SCSRVH_PENVH                          *((volatile unsigned int*)(0x42499A34UL))
#define bM4_TMR43_SCSRVH_UENVH                          *((volatile unsigned int*)(0x42499A38UL))
#define bM4_TMR43_SCSRVH_ZENVH                          *((volatile unsigned int*)(0x42499A3CUL))
#define bM4_TMR43_SCMRVH_AMCVH0                         *((volatile unsigned int*)(0x42499A40UL))
#define bM4_TMR43_SCMRVH_AMCVH1                         *((volatile unsigned int*)(0x42499A44UL))
#define bM4_TMR43_SCMRVH_AMCVH2                         *((volatile unsigned int*)(0x42499A48UL))
#define bM4_TMR43_SCMRVH_AMCVH3                         *((volatile unsigned int*)(0x42499A4CUL))
#define bM4_TMR43_SCMRVH_MZCEVH                         *((volatile unsigned int*)(0x42499A58UL))
#define bM4_TMR43_SCMRVH_MPCEVH                         *((volatile unsigned int*)(0x42499A5CUL))
#define bM4_TMR43_SCSRVL_BUFENVL0                       *((volatile unsigned int*)(0x42499A80UL))
#define bM4_TMR43_SCSRVL_BUFENVL1                       *((volatile unsigned int*)(0x42499A84UL))
#define bM4_TMR43_SCSRVL_EVTOSVL0                       *((volatile unsigned int*)(0x42499A88UL))
#define bM4_TMR43_SCSRVL_EVTOSVL1                       *((volatile unsigned int*)(0x42499A8CUL))
#define bM4_TMR43_SCSRVL_EVTOSVL2                       *((volatile unsigned int*)(0x42499A90UL))
#define bM4_TMR43_SCSRVL_LMCVL                          *((volatile unsigned int*)(0x42499A94UL))
#define bM4_TMR43_SCSRVL_EVTMSVL                        *((volatile unsigned int*)(0x42499AA0UL))
#define bM4_TMR43_SCSRVL_EVTDSVL                        *((volatile unsigned int*)(0x42499AA4UL))
#define bM4_TMR43_SCSRVL_DENVL                          *((volatile unsigned int*)(0x42499AB0UL))
#define bM4_TMR43_SCSRVL_PENVL                          *((volatile unsigned int*)(0x42499AB4UL))
#define bM4_TMR43_SCSRVL_UENVL                          *((volatile unsigned int*)(0x42499AB8UL))
#define bM4_TMR43_SCSRVL_ZENVL                          *((volatile unsigned int*)(0x42499ABCUL))
#define bM4_TMR43_SCMRVL_AMCVL0                         *((volatile unsigned int*)(0x42499AC0UL))
#define bM4_TMR43_SCMRVL_AMCVL1                         *((volatile unsigned int*)(0x42499AC4UL))
#define bM4_TMR43_SCMRVL_AMCVL2                         *((volatile unsigned int*)(0x42499AC8UL))
#define bM4_TMR43_SCMRVL_AMCVL3                         *((volatile unsigned int*)(0x42499ACCUL))
#define bM4_TMR43_SCMRVL_MZCEVL                         *((volatile unsigned int*)(0x42499AD8UL))
#define bM4_TMR43_SCMRVL_MPCEVL                         *((volatile unsigned int*)(0x42499ADCUL))
#define bM4_TMR43_SCSRWH_BUFENWH0                       *((volatile unsigned int*)(0x42499B00UL))
#define bM4_TMR43_SCSRWH_BUFENWH1                       *((volatile unsigned int*)(0x42499B04UL))
#define bM4_TMR43_SCSRWH_EVTOSWH0                       *((volatile unsigned int*)(0x42499B08UL))
