CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_TMR61_SCMCR_SCMC12                          *((volatile unsigned int*)(0x42300630UL))
#define bM4_TMR61_SCMCR_SCMC13                          *((volatile unsigned int*)(0x42300634UL))
#define bM4_TMR61_SCMCR_SCMC14                          *((volatile unsigned int*)(0x42300638UL))
#define bM4_TMR61_SCMCR_SCMC15                          *((volatile unsigned int*)(0x4230063CUL))
#define bM4_TMR61_SCMDR_SCMD0                           *((volatile unsigned int*)(0x42300680UL))
#define bM4_TMR61_SCMDR_SCMD1                           *((volatile unsigned int*)(0x42300684UL))
#define bM4_TMR61_SCMDR_SCMD2                           *((volatile unsigned int*)(0x42300688UL))
#define bM4_TMR61_SCMDR_SCMD3                           *((volatile unsigned int*)(0x4230068CUL))
#define bM4_TMR61_SCMDR_SCMD4                           *((volatile unsigned int*)(0x42300690UL))
#define bM4_TMR61_SCMDR_SCMD5                           *((volatile unsigned int*)(0x42300694UL))
#define bM4_TMR61_SCMDR_SCMD6                           *((volatile unsigned int*)(0x42300698UL))
#define bM4_TMR61_SCMDR_SCMD7                           *((volatile unsigned int*)(0x4230069CUL))
#define bM4_TMR61_SCMDR_SCMD8                           *((volatile unsigned int*)(0x423006A0UL))
#define bM4_TMR61_SCMDR_SCMD9                           *((volatile unsigned int*)(0x423006A4UL))
#define bM4_TMR61_SCMDR_SCMD10                          *((volatile unsigned int*)(0x423006A8UL))
#define bM4_TMR61_SCMDR_SCMD11                          *((volatile unsigned int*)(0x423006ACUL))
#define bM4_TMR61_SCMDR_SCMD12                          *((volatile unsigned int*)(0x423006B0UL))
#define bM4_TMR61_SCMDR_SCMD13                          *((volatile unsigned int*)(0x423006B4UL))
#define bM4_TMR61_SCMDR_SCMD14                          *((volatile unsigned int*)(0x423006B8UL))
#define bM4_TMR61_SCMDR_SCMD15                          *((volatile unsigned int*)(0x423006BCUL))
#define bM4_TMR61_SCMER_SCME0                           *((volatile unsigned int*)(0x42300700UL))
#define bM4_TMR61_SCMER_SCME1                           *((volatile unsigned int*)(0x42300704UL))
#define bM4_TMR61_SCMER_SCME2                           *((volatile unsigned int*)(0x42300708UL))
#define bM4_TMR61_SCMER_SCME3                           *((volatile unsigned int*)(0x4230070CUL))
#define bM4_TMR61_SCMER_SCME4                           *((volatile unsigned int*)(0x42300710UL))
#define bM4_TMR61_SCMER_SCME5                           *((volatile unsigned int*)(0x42300714UL))
#define bM4_TMR61_SCMER_SCME6                           *((volatile unsigned int*)(0x42300718UL))
#define bM4_TMR61_SCMER_SCME7                           *((volatile unsigned int*)(0x4230071CUL))
#define bM4_TMR61_SCMER_SCME8                           *((volatile unsigned int*)(0x42300720UL))
#define bM4_TMR61_SCMER_SCME9                           *((volatile unsigned int*)(0x42300724UL))
#define bM4_TMR61_SCMER_SCME10                          *((volatile unsigned int*)(0x42300728UL))
#define bM4_TMR61_SCMER_SCME11                          *((volatile unsigned int*)(0x4230072CUL))
#define bM4_TMR61_SCMER_SCME12                          *((volatile unsigned int*)(0x42300730UL))
#define bM4_TMR61_SCMER_SCME13                          *((volatile unsigned int*)(0x42300734UL))
#define bM4_TMR61_SCMER_SCME14                          *((volatile unsigned int*)(0x42300738UL))
#define bM4_TMR61_SCMER_SCME15                          *((volatile unsigned int*)(0x4230073CUL))
#define bM4_TMR61_SCMFR_SCMF0                           *((volatile unsigned int*)(0x42300780UL))
#define bM4_TMR61_SCMFR_SCMF1                           *((volatile unsigned int*)(0x42300784UL))
#define bM4_TMR61_SCMFR_SCMF2                           *((volatile unsigned int*)(0x42300788UL))
#define bM4_TMR61_SCMFR_SCMF3                           *((volatile unsigned int*)(0x4230078CUL))
#define bM4_TMR61_SCMFR_SCMF4                           *((volatile unsigned int*)(0x42300790UL))
#define bM4_TMR61_SCMFR_SCMF5                           *((volatile unsigned int*)(0x42300794UL))
#define bM4_TMR61_SCMFR_SCMF6                           *((volatile unsigned int*)(0x42300798UL))
#define bM4_TMR61_SCMFR_SCMF7                           *((volatile unsigned int*)(0x4230079CUL))
#define bM4_TMR61_SCMFR_SCMF8                           *((volatile unsigned int*)(0x423007A0UL))
#define bM4_TMR61_SCMFR_SCMF9                           *((volatile unsigned int*)(0x423007A4UL))
#define bM4_TMR61_SCMFR_SCMF10                          *((volatile unsigned int*)(0x423007A8UL))
#define bM4_TMR61_SCMFR_SCMF11                          *((volatile unsigned int*)(0x423007ACUL))
#define bM4_TMR61_SCMFR_SCMF12                          *((volatile unsigned int*)(0x423007B0UL))
#define bM4_TMR61_SCMFR_SCMF13                          *((volatile unsigned int*)(0x423007B4UL))
#define bM4_TMR61_SCMFR_SCMF14                          *((volatile unsigned int*)(0x423007B8UL))
#define bM4_TMR61_SCMFR_SCMF15                          *((volatile unsigned int*)(0x423007BCUL))
#define bM4_TMR61_DTUAR_DTUA0                           *((volatile unsigned int*)(0x42300800UL))
#define bM4_TMR61_DTUAR_DTUA1                           *((volatile unsigned int*)(0x42300804UL))
#define bM4_TMR61_DTUAR_DTUA2                           *((volatile unsigned int*)(0x42300808UL))
#define bM4_TMR61_DTUAR_DTUA3                           *((volatile unsigned int*)(0x4230080CUL))
#define bM4_TMR61_DTUAR_DTUA4                           *((volatile unsigned int*)(0x42300810UL))
#define bM4_TMR61_DTUAR_DTUA5                           *((volatile unsigned int*)(0x42300814UL))
#define bM4_TMR61_DTUAR_DTUA6                           *((volatile unsigned int*)(0x42300818UL))
#define bM4_TMR61_DTUAR_DTUA7                           *((volatile unsigned int*)(0x4230081CUL))
#define bM4_TMR61_DTUAR_DTUA8                           *((volatile unsigned int*)(0x42300820UL))
#define bM4_TMR61_DTUAR_DTUA9                           *((volatile unsigned int*)(0x42300824UL))
#define bM4_TMR61_DTUAR_DTUA10                          *((volatile unsigned int*)(0x42300828UL))
#define bM4_TMR61_DTUAR_DTUA11                          *((volatile unsigned int*)(0x4230082CUL))
#define bM4_TMR61_DTUAR_DTUA12                          *((volatile unsigned int*)(0x42300830UL))
#define bM4_TMR61_DTUAR_DTUA13                          *((volatile unsigned int*)(0x42300834UL))
#define bM4_TMR61_DTUAR_DTUA14                          *((volatile unsigned int*)(0x42300838UL))
#define bM4_TMR61_DTUAR_DTUA15                          *((volatile unsigned int*)(0x4230083CUL))
#define bM4_TMR61_DTDAR_DTDA0                           *((volatile unsigned int*)(0x42300880UL))
#define bM4_TMR61_DTDAR_DTDA1                           *((volatile unsigned int*)(0x42300884UL))
#define bM4_TMR61_DTDAR_DTDA2                           *((volatile unsigned int*)(0x42300888UL))
#define bM4_TMR61_DTDAR_DTDA3                           *((volatile unsigned int*)(0x4230088CUL))
#define bM4_TMR61_DTDAR_DTDA4                           *((volatile unsigned int*)(0x42300890UL))
#define bM4_TMR61_DTDAR_DTDA5                           *((volatile unsigned int*)(0x42300894UL))
#define bM4_TMR61_DTDAR_DTDA6                           *((volatile unsigned int*)(0x42300898UL))
#define bM4_TMR61_DTDAR_DTDA7                           *((volatile unsigned int*)(0x4230089CUL))
#define bM4_TMR61_DTDAR_DTDA8                           *((volatile unsigned int*)(0x423008A0UL))
#define bM4_TMR61_DTDAR_DTDA9                           *((volatile unsigned int*)(0x423008A4UL))
#define bM4_TMR61_DTDAR_DTDA10                          *((volatile unsigned int*)(0x423008A8UL))
#define bM4_TMR61_DTDAR_DTDA11                          *((volatile unsigned int*)(0x423008ACUL))
#define bM4_TMR61_DTDAR_DTDA12                          *((volatile unsigned int*)(0x423008B0UL))
#define bM4_TMR61_DTDAR_DTDA13                          *((volatile unsigned int*)(0x423008B4UL))
#define bM4_TMR61_DTDAR_DTDA14                          *((volatile unsigned int*)(0x423008B8UL))
#define bM4_TMR61_DTDAR_DTDA15                          *((volatile unsigned int*)(0x423008BCUL))
#define bM4_TMR61_DTUBR_DTUB0                           *((volatile unsigned int*)(0x42300900UL))
#define bM4_TMR61_DTUBR_DTUB1                           *((volatile unsigned int*)(0x42300904UL))
#define bM4_TMR61_DTUBR_DTUB2                           *((volatile unsigned int*)(0x42300908UL))
#define bM4_TMR61_DTUBR_DTUB3                           *((volatile unsigned int*)(0x4230090CUL))
#define bM4_TMR61_DTUBR_DTUB4                           *((volatile unsigned int*)(0x42300910UL))
#define bM4_TMR61_DTUBR_DTUB5                           *((volatile unsigned int*)(0x42300914UL))
#define bM4_TMR61_DTUBR_DTUB6                           *((volatile unsigned int*)(0x42300918UL))
#define bM4_TMR61_DTUBR_DTUB7                           *((volatile unsigned int*)(0x4230091CUL))
#define bM4_TMR61_DTUBR_DTUB8                           *((volatile unsigned int*)(0x42300920UL))
#define bM4_TMR61_DTUBR_DTUB9                           *((volatile unsigned int*)(0x42300924UL))
#define bM4_TMR61_DTUBR_DTUB10                          *((volatile unsigned int*)(0x42300928UL))
#define bM4_TMR61_DTUBR_DTUB11                          *((volatile unsigned int*)(0x4230092CUL))
#define bM4_TMR61_DTUBR_DTUB12                          *((volatile unsigned int*)(0x42300930UL))
#define bM4_TMR61_DTUBR_DTUB13                          *((volatile unsigned int*)(0x42300934UL))
#define bM4_TMR61_DTUBR_DTUB14                          *((volatile unsigned int*)(0x42300938UL))
#define bM4_TMR61_DTUBR_DTUB15                          *((volatile unsigned int*)(0x4230093CUL))
#define bM4_TMR61_DTDBR_DTDB0                           *((volatile unsigned int*)(0x42300980UL))
#define bM4_TMR61_DTDBR_DTDB1                           *((volatile unsigned int*)(0x42300984UL))
#define bM4_TMR61_DTDBR_DTDB2                           *((volatile unsigned int*)(0x42300988UL))
#define bM4_TMR61_DTDBR_DTDB3                           *((volatile unsigned int*)(0x4230098CUL))
#define bM4_TMR61_DTDBR_DTDB4                           *((volatile unsigned int*)(0x42300990UL))
#define bM4_TMR61_DTDBR_DTDB5                           *((volatile unsigned int*)(0x42300994UL))
#define bM4_TMR61_DTDBR_DTDB6                           *((volatile unsigned int*)(0x42300998UL))
#define bM4_TMR61_DTDBR_DTDB7                           *((volatile unsigned int*)(0x4230099CUL))
#define bM4_TMR61_DTDBR_DTDB8                           *((volatile unsigned int*)(0x423009A0UL))
#define bM4_TMR61_DTDBR_DTDB9                           *((volatile unsigned int*)(0x423009A4UL))
#define bM4_TMR61_DTDBR_DTDB10                          *((volatile unsigned int*)(0x423009A8UL))
#define bM4_TMR61_DTDBR_DTDB11                          *((volatile unsigned int*)(0x423009ACUL))
#define bM4_TMR61_DTDBR_DTDB12                          *((volatile unsigned int*)(0x423009B0UL))
#define bM4_TMR61_DTDBR_DTDB13                          *((volatile unsigned int*)(0x423009B4UL))
#define bM4_TMR61_DTDBR_DTDB14                          *((volatile unsigned int*)(0x423009B8UL))
#define bM4_TMR61_DTDBR_DTDB15                          *((volatile unsigned int*)(0x423009BCUL))
#define bM4_TMR61_GCONR_START                           *((volatile unsigned int*)(0x42300A00UL))
#define bM4_TMR61_GCONR_MODE0                           *((volatile unsigned int*)(0x42300A04UL))
#define bM4_TMR61_GCONR_MODE1                           *((volatile unsigned int*)(0x42300A08UL))
#define bM4_TMR61_GCONR_MODE2                           *((volatile unsigned int*)(0x42300A0CUL))
#define bM4_TMR61_GCONR_CKDIV0                          *((volatile unsigned int*)(0x42300A10UL))
#define bM4_TMR61_GCONR_CKDIV1                          *((volatile unsigned int*)(0x42300A14UL))
#define bM4_TMR61_GCONR_CKDIV2                          *((volatile unsigned int*)(0x42300A18UL))
#define bM4_TMR61_GCONR_DIR                             *((volatile unsigned int*)(0x42300A20UL))
#define bM4_TMR61_GCONR_ZMSKREV                         *((volatile unsigned int*)(0x42300A40UL))
#define bM4_TMR61_GCONR_ZMSKPOS                         *((volatile unsigned int*)(0x42300A44UL))
#define bM4_TMR61_GCONR_ZMSKVAL0                        *((volatile unsigned int*)(0x42300A48UL))
#define bM4_TMR61_GCONR_ZMSKVAL1                        *((volatile unsigned int*)(0x42300A4CUL))
#define bM4_TMR61_ICONR_INTENA                          *((volatile unsigned int*)(0x42300A80UL))
#define bM4_TMR61_ICONR_INTENB                          *((volatile unsigned int*)(0x42300A84UL))
#define bM4_TMR61_ICONR_INTENC                          *((volatile unsigned int*)(0x42300A88UL))
#define bM4_TMR61_ICONR_INTEND                          *((volatile unsigned int*)(0x42300A8CUL))
#define bM4_TMR61_ICONR_INTENE                          *((volatile unsigned int*)(0x42300A90UL))
#define bM4_TMR61_ICONR_INTENF                          *((volatile unsigned int*)(0x42300A94UL))
#define bM4_TMR61_ICONR_INTENOVF                        *((volatile unsigned int*)(0x42300A98UL))
#define bM4_TMR61_ICONR_INTENUDF                        *((volatile unsigned int*)(0x42300A9CUL))
#define bM4_TMR61_ICONR_INTENDTE                        *((volatile unsigned int*)(0x42300AA0UL))
#define bM4_TMR61_ICONR_INTENSAU                        *((volatile unsigned int*)(0x42300AC0UL))
#define bM4_TMR61_ICONR_INTENSAD                        *((volatile unsigned int*)(0x42300AC4UL))
#define bM4_TMR61_ICONR_INTENSBU                        *((volatile unsigned int*)(0x42300AC8UL))
#define bM4_TMR61_ICONR_INTENSBD                        *((volatile unsigned int*)(0x42300ACCUL))
#define bM4_TMR61_PCONR_CAPMDA                          *((volatile unsigned int*)(0x42300B00UL))
#define bM4_TMR61_PCONR_STACA                           *((volatile unsigned int*)(0x42300B04UL))
#define bM4_TMR61_PCONR_STPCA                           *((volatile unsigned int*)(0x42300B08UL))
#define bM4_TMR61_PCONR_STASTPSA                        *((volatile unsigned int*)(0x42300B0CUL))
#define bM4_TMR61_PCONR_CMPCA0                          *((volatile unsigned int*)(0x42300B10UL))
#define bM4_TMR61_PCONR_CMPCA1                          *((volatile unsigned int*)(0x42300B14UL))
#define bM4_TMR61_PCONR_PERCA0                          *((volatile unsigned int*)(0x42300B18UL))
#define bM4_TMR61_PCONR_PERCA1                          *((volatile unsigned int*)(0x42300B1CUL))
#define bM4_TMR61_PCONR_OUTENA                          *((volatile unsigned int*)(0x42300B20UL))
#define bM4_TMR61_PCONR_EMBSELA0                        *((volatile unsigned int*)(0x42300B24UL))
#define bM4_TMR61_PCONR_EMBSELA1                        *((volatile unsigned int*)(0x42300B28UL))
#define bM4_TMR61_PCONR_EMBVALA0                        *((volatile unsigned int*)(0x42300B2CUL))
#define bM4_TMR61_PCONR_EMBVALA1                        *((volatile unsigned int*)(0x42300B30UL))
#define bM4_TMR61_PCONR_CAPMDB                          *((volatile unsigned int*)(0x42300B40UL))
#define bM4_TMR61_PCONR_STACB                           *((volatile unsigned int*)(0x42300B44UL))
#define bM4_TMR61_PCONR_STPCB                           *((volatile unsigned int*)(0x42300B48UL))
#define bM4_TMR61_PCONR_STASTPSB                        *((volatile unsigned int*)(0x42300B4CUL))
#define bM4_TMR61_PCONR_CMPCB0                          *((volatile unsigned int*)(0x42300B50UL))
#define bM4_TMR61_PCONR_CMPCB1                          *((volatile unsigned int*)(0x42300B54UL))
#define bM4_TMR61_PCONR_PERCB0                          *((volatile unsigned int*)(0x42300B58UL))
#define bM4_TMR61_PCONR_PERCB1                          *((volatile unsigned int*)(0x42300B5CUL))
#define bM4_TMR61_PCONR_OUTENB                          *((volatile unsigned int*)(0x42300B60UL))
#define bM4_TMR61_PCONR_EMBSELB0                        *((volatile unsigned int*)(0x42300B64UL))
#define bM4_TMR61_PCONR_EMBSELB1                        *((volatile unsigned int*)(0x42300B68UL))
#define bM4_TMR61_PCONR_EMBVALB0                        *((volatile unsigned int*)(0x42300B6CUL))
#define bM4_TMR61_PCONR_EMBVALB1                        *((volatile unsigned int*)(0x42300B70UL))
#define bM4_TMR61_BCONR_BENA                            *((volatile unsigned int*)(0x42300B80UL))
#define bM4_TMR61_BCONR_BSEA                            *((volatile unsigned int*)(0x42300B84UL))
#define bM4_TMR61_BCONR_BENB                            *((volatile unsigned int*)(0x42300B88UL))
#define bM4_TMR61_BCONR_BSEB                            *((volatile unsigned int*)(0x42300B8CUL))
#define bM4_TMR61_BCONR_BENP                            *((volatile unsigned int*)(0x42300BA0UL))
#define bM4_TMR61_BCONR_BSEP                            *((volatile unsigned int*)(0x42300BA4UL))
#define bM4_TMR61_BCONR_BENSPA                          *((volatile unsigned int*)(0x42300BC0UL))
#define bM4_TMR61_BCONR_BSESPA                          *((volatile unsigned int*)(0x42300BC4UL))
#define bM4_TMR61_BCONR_BTRSPA0                         *((volatile unsigned int*)(0x42300BD0UL))
#define bM4_TMR61_BCONR_BTRSPA1                         *((volatile unsigned int*)(0x42300BD4UL))
#define bM4_TMR61_BCONR_BENSPB                          *((volatile unsigned int*)(0x42300BE0UL))
#define bM4_TMR61_BCONR_BSESPB                          *((volatile unsigned int*)(0x42300BE4UL))
#define bM4_TMR61_BCONR_BTRSPB0                         *((volatile unsigned int*)(0x42300BF0UL))
#define bM4_TMR61_BCONR_BTRSPB1                         *((volatile unsigned int*)(0x42300BF4UL))
#define bM4_TMR61_DCONR_DTCEN                           *((volatile unsigned int*)(0x42300C00UL))
#define bM4_TMR61_DCONR_DTBENU                          *((volatile unsigned int*)(0x42300C10UL))
#define bM4_TMR61_DCONR_DTBEND                          *((volatile unsigned int*)(0x42300C14UL))
#define bM4_TMR61_DCONR_SEPA                            *((volatile unsigned int*)(0x42300C20UL))
#define bM4_TMR61_FCONR_NOFIENGA                        *((volatile unsigned int*)(0x42300D00UL))
#define bM4_TMR61_FCONR_NOFICKGA0                       *((volatile unsigned int*)(0x42300D04UL))
#define bM4_TMR61_FCONR_NOFICKGA1                       *((volatile unsigned int*)(0x42300D08UL))
#define bM4_TMR61_FCONR_NOFIENGB                        *((volatile unsigned int*)(0x42300D10UL))
#define bM4_TMR61_FCONR_NOFICKGB0                       *((volatile unsigned int*)(0x42300D14UL))
#define bM4_TMR61_FCONR_NOFICKGB1                       *((volatile unsigned int*)(0x42300D18UL))
#define bM4_TMR61_FCONR_NOFIENTA                        *((volatile unsigned int*)(0x42300D40UL))
#define bM4_TMR61_FCONR_NOFICKTA0                       *((volatile unsigned int*)(0x42300D44UL))
#define bM4_TMR61_FCONR_NOFICKTA1                       *((volatile unsigned int*)(0x42300D48UL))
#define bM4_TMR61_FCONR_NOFIENTB                        *((volatile unsigned int*)(0x42300D50UL))
#define bM4_TMR61_FCONR_NOFICKTB0                       *((volatile unsigned int*)(0x42300D54UL))
#define bM4_TMR61_FCONR_NOFICKTB1                       *((volatile unsigned int*)(0x42300D58UL))
#define bM4_TMR61_VPERR_SPPERIA                         *((volatile unsigned int*)(0x42300DA0UL))
#define bM4_TMR61_VPERR_SPPERIB                         *((volatile unsigned int*)(0x42300DA4UL))
#define bM4_TMR61_VPERR_PCNTE0                          *((volatile unsigned int*)(0x42300DC0UL))
#define bM4_TMR61_VPERR_PCNTE1                          *((volatile unsigned int*)(0x42300DC4UL))
#define bM4_TMR61_VPERR_PCNTS0                          *((volatile unsigned int*)(0x42300DC8UL))
#define bM4_TMR61_VPERR_PCNTS1                          *((volatile unsigned int*)(0x42300DCCUL))
#define bM4_TMR61_VPERR_PCNTS2                          *((volatile unsigned int*)(0x42300DD0UL))
#define bM4_TMR61_STFLR_CMAF                            *((volatile unsigned int*)(0x42300E00UL))
#define bM4_TMR61_STFLR_CMBF                            *((volatile unsigned int*)(0x42300E04UL))
#define bM4_TMR61_STFLR_CMCF                            *((volatile unsigned int*)(0x42300E08UL))
#define bM4_TMR61_STFLR_CMDF                            *((volatile unsigned int*)(0x42300E0CUL))
#define bM4_TMR61_STFLR_CMEF                            *((volatile unsigned int*)(0x42300E10UL))
#define bM4_TMR61_STFLR_CMFF                            *((volatile unsigned int*)(0x42300E14UL))
#define bM4_TMR61_STFLR_OVFF                            *((volatile unsigned int*)(0x42300E18UL))
#define bM4_TMR61_STFLR_UDFF                            *((volatile unsigned int*)(0x42300E1CUL))
#define bM4_TMR61_STFLR_DTEF                            *((volatile unsigned int*)(0x42300E20UL))
#define bM4_TMR61_STFLR_CMSAUF                          *((volatile unsigned int*)(0x42300E24UL))
#define bM4_TMR61_STFLR_CMSADF                          *((volatile unsigned int*)(0x42300E28UL))
#define bM4_TMR61_STFLR_CMSBUF                          *((volatile unsigned int*)(0x42300E2CUL))
#define bM4_TMR61_STFLR_CMSBDF                          *((volatile unsigned int*)(0x42300E30UL))
#define bM4_TMR61_STFLR_VPERNUM0                        *((volatile unsigned int*)(0x42300E54UL))
#define bM4_TMR61_STFLR_VPERNUM1                        *((volatile unsigned int*)(0x42300E58UL))
#define bM4_TMR61_STFLR_VPERNUM2                        *((volatile unsigned int*)(0x42300E5CUL))
#define bM4_TMR61_STFLR_DIRF                            *((volatile unsigned int*)(0x42300E7CUL))
#define bM4_TMR61_HSTAR_HSTA0                           *((volatile unsigned int*)(0x42300E80UL))
#define bM4_TMR61_HSTAR_HSTA1                           *((volatile unsigned int*)(0x42300E84UL))
#define bM4_TMR61_HSTAR_HSTA4                           *((volatile unsigned int*)(0x42300E90UL))
#define bM4_TMR61_HSTAR_HSTA5                           *((volatile unsigned int*)(0x42300E94UL))
#define bM4_TMR61_HSTAR_HSTA6                           *((volatile unsigned int*)(0x42300E98UL))
#define bM4_TMR61_HSTAR_HSTA7                           *((volatile unsigned int*)(0x42300E9CUL))
#define bM4_TMR61_HSTAR_HSTA8                           *((volatile unsigned int*)(0x42300EA0UL))
#define bM4_TMR61_HSTAR_HSTA9                           *((volatile unsigned int*)(0x42300EA4UL))
#define bM4_TMR61_HSTAR_HSTA10                          *((volatile unsigned int*)(0x42300EA8UL))
#define bM4_TMR61_HSTAR_HSTA11                          *((volatile unsigned int*)(0x42300EACUL))
#define bM4_TMR61_HSTAR_STARTS                          *((volatile unsigned int*)(0x42300EFCUL))
#define bM4_TMR61_HSTPR_HSTP0                           *((volatile unsigned int*)(0x42300F00UL))
#define bM4_TMR61_HSTPR_HSTP1                           *((volatile unsigned int*)(0x42300F04UL))
#define bM4_TMR61_HSTPR_HSTP4                           *((volatile unsigned int*)(0x42300F10UL))
#define bM4_TMR61_HSTPR_HSTP5                           *((volatile unsigned int*)(0x42300F14UL))
#define bM4_TMR61_HSTPR_HSTP6                           *((volatile unsigned int*)(0x42300F18UL))
#define bM4_TMR61_HSTPR_HSTP7                           *((volatile unsigned int*)(0x42300F1CUL))
#define bM4_TMR61_HSTPR_HSTP8                           *((volatile unsigned int*)(0x42300F20UL))
#define bM4_TMR61_HSTPR_HSTP9                           *((volatile unsigned int*)(0x42300F24UL))
#define bM4_TMR61_HSTPR_HSTP10                          *((volatile unsigned int*)(0x42300F28UL))
#define bM4_TMR61_HSTPR_HSTP11                          *((volatile unsigned int*)(0x42300F2CUL))
#define bM4_TMR61_HSTPR_STOPS                           *((volatile unsigned int*)(0x42300F7CUL))
#define bM4_TMR61_HCLRR_HCLE0                           *((volatile unsigned int*)(0x42300F80UL))
