CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_TMR62_SCMBR_SCMB10                          *((volatile unsigned int*)(0x423085A8UL))
#define bM4_TMR62_SCMBR_SCMB11                          *((volatile unsigned int*)(0x423085ACUL))
#define bM4_TMR62_SCMBR_SCMB12                          *((volatile unsigned int*)(0x423085B0UL))
#define bM4_TMR62_SCMBR_SCMB13                          *((volatile unsigned int*)(0x423085B4UL))
#define bM4_TMR62_SCMBR_SCMB14                          *((volatile unsigned int*)(0x423085B8UL))
#define bM4_TMR62_SCMBR_SCMB15                          *((volatile unsigned int*)(0x423085BCUL))
#define bM4_TMR62_SCMCR_SCMC0                           *((volatile unsigned int*)(0x42308600UL))
#define bM4_TMR62_SCMCR_SCMC1                           *((volatile unsigned int*)(0x42308604UL))
#define bM4_TMR62_SCMCR_SCMC2                           *((volatile unsigned int*)(0x42308608UL))
#define bM4_TMR62_SCMCR_SCMC3                           *((volatile unsigned int*)(0x4230860CUL))
#define bM4_TMR62_SCMCR_SCMC4                           *((volatile unsigned int*)(0x42308610UL))
#define bM4_TMR62_SCMCR_SCMC5                           *((volatile unsigned int*)(0x42308614UL))
#define bM4_TMR62_SCMCR_SCMC6                           *((volatile unsigned int*)(0x42308618UL))
#define bM4_TMR62_SCMCR_SCMC7                           *((volatile unsigned int*)(0x4230861CUL))
#define bM4_TMR62_SCMCR_SCMC8                           *((volatile unsigned int*)(0x42308620UL))
#define bM4_TMR62_SCMCR_SCMC9                           *((volatile unsigned int*)(0x42308624UL))
#define bM4_TMR62_SCMCR_SCMC10                          *((volatile unsigned int*)(0x42308628UL))
#define bM4_TMR62_SCMCR_SCMC11                          *((volatile unsigned int*)(0x4230862CUL))
#define bM4_TMR62_SCMCR_SCMC12                          *((volatile unsigned int*)(0x42308630UL))
#define bM4_TMR62_SCMCR_SCMC13                          *((volatile unsigned int*)(0x42308634UL))
#define bM4_TMR62_SCMCR_SCMC14                          *((volatile unsigned int*)(0x42308638UL))
#define bM4_TMR62_SCMCR_SCMC15                          *((volatile unsigned int*)(0x4230863CUL))
#define bM4_TMR62_SCMDR_SCMD0                           *((volatile unsigned int*)(0x42308680UL))
#define bM4_TMR62_SCMDR_SCMD1                           *((volatile unsigned int*)(0x42308684UL))
#define bM4_TMR62_SCMDR_SCMD2                           *((volatile unsigned int*)(0x42308688UL))
#define bM4_TMR62_SCMDR_SCMD3                           *((volatile unsigned int*)(0x4230868CUL))
#define bM4_TMR62_SCMDR_SCMD4                           *((volatile unsigned int*)(0x42308690UL))
#define bM4_TMR62_SCMDR_SCMD5                           *((volatile unsigned int*)(0x42308694UL))
#define bM4_TMR62_SCMDR_SCMD6                           *((volatile unsigned int*)(0x42308698UL))
#define bM4_TMR62_SCMDR_SCMD7                           *((volatile unsigned int*)(0x4230869CUL))
#define bM4_TMR62_SCMDR_SCMD8                           *((volatile unsigned int*)(0x423086A0UL))
#define bM4_TMR62_SCMDR_SCMD9                           *((volatile unsigned int*)(0x423086A4UL))
#define bM4_TMR62_SCMDR_SCMD10                          *((volatile unsigned int*)(0x423086A8UL))
#define bM4_TMR62_SCMDR_SCMD11                          *((volatile unsigned int*)(0x423086ACUL))
#define bM4_TMR62_SCMDR_SCMD12                          *((volatile unsigned int*)(0x423086B0UL))
#define bM4_TMR62_SCMDR_SCMD13                          *((volatile unsigned int*)(0x423086B4UL))
#define bM4_TMR62_SCMDR_SCMD14                          *((volatile unsigned int*)(0x423086B8UL))
#define bM4_TMR62_SCMDR_SCMD15                          *((volatile unsigned int*)(0x423086BCUL))
#define bM4_TMR62_SCMER_SCME0                           *((volatile unsigned int*)(0x42308700UL))
#define bM4_TMR62_SCMER_SCME1                           *((volatile unsigned int*)(0x42308704UL))
#define bM4_TMR62_SCMER_SCME2                           *((volatile unsigned int*)(0x42308708UL))
#define bM4_TMR62_SCMER_SCME3                           *((volatile unsigned int*)(0x4230870CUL))
#define bM4_TMR62_SCMER_SCME4                           *((volatile unsigned int*)(0x42308710UL))
#define bM4_TMR62_SCMER_SCME5                           *((volatile unsigned int*)(0x42308714UL))
#define bM4_TMR62_SCMER_SCME6                           *((volatile unsigned int*)(0x42308718UL))
#define bM4_TMR62_SCMER_SCME7                           *((volatile unsigned int*)(0x4230871CUL))
#define bM4_TMR62_SCMER_SCME8                           *((volatile unsigned int*)(0x42308720UL))
#define bM4_TMR62_SCMER_SCME9                           *((volatile unsigned int*)(0x42308724UL))
#define bM4_TMR62_SCMER_SCME10                          *((volatile unsigned int*)(0x42308728UL))
#define bM4_TMR62_SCMER_SCME11                          *((volatile unsigned int*)(0x4230872CUL))
#define bM4_TMR62_SCMER_SCME12                          *((volatile unsigned int*)(0x42308730UL))
#define bM4_TMR62_SCMER_SCME13                          *((volatile unsigned int*)(0x42308734UL))
#define bM4_TMR62_SCMER_SCME14                          *((volatile unsigned int*)(0x42308738UL))
#define bM4_TMR62_SCMER_SCME15                          *((volatile unsigned int*)(0x4230873CUL))
#define bM4_TMR62_SCMFR_SCMF0                           *((volatile unsigned int*)(0x42308780UL))
#define bM4_TMR62_SCMFR_SCMF1                           *((volatile unsigned int*)(0x42308784UL))
#define bM4_TMR62_SCMFR_SCMF2                           *((volatile unsigned int*)(0x42308788UL))
#define bM4_TMR62_SCMFR_SCMF3                           *((volatile unsigned int*)(0x4230878CUL))
#define bM4_TMR62_SCMFR_SCMF4                           *((volatile unsigned int*)(0x42308790UL))
#define bM4_TMR62_SCMFR_SCMF5                           *((volatile unsigned int*)(0x42308794UL))
#define bM4_TMR62_SCMFR_SCMF6                           *((volatile unsigned int*)(0x42308798UL))
#define bM4_TMR62_SCMFR_SCMF7                           *((volatile unsigned int*)(0x4230879CUL))
#define bM4_TMR62_SCMFR_SCMF8                           *((volatile unsigned int*)(0x423087A0UL))
#define bM4_TMR62_SCMFR_SCMF9                           *((volatile unsigned int*)(0x423087A4UL))
#define bM4_TMR62_SCMFR_SCMF10                          *((volatile unsigned int*)(0x423087A8UL))
#define bM4_TMR62_SCMFR_SCMF11                          *((volatile unsigned int*)(0x423087ACUL))
#define bM4_TMR62_SCMFR_SCMF12                          *((volatile unsigned int*)(0x423087B0UL))
#define bM4_TMR62_SCMFR_SCMF13                          *((volatile unsigned int*)(0x423087B4UL))
#define bM4_TMR62_SCMFR_SCMF14                          *((volatile unsigned int*)(0x423087B8UL))
#define bM4_TMR62_SCMFR_SCMF15                          *((volatile unsigned int*)(0x423087BCUL))
#define bM4_TMR62_DTUAR_DTUA0                           *((volatile unsigned int*)(0x42308800UL))
#define bM4_TMR62_DTUAR_DTUA1                           *((volatile unsigned int*)(0x42308804UL))
#define bM4_TMR62_DTUAR_DTUA2                           *((volatile unsigned int*)(0x42308808UL))
#define bM4_TMR62_DTUAR_DTUA3                           *((volatile unsigned int*)(0x4230880CUL))
#define bM4_TMR62_DTUAR_DTUA4                           *((volatile unsigned int*)(0x42308810UL))
#define bM4_TMR62_DTUAR_DTUA5                           *((volatile unsigned int*)(0x42308814UL))
#define bM4_TMR62_DTUAR_DTUA6                           *((volatile unsigned int*)(0x42308818UL))
#define bM4_TMR62_DTUAR_DTUA7                           *((volatile unsigned int*)(0x4230881CUL))
#define bM4_TMR62_DTUAR_DTUA8                           *((volatile unsigned int*)(0x42308820UL))
#define bM4_TMR62_DTUAR_DTUA9                           *((volatile unsigned int*)(0x42308824UL))
#define bM4_TMR62_DTUAR_DTUA10                          *((volatile unsigned int*)(0x42308828UL))
#define bM4_TMR62_DTUAR_DTUA11                          *((volatile unsigned int*)(0x4230882CUL))
#define bM4_TMR62_DTUAR_DTUA12                          *((volatile unsigned int*)(0x42308830UL))
#define bM4_TMR62_DTUAR_DTUA13                          *((volatile unsigned int*)(0x42308834UL))
#define bM4_TMR62_DTUAR_DTUA14                          *((volatile unsigned int*)(0x42308838UL))
#define bM4_TMR62_DTUAR_DTUA15                          *((volatile unsigned int*)(0x4230883CUL))
#define bM4_TMR62_DTDAR_DTDA0                           *((volatile unsigned int*)(0x42308880UL))
#define bM4_TMR62_DTDAR_DTDA1                           *((volatile unsigned int*)(0x42308884UL))
#define bM4_TMR62_DTDAR_DTDA2                           *((volatile unsigned int*)(0x42308888UL))
#define bM4_TMR62_DTDAR_DTDA3                           *((volatile unsigned int*)(0x4230888CUL))
#define bM4_TMR62_DTDAR_DTDA4                           *((volatile unsigned int*)(0x42308890UL))
#define bM4_TMR62_DTDAR_DTDA5                           *((volatile unsigned int*)(0x42308894UL))
#define bM4_TMR62_DTDAR_DTDA6                           *((volatile unsigned int*)(0x42308898UL))
#define bM4_TMR62_DTDAR_DTDA7                           *((volatile unsigned int*)(0x4230889CUL))
#define bM4_TMR62_DTDAR_DTDA8                           *((volatile unsigned int*)(0x423088A0UL))
#define bM4_TMR62_DTDAR_DTDA9                           *((volatile unsigned int*)(0x423088A4UL))
#define bM4_TMR62_DTDAR_DTDA10                          *((volatile unsigned int*)(0x423088A8UL))
#define bM4_TMR62_DTDAR_DTDA11                          *((volatile unsigned int*)(0x423088ACUL))
#define bM4_TMR62_DTDAR_DTDA12                          *((volatile unsigned int*)(0x423088B0UL))
#define bM4_TMR62_DTDAR_DTDA13                          *((volatile unsigned int*)(0x423088B4UL))
#define bM4_TMR62_DTDAR_DTDA14                          *((volatile unsigned int*)(0x423088B8UL))
#define bM4_TMR62_DTDAR_DTDA15                          *((volatile unsigned int*)(0x423088BCUL))
#define bM4_TMR62_DTUBR_DTUB0                           *((volatile unsigned int*)(0x42308900UL))
#define bM4_TMR62_DTUBR_DTUB1                           *((volatile unsigned int*)(0x42308904UL))
#define bM4_TMR62_DTUBR_DTUB2                           *((volatile unsigned int*)(0x42308908UL))
#define bM4_TMR62_DTUBR_DTUB3                           *((volatile unsigned int*)(0x4230890CUL))
#define bM4_TMR62_DTUBR_DTUB4                           *((volatile unsigned int*)(0x42308910UL))
#define bM4_TMR62_DTUBR_DTUB5                           *((volatile unsigned int*)(0x42308914UL))
#define bM4_TMR62_DTUBR_DTUB6                           *((volatile unsigned int*)(0x42308918UL))
#define bM4_TMR62_DTUBR_DTUB7                           *((volatile unsigned int*)(0x4230891CUL))
#define bM4_TMR62_DTUBR_DTUB8                           *((volatile unsigned int*)(0x42308920UL))
#define bM4_TMR62_DTUBR_DTUB9                           *((volatile unsigned int*)(0x42308924UL))
#define bM4_TMR62_DTUBR_DTUB10                          *((volatile unsigned int*)(0x42308928UL))
#define bM4_TMR62_DTUBR_DTUB11                          *((volatile unsigned int*)(0x4230892CUL))
#define bM4_TMR62_DTUBR_DTUB12                          *((volatile unsigned int*)(0x42308930UL))
#define bM4_TMR62_DTUBR_DTUB13                          *((volatile unsigned int*)(0x42308934UL))
#define bM4_TMR62_DTUBR_DTUB14                          *((volatile unsigned int*)(0x42308938UL))
#define bM4_TMR62_DTUBR_DTUB15                          *((volatile unsigned int*)(0x4230893CUL))
#define bM4_TMR62_DTDBR_DTDB0                           *((volatile unsigned int*)(0x42308980UL))
#define bM4_TMR62_DTDBR_DTDB1                           *((volatile unsigned int*)(0x42308984UL))
#define bM4_TMR62_DTDBR_DTDB2                           *((volatile unsigned int*)(0x42308988UL))
#define bM4_TMR62_DTDBR_DTDB3                           *((volatile unsigned int*)(0x4230898CUL))
#define bM4_TMR62_DTDBR_DTDB4                           *((volatile unsigned int*)(0x42308990UL))
#define bM4_TMR62_DTDBR_DTDB5                           *((volatile unsigned int*)(0x42308994UL))
#define bM4_TMR62_DTDBR_DTDB6                           *((volatile unsigned int*)(0x42308998UL))
#define bM4_TMR62_DTDBR_DTDB7                           *((volatile unsigned int*)(0x4230899CUL))
#define bM4_TMR62_DTDBR_DTDB8                           *((volatile unsigned int*)(0x423089A0UL))
#define bM4_TMR62_DTDBR_DTDB9                           *((volatile unsigned int*)(0x423089A4UL))
#define bM4_TMR62_DTDBR_DTDB10                          *((volatile unsigned int*)(0x423089A8UL))
#define bM4_TMR62_DTDBR_DTDB11                          *((volatile unsigned int*)(0x423089ACUL))
#define bM4_TMR62_DTDBR_DTDB12                          *((volatile unsigned int*)(0x423089B0UL))
#define bM4_TMR62_DTDBR_DTDB13                          *((volatile unsigned int*)(0x423089B4UL))
#define bM4_TMR62_DTDBR_DTDB14                          *((volatile unsigned int*)(0x423089B8UL))
#define bM4_TMR62_DTDBR_DTDB15                          *((volatile unsigned int*)(0x423089BCUL))
#define bM4_TMR62_GCONR_START                           *((volatile unsigned int*)(0x42308A00UL))
#define bM4_TMR62_GCONR_MODE0                           *((volatile unsigned int*)(0x42308A04UL))
#define bM4_TMR62_GCONR_MODE1                           *((volatile unsigned int*)(0x42308A08UL))
#define bM4_TMR62_GCONR_MODE2                           *((volatile unsigned int*)(0x42308A0CUL))
#define bM4_TMR62_GCONR_CKDIV0                          *((volatile unsigned int*)(0x42308A10UL))
#define bM4_TMR62_GCONR_CKDIV1                          *((volatile unsigned int*)(0x42308A14UL))
#define bM4_TMR62_GCONR_CKDIV2                          *((volatile unsigned int*)(0x42308A18UL))
#define bM4_TMR62_GCONR_DIR                             *((volatile unsigned int*)(0x42308A20UL))
#define bM4_TMR62_GCONR_ZMSKREV                         *((volatile unsigned int*)(0x42308A40UL))
#define bM4_TMR62_GCONR_ZMSKPOS                         *((volatile unsigned int*)(0x42308A44UL))
#define bM4_TMR62_GCONR_ZMSKVAL0                        *((volatile unsigned int*)(0x42308A48UL))
#define bM4_TMR62_GCONR_ZMSKVAL1                        *((volatile unsigned int*)(0x42308A4CUL))
#define bM4_TMR62_ICONR_INTENA                          *((volatile unsigned int*)(0x42308A80UL))
#define bM4_TMR62_ICONR_INTENB                          *((volatile unsigned int*)(0x42308A84UL))
#define bM4_TMR62_ICONR_INTENC                          *((volatile unsigned int*)(0x42308A88UL))
#define bM4_TMR62_ICONR_INTEND                          *((volatile unsigned int*)(0x42308A8CUL))
#define bM4_TMR62_ICONR_INTENE                          *((volatile unsigned int*)(0x42308A90UL))
#define bM4_TMR62_ICONR_INTENF                          *((volatile unsigned int*)(0x42308A94UL))
#define bM4_TMR62_ICONR_INTENOVF                        *((volatile unsigned int*)(0x42308A98UL))
#define bM4_TMR62_ICONR_INTENUDF                        *((volatile unsigned int*)(0x42308A9CUL))
#define bM4_TMR62_ICONR_INTENDTE                        *((volatile unsigned int*)(0x42308AA0UL))
#define bM4_TMR62_ICONR_INTENSAU                        *((volatile unsigned int*)(0x42308AC0UL))
#define bM4_TMR62_ICONR_INTENSAD                        *((volatile unsigned int*)(0x42308AC4UL))
#define bM4_TMR62_ICONR_INTENSBU                        *((volatile unsigned int*)(0x42308AC8UL))
#define bM4_TMR62_ICONR_INTENSBD                        *((volatile unsigned int*)(0x42308ACCUL))
#define bM4_TMR62_PCONR_CAPMDA                          *((volatile unsigned int*)(0x42308B00UL))
#define bM4_TMR62_PCONR_STACA                           *((volatile unsigned int*)(0x42308B04UL))
#define bM4_TMR62_PCONR_STPCA                           *((volatile unsigned int*)(0x42308B08UL))
#define bM4_TMR62_PCONR_STASTPSA                        *((volatile unsigned int*)(0x42308B0CUL))
#define bM4_TMR62_PCONR_CMPCA0                          *((volatile unsigned int*)(0x42308B10UL))
#define bM4_TMR62_PCONR_CMPCA1                          *((volatile unsigned int*)(0x42308B14UL))
#define bM4_TMR62_PCONR_PERCA0                          *((volatile unsigned int*)(0x42308B18UL))
#define bM4_TMR62_PCONR_PERCA1                          *((volatile unsigned int*)(0x42308B1CUL))
#define bM4_TMR62_PCONR_OUTENA                          *((volatile unsigned int*)(0x42308B20UL))
#define bM4_TMR62_PCONR_EMBSELA0                        *((volatile unsigned int*)(0x42308B24UL))
#define bM4_TMR62_PCONR_EMBSELA1                        *((volatile unsigned int*)(0x42308B28UL))
#define bM4_TMR62_PCONR_EMBVALA0                        *((volatile unsigned int*)(0x42308B2CUL))
#define bM4_TMR62_PCONR_EMBVALA1                        *((volatile unsigned int*)(0x42308B30UL))
#define bM4_TMR62_PCONR_CAPMDB                          *((volatile unsigned int*)(0x42308B40UL))
#define bM4_TMR62_PCONR_STACB                           *((volatile unsigned int*)(0x42308B44UL))
#define bM4_TMR62_PCONR_STPCB                           *((volatile unsigned int*)(0x42308B48UL))
#define bM4_TMR62_PCONR_STASTPSB                        *((volatile unsigned int*)(0x42308B4CUL))
#define bM4_TMR62_PCONR_CMPCB0                          *((volatile unsigned int*)(0x42308B50UL))
#define bM4_TMR62_PCONR_CMPCB1                          *((volatile unsigned int*)(0x42308B54UL))
#define bM4_TMR62_PCONR_PERCB0                          *((volatile unsigned int*)(0x42308B58UL))
#define bM4_TMR62_PCONR_PERCB1                          *((volatile unsigned int*)(0x42308B5CUL))
#define bM4_TMR62_PCONR_OUTENB                          *((volatile unsigned int*)(0x42308B60UL))
#define bM4_TMR62_PCONR_EMBSELB0                        *((volatile unsigned int*)(0x42308B64UL))
#define bM4_TMR62_PCONR_EMBSELB1                        *((volatile unsigned int*)(0x42308B68UL))
#define bM4_TMR62_PCONR_EMBVALB0                        *((volatile unsigned int*)(0x42308B6CUL))
#define bM4_TMR62_PCONR_EMBVALB1                        *((volatile unsigned int*)(0x42308B70UL))
#define bM4_TMR62_BCONR_BENA                            *((volatile unsigned int*)(0x42308B80UL))
#define bM4_TMR62_BCONR_BSEA                            *((volatile unsigned int*)(0x42308B84UL))
#define bM4_TMR62_BCONR_BENB                            *((volatile unsigned int*)(0x42308B88UL))
#define bM4_TMR62_BCONR_BSEB                            *((volatile unsigned int*)(0x42308B8CUL))
#define bM4_TMR62_BCONR_BENP                            *((volatile unsigned int*)(0x42308BA0UL))
#define bM4_TMR62_BCONR_BSEP                            *((volatile unsigned int*)(0x42308BA4UL))
#define bM4_TMR62_BCONR_BENSPA                          *((volatile unsigned int*)(0x42308BC0UL))
#define bM4_TMR62_BCONR_BSESPA                          *((volatile unsigned int*)(0x42308BC4UL))
#define bM4_TMR62_BCONR_BTRSPA0                         *((volatile unsigned int*)(0x42308BD0UL))
#define bM4_TMR62_BCONR_BTRSPA1                         *((volatile unsigned int*)(0x42308BD4UL))
#define bM4_TMR62_BCONR_BENSPB                          *((volatile unsigned int*)(0x42308BE0UL))
#define bM4_TMR62_BCONR_BSESPB                          *((volatile unsigned int*)(0x42308BE4UL))
#define bM4_TMR62_BCONR_BTRSPB0                         *((volatile unsigned int*)(0x42308BF0UL))
#define bM4_TMR62_BCONR_BTRSPB1                         *((volatile unsigned int*)(0x42308BF4UL))
#define bM4_TMR62_DCONR_DTCEN                           *((volatile unsigned int*)(0x42308C00UL))
#define bM4_TMR62_DCONR_DTBENU                          *((volatile unsigned int*)(0x42308C10UL))
#define bM4_TMR62_DCONR_DTBEND                          *((volatile unsigned int*)(0x42308C14UL))
#define bM4_TMR62_DCONR_SEPA                            *((volatile unsigned int*)(0x42308C20UL))
#define bM4_TMR62_FCONR_NOFIENGA                        *((volatile unsigned int*)(0x42308D00UL))
#define bM4_TMR62_FCONR_NOFICKGA0                       *((volatile unsigned int*)(0x42308D04UL))
#define bM4_TMR62_FCONR_NOFICKGA1                       *((volatile unsigned int*)(0x42308D08UL))
#define bM4_TMR62_FCONR_NOFIENGB                        *((volatile unsigned int*)(0x42308D10UL))
#define bM4_TMR62_FCONR_NOFICKGB0                       *((volatile unsigned int*)(0x42308D14UL))
#define bM4_TMR62_FCONR_NOFICKGB1                       *((volatile unsigned int*)(0x42308D18UL))
#define bM4_TMR62_FCONR_NOFIENTA                        *((volatile unsigned int*)(0x42308D40UL))
#define bM4_TMR62_FCONR_NOFICKTA0                       *((volatile unsigned int*)(0x42308D44UL))
#define bM4_TMR62_FCONR_NOFICKTA1                       *((volatile unsigned int*)(0x42308D48UL))
#define bM4_TMR62_FCONR_NOFIENTB                        *((volatile unsigned int*)(0x42308D50UL))
#define bM4_TMR62_FCONR_NOFICKTB0                       *((volatile unsigned int*)(0x42308D54UL))
#define bM4_TMR62_FCONR_NOFICKTB1                       *((volatile unsigned int*)(0x42308D58UL))
#define bM4_TMR62_VPERR_SPPERIA                         *((volatile unsigned int*)(0x42308DA0UL))
#define bM4_TMR62_VPERR_SPPERIB                         *((volatile unsigned int*)(0x42308DA4UL))
#define bM4_TMR62_VPERR_PCNTE0                          *((volatile unsigned int*)(0x42308DC0UL))
#define bM4_TMR62_VPERR_PCNTE1                          *((volatile unsigned int*)(0x42308DC4UL))
#define bM4_TMR62_VPERR_PCNTS0                          *((volatile unsigned int*)(0x42308DC8UL))
#define bM4_TMR62_VPERR_PCNTS1                          *((volatile unsigned int*)(0x42308DCCUL))
#define bM4_TMR62_VPERR_PCNTS2                          *((volatile unsigned int*)(0x42308DD0UL))
#define bM4_TMR62_STFLR_CMAF                            *((volatile unsigned int*)(0x42308E00UL))
#define bM4_TMR62_STFLR_CMBF                            *((volatile unsigned int*)(0x42308E04UL))
#define bM4_TMR62_STFLR_CMCF                            *((volatile unsigned int*)(0x42308E08UL))
#define bM4_TMR62_STFLR_CMDF                            *((volatile unsigned int*)(0x42308E0CUL))
#define bM4_TMR62_STFLR_CMEF                            *((volatile unsigned int*)(0x42308E10UL))
#define bM4_TMR62_STFLR_CMFF                            *((volatile unsigned int*)(0x42308E14UL))
#define bM4_TMR62_STFLR_OVFF                            *((volatile unsigned int*)(0x42308E18UL))
#define bM4_TMR62_STFLR_UDFF                            *((volatile unsigned int*)(0x42308E1CUL))
#define bM4_TMR62_STFLR_DTEF                            *((volatile unsigned int*)(0x42308E20UL))
#define bM4_TMR62_STFLR_CMSAUF                          *((volatile unsigned int*)(0x42308E24UL))
#define bM4_TMR62_STFLR_CMSADF                          *((volatile unsigned int*)(0x42308E28UL))
#define bM4_TMR62_STFLR_CMSBUF                          *((volatile unsigned int*)(0x42308E2CUL))
#define bM4_TMR62_STFLR_CMSBDF                          *((volatile unsigned int*)(0x42308E30UL))
#define bM4_TMR62_STFLR_VPERNUM0                        *((volatile unsigned int*)(0x42308E54UL))
#define bM4_TMR62_STFLR_VPERNUM1                        *((volatile unsigned int*)(0x42308E58UL))
#define bM4_TMR62_STFLR_VPERNUM2                        *((volatile unsigned int*)(0x42308E5CUL))
#define bM4_TMR62_STFLR_DIRF                            *((volatile unsigned int*)(0x42308E7CUL))
#define bM4_TMR62_HSTAR_HSTA0                           *((volatile unsigned int*)(0x42308E80UL))
#define bM4_TMR62_HSTAR_HSTA1                           *((volatile unsigned int*)(0x42308E84UL))
#define bM4_TMR62_HSTAR_HSTA4                           *((volatile unsigned int*)(0x42308E90UL))
#define bM4_TMR62_HSTAR_HSTA5                           *((volatile unsigned int*)(0x42308E94UL))
#define bM4_TMR62_HSTAR_HSTA6                           *((volatile unsigned int*)(0x42308E98UL))
