CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_TMRA1_CMPAR7_CMP11                          *((volatile unsigned int*)(0x422A0B2CUL))
#define bM4_TMRA1_CMPAR7_CMP12                          *((volatile unsigned int*)(0x422A0B30UL))
#define bM4_TMRA1_CMPAR7_CMP13                          *((volatile unsigned int*)(0x422A0B34UL))
#define bM4_TMRA1_CMPAR7_CMP14                          *((volatile unsigned int*)(0x422A0B38UL))
#define bM4_TMRA1_CMPAR7_CMP15                          *((volatile unsigned int*)(0x422A0B3CUL))
#define bM4_TMRA1_CMPAR8_CMP0                           *((volatile unsigned int*)(0x422A0B80UL))
#define bM4_TMRA1_CMPAR8_CMP1                           *((volatile unsigned int*)(0x422A0B84UL))
#define bM4_TMRA1_CMPAR8_CMP2                           *((volatile unsigned int*)(0x422A0B88UL))
#define bM4_TMRA1_CMPAR8_CMP3                           *((volatile unsigned int*)(0x422A0B8CUL))
#define bM4_TMRA1_CMPAR8_CMP4                           *((volatile unsigned int*)(0x422A0B90UL))
#define bM4_TMRA1_CMPAR8_CMP5                           *((volatile unsigned int*)(0x422A0B94UL))
#define bM4_TMRA1_CMPAR8_CMP6                           *((volatile unsigned int*)(0x422A0B98UL))
#define bM4_TMRA1_CMPAR8_CMP7                           *((volatile unsigned int*)(0x422A0B9CUL))
#define bM4_TMRA1_CMPAR8_CMP8                           *((volatile unsigned int*)(0x422A0BA0UL))
#define bM4_TMRA1_CMPAR8_CMP9                           *((volatile unsigned int*)(0x422A0BA4UL))
#define bM4_TMRA1_CMPAR8_CMP10                          *((volatile unsigned int*)(0x422A0BA8UL))
#define bM4_TMRA1_CMPAR8_CMP11                          *((volatile unsigned int*)(0x422A0BACUL))
#define bM4_TMRA1_CMPAR8_CMP12                          *((volatile unsigned int*)(0x422A0BB0UL))
#define bM4_TMRA1_CMPAR8_CMP13                          *((volatile unsigned int*)(0x422A0BB4UL))
#define bM4_TMRA1_CMPAR8_CMP14                          *((volatile unsigned int*)(0x422A0BB8UL))
#define bM4_TMRA1_CMPAR8_CMP15                          *((volatile unsigned int*)(0x422A0BBCUL))
#define bM4_TMRA1_BCSTR_START                           *((volatile unsigned int*)(0x422A1000UL))
#define bM4_TMRA1_BCSTR_DIR                             *((volatile unsigned int*)(0x422A1004UL))
#define bM4_TMRA1_BCSTR_MODE                            *((volatile unsigned int*)(0x422A1008UL))
#define bM4_TMRA1_BCSTR_SYNST                           *((volatile unsigned int*)(0x422A100CUL))
#define bM4_TMRA1_BCSTR_CKDIV0                          *((volatile unsigned int*)(0x422A1010UL))
#define bM4_TMRA1_BCSTR_CKDIV1                          *((volatile unsigned int*)(0x422A1014UL))
#define bM4_TMRA1_BCSTR_CKDIV2                          *((volatile unsigned int*)(0x422A1018UL))
#define bM4_TMRA1_BCSTR_CKDIV3                          *((volatile unsigned int*)(0x422A101CUL))
#define bM4_TMRA1_BCSTR_ITENOVF                         *((volatile unsigned int*)(0x422A1030UL))
#define bM4_TMRA1_BCSTR_ITENUDF                         *((volatile unsigned int*)(0x422A1034UL))
#define bM4_TMRA1_BCSTR_OVFF                            *((volatile unsigned int*)(0x422A1038UL))
#define bM4_TMRA1_BCSTR_UDFF                            *((volatile unsigned int*)(0x422A103CUL))
#define bM4_TMRA1_HCONR_HSTA0                           *((volatile unsigned int*)(0x422A1080UL))
#define bM4_TMRA1_HCONR_HSTA1                           *((volatile unsigned int*)(0x422A1084UL))
#define bM4_TMRA1_HCONR_HSTA2                           *((volatile unsigned int*)(0x422A1088UL))
#define bM4_TMRA1_HCONR_HSTP0                           *((volatile unsigned int*)(0x422A1090UL))
#define bM4_TMRA1_HCONR_HSTP1                           *((volatile unsigned int*)(0x422A1094UL))
#define bM4_TMRA1_HCONR_HSTP2                           *((volatile unsigned int*)(0x422A1098UL))
#define bM4_TMRA1_HCONR_HCLE0                           *((volatile unsigned int*)(0x422A10A0UL))
#define bM4_TMRA1_HCONR_HCLE1                           *((volatile unsigned int*)(0x422A10A4UL))
#define bM4_TMRA1_HCONR_HCLE2                           *((volatile unsigned int*)(0x422A10A8UL))
#define bM4_TMRA1_HCONR_HCLE3                           *((volatile unsigned int*)(0x422A10B0UL))
#define bM4_TMRA1_HCONR_HCLE4                           *((volatile unsigned int*)(0x422A10B4UL))
#define bM4_TMRA1_HCONR_HCLE5                           *((volatile unsigned int*)(0x422A10B8UL))
#define bM4_TMRA1_HCONR_HCLE6                           *((volatile unsigned int*)(0x422A10BCUL))
#define bM4_TMRA1_HCUPR_HCUP0                           *((volatile unsigned int*)(0x422A1100UL))
#define bM4_TMRA1_HCUPR_HCUP1                           *((volatile unsigned int*)(0x422A1104UL))
#define bM4_TMRA1_HCUPR_HCUP2                           *((volatile unsigned int*)(0x422A1108UL))
#define bM4_TMRA1_HCUPR_HCUP3                           *((volatile unsigned int*)(0x422A110CUL))
#define bM4_TMRA1_HCUPR_HCUP4                           *((volatile unsigned int*)(0x422A1110UL))
#define bM4_TMRA1_HCUPR_HCUP5                           *((volatile unsigned int*)(0x422A1114UL))
#define bM4_TMRA1_HCUPR_HCUP6                           *((volatile unsigned int*)(0x422A1118UL))
#define bM4_TMRA1_HCUPR_HCUP7                           *((volatile unsigned int*)(0x422A111CUL))
#define bM4_TMRA1_HCUPR_HCUP8                           *((volatile unsigned int*)(0x422A1120UL))
#define bM4_TMRA1_HCUPR_HCUP9                           *((volatile unsigned int*)(0x422A1124UL))
#define bM4_TMRA1_HCUPR_HCUP10                          *((volatile unsigned int*)(0x422A1128UL))
#define bM4_TMRA1_HCUPR_HCUP11                          *((volatile unsigned int*)(0x422A112CUL))
#define bM4_TMRA1_HCUPR_HCUP12                          *((volatile unsigned int*)(0x422A1130UL))
#define bM4_TMRA1_HCDOR_HCDO0                           *((volatile unsigned int*)(0x422A1180UL))
#define bM4_TMRA1_HCDOR_HCDO1                           *((volatile unsigned int*)(0x422A1184UL))
#define bM4_TMRA1_HCDOR_HCDO2                           *((volatile unsigned int*)(0x422A1188UL))
#define bM4_TMRA1_HCDOR_HCDO3                           *((volatile unsigned int*)(0x422A118CUL))
#define bM4_TMRA1_HCDOR_HCDO4                           *((volatile unsigned int*)(0x422A1190UL))
#define bM4_TMRA1_HCDOR_HCDO5                           *((volatile unsigned int*)(0x422A1194UL))
#define bM4_TMRA1_HCDOR_HCDO6                           *((volatile unsigned int*)(0x422A1198UL))
#define bM4_TMRA1_HCDOR_HCDO7                           *((volatile unsigned int*)(0x422A119CUL))
#define bM4_TMRA1_HCDOR_HCDO8                           *((volatile unsigned int*)(0x422A11A0UL))
#define bM4_TMRA1_HCDOR_HCDO9                           *((volatile unsigned int*)(0x422A11A4UL))
#define bM4_TMRA1_HCDOR_HCDO10                          *((volatile unsigned int*)(0x422A11A8UL))
#define bM4_TMRA1_HCDOR_HCDO11                          *((volatile unsigned int*)(0x422A11ACUL))
#define bM4_TMRA1_HCDOR_HCDO12                          *((volatile unsigned int*)(0x422A11B0UL))
#define bM4_TMRA1_ICONR_ITEN1                           *((volatile unsigned int*)(0x422A1200UL))
#define bM4_TMRA1_ICONR_ITEN2                           *((volatile unsigned int*)(0x422A1204UL))
#define bM4_TMRA1_ICONR_ITEN3                           *((volatile unsigned int*)(0x422A1208UL))
#define bM4_TMRA1_ICONR_ITEN4                           *((volatile unsigned int*)(0x422A120CUL))
#define bM4_TMRA1_ICONR_ITEN5                           *((volatile unsigned int*)(0x422A1210UL))
#define bM4_TMRA1_ICONR_ITEN6                           *((volatile unsigned int*)(0x422A1214UL))
#define bM4_TMRA1_ICONR_ITEN7                           *((volatile unsigned int*)(0x422A1218UL))
#define bM4_TMRA1_ICONR_ITEN8                           *((volatile unsigned int*)(0x422A121CUL))
#define bM4_TMRA1_ECONR_ETEN1                           *((volatile unsigned int*)(0x422A1280UL))
#define bM4_TMRA1_ECONR_ETEN2                           *((volatile unsigned int*)(0x422A1284UL))
#define bM4_TMRA1_ECONR_ETEN3                           *((volatile unsigned int*)(0x422A1288UL))
#define bM4_TMRA1_ECONR_ETEN4                           *((volatile unsigned int*)(0x422A128CUL))
#define bM4_TMRA1_ECONR_ETEN5                           *((volatile unsigned int*)(0x422A1290UL))
#define bM4_TMRA1_ECONR_ETEN6                           *((volatile unsigned int*)(0x422A1294UL))
#define bM4_TMRA1_ECONR_ETEN7                           *((volatile unsigned int*)(0x422A1298UL))
#define bM4_TMRA1_ECONR_ETEN8                           *((volatile unsigned int*)(0x422A129CUL))
#define bM4_TMRA1_FCONR_NOFIENTG                        *((volatile unsigned int*)(0x422A1300UL))
#define bM4_TMRA1_FCONR_NOFICKTG0                       *((volatile unsigned int*)(0x422A1304UL))
#define bM4_TMRA1_FCONR_NOFICKTG1                       *((volatile unsigned int*)(0x422A1308UL))
#define bM4_TMRA1_FCONR_NOFIENCA                        *((volatile unsigned int*)(0x422A1320UL))
#define bM4_TMRA1_FCONR_NOFICKCA0                       *((volatile unsigned int*)(0x422A1324UL))
#define bM4_TMRA1_FCONR_NOFICKCA1                       *((volatile unsigned int*)(0x422A1328UL))
#define bM4_TMRA1_FCONR_NOFIENCB                        *((volatile unsigned int*)(0x422A1330UL))
#define bM4_TMRA1_FCONR_NOFICKCB0                       *((volatile unsigned int*)(0x422A1334UL))
#define bM4_TMRA1_FCONR_NOFICKCB1                       *((volatile unsigned int*)(0x422A1338UL))
#define bM4_TMRA1_STFLR_CMPF1                           *((volatile unsigned int*)(0x422A1380UL))
#define bM4_TMRA1_STFLR_CMPF2                           *((volatile unsigned int*)(0x422A1384UL))
#define bM4_TMRA1_STFLR_CMPF3                           *((volatile unsigned int*)(0x422A1388UL))
#define bM4_TMRA1_STFLR_CMPF4                           *((volatile unsigned int*)(0x422A138CUL))
#define bM4_TMRA1_STFLR_CMPF5                           *((volatile unsigned int*)(0x422A1390UL))
#define bM4_TMRA1_STFLR_CMPF6                           *((volatile unsigned int*)(0x422A1394UL))
#define bM4_TMRA1_STFLR_CMPF7                           *((volatile unsigned int*)(0x422A1398UL))
#define bM4_TMRA1_STFLR_CMPF8                           *((volatile unsigned int*)(0x422A139CUL))
#define bM4_TMRA1_BCONR1_BEN                            *((volatile unsigned int*)(0x422A1800UL))
#define bM4_TMRA1_BCONR1_BSE0                           *((volatile unsigned int*)(0x422A1804UL))
#define bM4_TMRA1_BCONR1_BSE1                           *((volatile unsigned int*)(0x422A1808UL))
#define bM4_TMRA1_BCONR2_BEN                            *((volatile unsigned int*)(0x422A1900UL))
#define bM4_TMRA1_BCONR2_BSE0                           *((volatile unsigned int*)(0x422A1904UL))
#define bM4_TMRA1_BCONR2_BSE1                           *((volatile unsigned int*)(0x422A1908UL))
#define bM4_TMRA1_BCONR3_BEN                            *((volatile unsigned int*)(0x422A1A00UL))
#define bM4_TMRA1_BCONR3_BSE0                           *((volatile unsigned int*)(0x422A1A04UL))
#define bM4_TMRA1_BCONR3_BSE1                           *((volatile unsigned int*)(0x422A1A08UL))
#define bM4_TMRA1_BCONR4_BEN                            *((volatile unsigned int*)(0x422A1B00UL))
#define bM4_TMRA1_BCONR4_BSE0                           *((volatile unsigned int*)(0x422A1B04UL))
#define bM4_TMRA1_BCONR4_BSE1                           *((volatile unsigned int*)(0x422A1B08UL))
#define bM4_TMRA1_CCONR1_CAPMDA                         *((volatile unsigned int*)(0x422A2000UL))
#define bM4_TMRA1_CCONR1_HICP0                          *((volatile unsigned int*)(0x422A2010UL))
#define bM4_TMRA1_CCONR1_HICP1                          *((volatile unsigned int*)(0x422A2014UL))
#define bM4_TMRA1_CCONR1_HICP2                          *((volatile unsigned int*)(0x422A2018UL))
#define bM4_TMRA1_CCONR1_HICP3                          *((volatile unsigned int*)(0x422A2020UL))
#define bM4_TMRA1_CCONR1_HICP4                          *((volatile unsigned int*)(0x422A2024UL))
#define bM4_TMRA1_CCONR1_NOFIENCP                       *((volatile unsigned int*)(0x422A2030UL))
#define bM4_TMRA1_CCONR1_NOFICKCP0                      *((volatile unsigned int*)(0x422A2034UL))
#define bM4_TMRA1_CCONR1_NOFICKCP1                      *((volatile unsigned int*)(0x422A2038UL))
#define bM4_TMRA1_CCONR2_CAPMDA                         *((volatile unsigned int*)(0x422A2080UL))
#define bM4_TMRA1_CCONR2_HICP0                          *((volatile unsigned int*)(0x422A2090UL))
#define bM4_TMRA1_CCONR2_HICP1                          *((volatile unsigned int*)(0x422A2094UL))
#define bM4_TMRA1_CCONR2_HICP2                          *((volatile unsigned int*)(0x422A2098UL))
#define bM4_TMRA1_CCONR2_HICP3                          *((volatile unsigned int*)(0x422A20A0UL))
#define bM4_TMRA1_CCONR2_HICP4                          *((volatile unsigned int*)(0x422A20A4UL))
#define bM4_TMRA1_CCONR2_NOFIENCP                       *((volatile unsigned int*)(0x422A20B0UL))
#define bM4_TMRA1_CCONR2_NOFICKCP0                      *((volatile unsigned int*)(0x422A20B4UL))
#define bM4_TMRA1_CCONR2_NOFICKCP1                      *((volatile unsigned int*)(0x422A20B8UL))
#define bM4_TMRA1_CCONR3_CAPMDA                         *((volatile unsigned int*)(0x422A2100UL))
#define bM4_TMRA1_CCONR3_HICP0                          *((volatile unsigned int*)(0x422A2110UL))
#define bM4_TMRA1_CCONR3_HICP1                          *((volatile unsigned int*)(0x422A2114UL))
#define bM4_TMRA1_CCONR3_HICP2                          *((volatile unsigned int*)(0x422A2118UL))
#define bM4_TMRA1_CCONR3_HICP3                          *((volatile unsigned int*)(0x422A2120UL))
#define bM4_TMRA1_CCONR3_HICP4                          *((volatile unsigned int*)(0x422A2124UL))
#define bM4_TMRA1_CCONR3_NOFIENCP                       *((volatile unsigned int*)(0x422A2130UL))
#define bM4_TMRA1_CCONR3_NOFICKCP0                      *((volatile unsigned int*)(0x422A2134UL))
#define bM4_TMRA1_CCONR3_NOFICKCP1                      *((volatile unsigned int*)(0x422A2138UL))
#define bM4_TMRA1_CCONR4_CAPMDA                         *((volatile unsigned int*)(0x422A2180UL))
#define bM4_TMRA1_CCONR4_HICP0                          *((volatile unsigned int*)(0x422A2190UL))
#define bM4_TMRA1_CCONR4_HICP1                          *((volatile unsigned int*)(0x422A2194UL))
#define bM4_TMRA1_CCONR4_HICP2                          *((volatile unsigned int*)(0x422A2198UL))
#define bM4_TMRA1_CCONR4_HICP3                          *((volatile unsigned int*)(0x422A21A0UL))
#define bM4_TMRA1_CCONR4_HICP4                          *((volatile unsigned int*)(0x422A21A4UL))
#define bM4_TMRA1_CCONR4_NOFIENCP                       *((volatile unsigned int*)(0x422A21B0UL))
#define bM4_TMRA1_CCONR4_NOFICKCP0                      *((volatile unsigned int*)(0x422A21B4UL))
#define bM4_TMRA1_CCONR4_NOFICKCP1                      *((volatile unsigned int*)(0x422A21B8UL))
#define bM4_TMRA1_CCONR5_CAPMDA                         *((volatile unsigned int*)(0x422A2200UL))
#define bM4_TMRA1_CCONR5_HICP0                          *((volatile unsigned int*)(0x422A2210UL))
#define bM4_TMRA1_CCONR5_HICP1                          *((volatile unsigned int*)(0x422A2214UL))
#define bM4_TMRA1_CCONR5_HICP2                          *((volatile unsigned int*)(0x422A2218UL))
#define bM4_TMRA1_CCONR5_HICP3                          *((volatile unsigned int*)(0x422A2220UL))
#define bM4_TMRA1_CCONR5_HICP4                          *((volatile unsigned int*)(0x422A2224UL))
#define bM4_TMRA1_CCONR5_NOFIENCP                       *((volatile unsigned int*)(0x422A2230UL))
#define bM4_TMRA1_CCONR5_NOFICKCP0                      *((volatile unsigned int*)(0x422A2234UL))
#define bM4_TMRA1_CCONR5_NOFICKCP1                      *((volatile unsigned int*)(0x422A2238UL))
#define bM4_TMRA1_CCONR6_CAPMDA                         *((volatile unsigned int*)(0x422A2280UL))
#define bM4_TMRA1_CCONR6_HICP0                          *((volatile unsigned int*)(0x422A2290UL))
#define bM4_TMRA1_CCONR6_HICP1                          *((volatile unsigned int*)(0x422A2294UL))
#define bM4_TMRA1_CCONR6_HICP2                          *((volatile unsigned int*)(0x422A2298UL))
#define bM4_TMRA1_CCONR6_HICP3                          *((volatile unsigned int*)(0x422A22A0UL))
#define bM4_TMRA1_CCONR6_HICP4                          *((volatile unsigned int*)(0x422A22A4UL))
#define bM4_TMRA1_CCONR6_NOFIENCP                       *((volatile unsigned int*)(0x422A22B0UL))
#define bM4_TMRA1_CCONR6_NOFICKCP0                      *((volatile unsigned int*)(0x422A22B4UL))
#define bM4_TMRA1_CCONR6_NOFICKCP1                      *((volatile unsigned int*)(0x422A22B8UL))
#define bM4_TMRA1_CCONR7_CAPMDA                         *((volatile unsigned int*)(0x422A2300UL))
#define bM4_TMRA1_CCONR7_HICP0                          *((volatile unsigned int*)(0x422A2310UL))
#define bM4_TMRA1_CCONR7_HICP1                          *((volatile unsigned int*)(0x422A2314UL))
#define bM4_TMRA1_CCONR7_HICP2                          *((volatile unsigned int*)(0x422A2318UL))
#define bM4_TMRA1_CCONR7_HICP3                          *((volatile unsigned int*)(0x422A2320UL))
#define bM4_TMRA1_CCONR7_HICP4                          *((volatile unsigned int*)(0x422A2324UL))
#define bM4_TMRA1_CCONR7_NOFIENCP                       *((volatile unsigned int*)(0x422A2330UL))
#define bM4_TMRA1_CCONR7_NOFICKCP0                      *((volatile unsigned int*)(0x422A2334UL))
#define bM4_TMRA1_CCONR7_NOFICKCP1                      *((volatile unsigned int*)(0x422A2338UL))
#define bM4_TMRA1_CCONR8_CAPMDA                         *((volatile unsigned int*)(0x422A2380UL))
#define bM4_TMRA1_CCONR8_HICP0                          *((volatile unsigned int*)(0x422A2390UL))
#define bM4_TMRA1_CCONR8_HICP1                          *((volatile unsigned int*)(0x422A2394UL))
#define bM4_TMRA1_CCONR8_HICP2                          *((volatile unsigned int*)(0x422A2398UL))
#define bM4_TMRA1_CCONR8_HICP3                          *((volatile unsigned int*)(0x422A23A0UL))
#define bM4_TMRA1_CCONR8_HICP4                          *((volatile unsigned int*)(0x422A23A4UL))
#define bM4_TMRA1_CCONR8_NOFIENCP                       *((volatile unsigned int*)(0x422A23B0UL))
#define bM4_TMRA1_CCONR8_NOFICKCP0                      *((volatile unsigned int*)(0x422A23B4UL))
#define bM4_TMRA1_CCONR8_NOFICKCP1                      *((volatile unsigned int*)(0x422A23B8UL))
#define bM4_TMRA1_PCONR1_STAC0                          *((volatile unsigned int*)(0x422A2800UL))
#define bM4_TMRA1_PCONR1_STAC1                          *((volatile unsigned int*)(0x422A2804UL))
#define bM4_TMRA1_PCONR1_STPC0                          *((volatile unsigned int*)(0x422A2808UL))
#define bM4_TMRA1_PCONR1_STPC1                          *((volatile unsigned int*)(0x422A280CUL))
#define bM4_TMRA1_PCONR1_CMPC0                          *((volatile unsigned int*)(0x422A2810UL))
#define bM4_TMRA1_PCONR1_CMPC1                          *((volatile unsigned int*)(0x422A2814UL))
#define bM4_TMRA1_PCONR1_PERC0                          *((volatile unsigned int*)(0x422A2818UL))
#define bM4_TMRA1_PCONR1_PERC1                          *((volatile unsigned int*)(0x422A281CUL))
#define bM4_TMRA1_PCONR1_FORC0                          *((volatile unsigned int*)(0x422A2820UL))
#define bM4_TMRA1_PCONR1_FORC1                          *((volatile unsigned int*)(0x422A2824UL))
#define bM4_TMRA1_PCONR1_OUTEN                          *((volatile unsigned int*)(0x422A2830UL))
#define bM4_TMRA1_PCONR2_STAC0                          *((volatile unsigned int*)(0x422A2880UL))
#define bM4_TMRA1_PCONR2_STAC1                          *((volatile unsigned int*)(0x422A2884UL))
#define bM4_TMRA1_PCONR2_STPC0                          *((volatile unsigned int*)(0x422A2888UL))
#define bM4_TMRA1_PCONR2_STPC1                          *((volatile unsigned int*)(0x422A288CUL))
#define bM4_TMRA1_PCONR2_CMPC0                          *((volatile unsigned int*)(0x422A2890UL))
#define bM4_TMRA1_PCONR2_CMPC1                          *((volatile unsigned int*)(0x422A2894UL))
#define bM4_TMRA1_PCONR2_PERC0                          *((volatile unsigned int*)(0x422A2898UL))
#define bM4_TMRA1_PCONR2_PERC1                          *((volatile unsigned int*)(0x422A289CUL))
#define bM4_TMRA1_PCONR2_FORC0                          *((volatile unsigned int*)(0x422A28A0UL))
#define bM4_TMRA1_PCONR2_FORC1                          *((volatile unsigned int*)(0x422A28A4UL))
#define bM4_TMRA1_PCONR2_OUTEN                          *((volatile unsigned int*)(0x422A28B0UL))
#define bM4_TMRA1_PCONR3_STAC0                          *((volatile unsigned int*)(0x422A2900UL))
#define bM4_TMRA1_PCONR3_STAC1                          *((volatile unsigned int*)(0x422A2904UL))
#define bM4_TMRA1_PCONR3_STPC0                          *((volatile unsigned int*)(0x422A2908UL))
#define bM4_TMRA1_PCONR3_STPC1                          *((volatile unsigned int*)(0x422A290CUL))
#define bM4_TMRA1_PCONR3_CMPC0                          *((volatile unsigned int*)(0x422A2910UL))
#define bM4_TMRA1_PCONR3_CMPC1                          *((volatile unsigned int*)(0x422A2914UL))
#define bM4_TMRA1_PCONR3_PERC0                          *((volatile unsigned int*)(0x422A2918UL))
#define bM4_TMRA1_PCONR3_PERC1                          *((volatile unsigned int*)(0x422A291CUL))
#define bM4_TMRA1_PCONR3_FORC0                          *((volatile unsigned int*)(0x422A2920UL))
#define bM4_TMRA1_PCONR3_FORC1                          *((volatile unsigned int*)(0x422A2924UL))
#define bM4_TMRA1_PCONR3_OUTEN                          *((volatile unsigned int*)(0x422A2930UL))
#define bM4_TMRA1_PCONR4_STAC0                          *((volatile unsigned int*)(0x422A2980UL))
#define bM4_TMRA1_PCONR4_STAC1                          *((volatile unsigned int*)(0x422A2984UL))
#define bM4_TMRA1_PCONR4_STPC0                          *((volatile unsigned int*)(0x422A2988UL))
#define bM4_TMRA1_PCONR4_STPC1                          *((volatile unsigned int*)(0x422A298CUL))
#define bM4_TMRA1_PCONR4_CMPC0                          *((volatile unsigned int*)(0x422A2990UL))
#define bM4_TMRA1_PCONR4_CMPC1                          *((volatile unsigned int*)(0x422A2994UL))
#define bM4_TMRA1_PCONR4_PERC0                          *((volatile unsigned int*)(0x422A2998UL))
#define bM4_TMRA1_PCONR4_PERC1                          *((volatile unsigned int*)(0x422A299CUL))
#define bM4_TMRA1_PCONR4_FORC0                          *((volatile unsigned int*)(0x422A29A0UL))
#define bM4_TMRA1_PCONR4_FORC1                          *((volatile unsigned int*)(0x422A29A4UL))
#define bM4_TMRA1_PCONR4_OUTEN                          *((volatile unsigned int*)(0x422A29B0UL))
#define bM4_TMRA1_PCONR5_STAC0                          *((volatile unsigned int*)(0x422A2A00UL))
#define bM4_TMRA1_PCONR5_STAC1                          *((volatile unsigned int*)(0x422A2A04UL))
#define bM4_TMRA1_PCONR5_STPC0                          *((volatile unsigned int*)(0x422A2A08UL))
#define bM4_TMRA1_PCONR5_STPC1                          *((volatile unsigned int*)(0x422A2A0CUL))
#define bM4_TMRA1_PCONR5_CMPC0                          *((volatile unsigned int*)(0x422A2A10UL))
#define bM4_TMRA1_PCONR5_CMPC1                          *((volatile unsigned int*)(0x422A2A14UL))
#define bM4_TMRA1_PCONR5_PERC0                          *((volatile unsigned int*)(0x422A2A18UL))
#define bM4_TMRA1_PCONR5_PERC1                          *((volatile unsigned int*)(0x422A2A1CUL))
#define bM4_TMRA1_PCONR5_FORC0                          *((volatile unsigned int*)(0x422A2A20UL))
#define bM4_TMRA1_PCONR5_FORC1                          *((volatile unsigned int*)(0x422A2A24UL))
#define bM4_TMRA1_PCONR5_OUTEN                          *((volatile unsigned int*)(0x422A2A30UL))
