CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_TMRA2_ICONR_ITEN1                           *((volatile unsigned int*)(0x422A9200UL))
#define bM4_TMRA2_ICONR_ITEN2                           *((volatile unsigned int*)(0x422A9204UL))
#define bM4_TMRA2_ICONR_ITEN3                           *((volatile unsigned int*)(0x422A9208UL))
#define bM4_TMRA2_ICONR_ITEN4                           *((volatile unsigned int*)(0x422A920CUL))
#define bM4_TMRA2_ICONR_ITEN5                           *((volatile unsigned int*)(0x422A9210UL))
#define bM4_TMRA2_ICONR_ITEN6                           *((volatile unsigned int*)(0x422A9214UL))
#define bM4_TMRA2_ICONR_ITEN7                           *((volatile unsigned int*)(0x422A9218UL))
#define bM4_TMRA2_ICONR_ITEN8                           *((volatile unsigned int*)(0x422A921CUL))
#define bM4_TMRA2_ECONR_ETEN1                           *((volatile unsigned int*)(0x422A9280UL))
#define bM4_TMRA2_ECONR_ETEN2                           *((volatile unsigned int*)(0x422A9284UL))
#define bM4_TMRA2_ECONR_ETEN3                           *((volatile unsigned int*)(0x422A9288UL))
#define bM4_TMRA2_ECONR_ETEN4                           *((volatile unsigned int*)(0x422A928CUL))
#define bM4_TMRA2_ECONR_ETEN5                           *((volatile unsigned int*)(0x422A9290UL))
#define bM4_TMRA2_ECONR_ETEN6                           *((volatile unsigned int*)(0x422A9294UL))
#define bM4_TMRA2_ECONR_ETEN7                           *((volatile unsigned int*)(0x422A9298UL))
#define bM4_TMRA2_ECONR_ETEN8                           *((volatile unsigned int*)(0x422A929CUL))
#define bM4_TMRA2_FCONR_NOFIENTG                        *((volatile unsigned int*)(0x422A9300UL))
#define bM4_TMRA2_FCONR_NOFICKTG0                       *((volatile unsigned int*)(0x422A9304UL))
#define bM4_TMRA2_FCONR_NOFICKTG1                       *((volatile unsigned int*)(0x422A9308UL))
#define bM4_TMRA2_FCONR_NOFIENCA                        *((volatile unsigned int*)(0x422A9320UL))
#define bM4_TMRA2_FCONR_NOFICKCA0                       *((volatile unsigned int*)(0x422A9324UL))
#define bM4_TMRA2_FCONR_NOFICKCA1                       *((volatile unsigned int*)(0x422A9328UL))
#define bM4_TMRA2_FCONR_NOFIENCB                        *((volatile unsigned int*)(0x422A9330UL))
#define bM4_TMRA2_FCONR_NOFICKCB0                       *((volatile unsigned int*)(0x422A9334UL))
#define bM4_TMRA2_FCONR_NOFICKCB1                       *((volatile unsigned int*)(0x422A9338UL))
#define bM4_TMRA2_STFLR_CMPF1                           *((volatile unsigned int*)(0x422A9380UL))
#define bM4_TMRA2_STFLR_CMPF2                           *((volatile unsigned int*)(0x422A9384UL))
#define bM4_TMRA2_STFLR_CMPF3                           *((volatile unsigned int*)(0x422A9388UL))
#define bM4_TMRA2_STFLR_CMPF4                           *((volatile unsigned int*)(0x422A938CUL))
#define bM4_TMRA2_STFLR_CMPF5                           *((volatile unsigned int*)(0x422A9390UL))
#define bM4_TMRA2_STFLR_CMPF6                           *((volatile unsigned int*)(0x422A9394UL))
#define bM4_TMRA2_STFLR_CMPF7                           *((volatile unsigned int*)(0x422A9398UL))
#define bM4_TMRA2_STFLR_CMPF8                           *((volatile unsigned int*)(0x422A939CUL))
#define bM4_TMRA2_BCONR1_BEN                            *((volatile unsigned int*)(0x422A9800UL))
#define bM4_TMRA2_BCONR1_BSE0                           *((volatile unsigned int*)(0x422A9804UL))
#define bM4_TMRA2_BCONR1_BSE1                           *((volatile unsigned int*)(0x422A9808UL))
#define bM4_TMRA2_BCONR2_BEN                            *((volatile unsigned int*)(0x422A9900UL))
#define bM4_TMRA2_BCONR2_BSE0                           *((volatile unsigned int*)(0x422A9904UL))
#define bM4_TMRA2_BCONR2_BSE1                           *((volatile unsigned int*)(0x422A9908UL))
#define bM4_TMRA2_BCONR3_BEN                            *((volatile unsigned int*)(0x422A9A00UL))
#define bM4_TMRA2_BCONR3_BSE0                           *((volatile unsigned int*)(0x422A9A04UL))
#define bM4_TMRA2_BCONR3_BSE1                           *((volatile unsigned int*)(0x422A9A08UL))
#define bM4_TMRA2_BCONR4_BEN                            *((volatile unsigned int*)(0x422A9B00UL))
#define bM4_TMRA2_BCONR4_BSE0                           *((volatile unsigned int*)(0x422A9B04UL))
#define bM4_TMRA2_BCONR4_BSE1                           *((volatile unsigned int*)(0x422A9B08UL))
#define bM4_TMRA2_CCONR1_CAPMDA                         *((volatile unsigned int*)(0x422AA000UL))
#define bM4_TMRA2_CCONR1_HICP0                          *((volatile unsigned int*)(0x422AA010UL))
#define bM4_TMRA2_CCONR1_HICP1                          *((volatile unsigned int*)(0x422AA014UL))
#define bM4_TMRA2_CCONR1_HICP2                          *((volatile unsigned int*)(0x422AA018UL))
#define bM4_TMRA2_CCONR1_HICP3                          *((volatile unsigned int*)(0x422AA020UL))
#define bM4_TMRA2_CCONR1_HICP4                          *((volatile unsigned int*)(0x422AA024UL))
#define bM4_TMRA2_CCONR1_NOFIENCP                       *((volatile unsigned int*)(0x422AA030UL))
#define bM4_TMRA2_CCONR1_NOFICKCP0                      *((volatile unsigned int*)(0x422AA034UL))
#define bM4_TMRA2_CCONR1_NOFICKCP1                      *((volatile unsigned int*)(0x422AA038UL))
#define bM4_TMRA2_CCONR2_CAPMDA                         *((volatile unsigned int*)(0x422AA080UL))
#define bM4_TMRA2_CCONR2_HICP0                          *((volatile unsigned int*)(0x422AA090UL))
#define bM4_TMRA2_CCONR2_HICP1                          *((volatile unsigned int*)(0x422AA094UL))
#define bM4_TMRA2_CCONR2_HICP2                          *((volatile unsigned int*)(0x422AA098UL))
#define bM4_TMRA2_CCONR2_HICP3                          *((volatile unsigned int*)(0x422AA0A0UL))
#define bM4_TMRA2_CCONR2_HICP4                          *((volatile unsigned int*)(0x422AA0A4UL))
#define bM4_TMRA2_CCONR2_NOFIENCP                       *((volatile unsigned int*)(0x422AA0B0UL))
#define bM4_TMRA2_CCONR2_NOFICKCP0                      *((volatile unsigned int*)(0x422AA0B4UL))
#define bM4_TMRA2_CCONR2_NOFICKCP1                      *((volatile unsigned int*)(0x422AA0B8UL))
#define bM4_TMRA2_CCONR3_CAPMDA                         *((volatile unsigned int*)(0x422AA100UL))
#define bM4_TMRA2_CCONR3_HICP0                          *((volatile unsigned int*)(0x422AA110UL))
#define bM4_TMRA2_CCONR3_HICP1                          *((volatile unsigned int*)(0x422AA114UL))
#define bM4_TMRA2_CCONR3_HICP2                          *((volatile unsigned int*)(0x422AA118UL))
#define bM4_TMRA2_CCONR3_HICP3                          *((volatile unsigned int*)(0x422AA120UL))
#define bM4_TMRA2_CCONR3_HICP4                          *((volatile unsigned int*)(0x422AA124UL))
#define bM4_TMRA2_CCONR3_NOFIENCP                       *((volatile unsigned int*)(0x422AA130UL))
#define bM4_TMRA2_CCONR3_NOFICKCP0                      *((volatile unsigned int*)(0x422AA134UL))
#define bM4_TMRA2_CCONR3_NOFICKCP1                      *((volatile unsigned int*)(0x422AA138UL))
#define bM4_TMRA2_CCONR4_CAPMDA                         *((volatile unsigned int*)(0x422AA180UL))
#define bM4_TMRA2_CCONR4_HICP0                          *((volatile unsigned int*)(0x422AA190UL))
#define bM4_TMRA2_CCONR4_HICP1                          *((volatile unsigned int*)(0x422AA194UL))
#define bM4_TMRA2_CCONR4_HICP2                          *((volatile unsigned int*)(0x422AA198UL))
#define bM4_TMRA2_CCONR4_HICP3                          *((volatile unsigned int*)(0x422AA1A0UL))
#define bM4_TMRA2_CCONR4_HICP4                          *((volatile unsigned int*)(0x422AA1A4UL))
#define bM4_TMRA2_CCONR4_NOFIENCP                       *((volatile unsigned int*)(0x422AA1B0UL))
#define bM4_TMRA2_CCONR4_NOFICKCP0                      *((volatile unsigned int*)(0x422AA1B4UL))
#define bM4_TMRA2_CCONR4_NOFICKCP1                      *((volatile unsigned int*)(0x422AA1B8UL))
#define bM4_TMRA2_CCONR5_CAPMDA                         *((volatile unsigned int*)(0x422AA200UL))
#define bM4_TMRA2_CCONR5_HICP0                          *((volatile unsigned int*)(0x422AA210UL))
#define bM4_TMRA2_CCONR5_HICP1                          *((volatile unsigned int*)(0x422AA214UL))
#define bM4_TMRA2_CCONR5_HICP2                          *((volatile unsigned int*)(0x422AA218UL))
#define bM4_TMRA2_CCONR5_HICP3                          *((volatile unsigned int*)(0x422AA220UL))
#define bM4_TMRA2_CCONR5_HICP4                          *((volatile unsigned int*)(0x422AA224UL))
#define bM4_TMRA2_CCONR5_NOFIENCP                       *((volatile unsigned int*)(0x422AA230UL))
#define bM4_TMRA2_CCONR5_NOFICKCP0                      *((volatile unsigned int*)(0x422AA234UL))
#define bM4_TMRA2_CCONR5_NOFICKCP1                      *((volatile unsigned int*)(0x422AA238UL))
#define bM4_TMRA2_CCONR6_CAPMDA                         *((volatile unsigned int*)(0x422AA280UL))
#define bM4_TMRA2_CCONR6_HICP0                          *((volatile unsigned int*)(0x422AA290UL))
#define bM4_TMRA2_CCONR6_HICP1                          *((volatile unsigned int*)(0x422AA294UL))
#define bM4_TMRA2_CCONR6_HICP2                          *((volatile unsigned int*)(0x422AA298UL))
#define bM4_TMRA2_CCONR6_HICP3                          *((volatile unsigned int*)(0x422AA2A0UL))
#define bM4_TMRA2_CCONR6_HICP4                          *((volatile unsigned int*)(0x422AA2A4UL))
#define bM4_TMRA2_CCONR6_NOFIENCP                       *((volatile unsigned int*)(0x422AA2B0UL))
#define bM4_TMRA2_CCONR6_NOFICKCP0                      *((volatile unsigned int*)(0x422AA2B4UL))
#define bM4_TMRA2_CCONR6_NOFICKCP1                      *((volatile unsigned int*)(0x422AA2B8UL))
#define bM4_TMRA2_CCONR7_CAPMDA                         *((volatile unsigned int*)(0x422AA300UL))
#define bM4_TMRA2_CCONR7_HICP0                          *((volatile unsigned int*)(0x422AA310UL))
#define bM4_TMRA2_CCONR7_HICP1                          *((volatile unsigned int*)(0x422AA314UL))
#define bM4_TMRA2_CCONR7_HICP2                          *((volatile unsigned int*)(0x422AA318UL))
#define bM4_TMRA2_CCONR7_HICP3                          *((volatile unsigned int*)(0x422AA320UL))
#define bM4_TMRA2_CCONR7_HICP4                          *((volatile unsigned int*)(0x422AA324UL))
#define bM4_TMRA2_CCONR7_NOFIENCP                       *((volatile unsigned int*)(0x422AA330UL))
#define bM4_TMRA2_CCONR7_NOFICKCP0                      *((volatile unsigned int*)(0x422AA334UL))
#define bM4_TMRA2_CCONR7_NOFICKCP1                      *((volatile unsigned int*)(0x422AA338UL))
#define bM4_TMRA2_CCONR8_CAPMDA                         *((volatile unsigned int*)(0x422AA380UL))
#define bM4_TMRA2_CCONR8_HICP0                          *((volatile unsigned int*)(0x422AA390UL))
#define bM4_TMRA2_CCONR8_HICP1                          *((volatile unsigned int*)(0x422AA394UL))
#define bM4_TMRA2_CCONR8_HICP2                          *((volatile unsigned int*)(0x422AA398UL))
#define bM4_TMRA2_CCONR8_HICP3                          *((volatile unsigned int*)(0x422AA3A0UL))
#define bM4_TMRA2_CCONR8_HICP4                          *((volatile unsigned int*)(0x422AA3A4UL))
#define bM4_TMRA2_CCONR8_NOFIENCP                       *((volatile unsigned int*)(0x422AA3B0UL))
#define bM4_TMRA2_CCONR8_NOFICKCP0                      *((volatile unsigned int*)(0x422AA3B4UL))
#define bM4_TMRA2_CCONR8_NOFICKCP1                      *((volatile unsigned int*)(0x422AA3B8UL))
#define bM4_TMRA2_PCONR1_STAC0                          *((volatile unsigned int*)(0x422AA800UL))
#define bM4_TMRA2_PCONR1_STAC1                          *((volatile unsigned int*)(0x422AA804UL))
#define bM4_TMRA2_PCONR1_STPC0                          *((volatile unsigned int*)(0x422AA808UL))
#define bM4_TMRA2_PCONR1_STPC1                          *((volatile unsigned int*)(0x422AA80CUL))
#define bM4_TMRA2_PCONR1_CMPC0                          *((volatile unsigned int*)(0x422AA810UL))
#define bM4_TMRA2_PCONR1_CMPC1                          *((volatile unsigned int*)(0x422AA814UL))
#define bM4_TMRA2_PCONR1_PERC0                          *((volatile unsigned int*)(0x422AA818UL))
#define bM4_TMRA2_PCONR1_PERC1                          *((volatile unsigned int*)(0x422AA81CUL))
#define bM4_TMRA2_PCONR1_FORC0                          *((volatile unsigned int*)(0x422AA820UL))
#define bM4_TMRA2_PCONR1_FORC1                          *((volatile unsigned int*)(0x422AA824UL))
#define bM4_TMRA2_PCONR1_OUTEN                          *((volatile unsigned int*)(0x422AA830UL))
#define bM4_TMRA2_PCONR2_STAC0                          *((volatile unsigned int*)(0x422AA880UL))
#define bM4_TMRA2_PCONR2_STAC1                          *((volatile unsigned int*)(0x422AA884UL))
#define bM4_TMRA2_PCONR2_STPC0                          *((volatile unsigned int*)(0x422AA888UL))
#define bM4_TMRA2_PCONR2_STPC1                          *((volatile unsigned int*)(0x422AA88CUL))
#define bM4_TMRA2_PCONR2_CMPC0                          *((volatile unsigned int*)(0x422AA890UL))
#define bM4_TMRA2_PCONR2_CMPC1                          *((volatile unsigned int*)(0x422AA894UL))
#define bM4_TMRA2_PCONR2_PERC0                          *((volatile unsigned int*)(0x422AA898UL))
#define bM4_TMRA2_PCONR2_PERC1                          *((volatile unsigned int*)(0x422AA89CUL))
#define bM4_TMRA2_PCONR2_FORC0                          *((volatile unsigned int*)(0x422AA8A0UL))
#define bM4_TMRA2_PCONR2_FORC1                          *((volatile unsigned int*)(0x422AA8A4UL))
#define bM4_TMRA2_PCONR2_OUTEN                          *((volatile unsigned int*)(0x422AA8B0UL))
#define bM4_TMRA2_PCONR3_STAC0                          *((volatile unsigned int*)(0x422AA900UL))
#define bM4_TMRA2_PCONR3_STAC1                          *((volatile unsigned int*)(0x422AA904UL))
#define bM4_TMRA2_PCONR3_STPC0                          *((volatile unsigned int*)(0x422AA908UL))
#define bM4_TMRA2_PCONR3_STPC1                          *((volatile unsigned int*)(0x422AA90CUL))
#define bM4_TMRA2_PCONR3_CMPC0                          *((volatile unsigned int*)(0x422AA910UL))
#define bM4_TMRA2_PCONR3_CMPC1                          *((volatile unsigned int*)(0x422AA914UL))
#define bM4_TMRA2_PCONR3_PERC0                          *((volatile unsigned int*)(0x422AA918UL))
#define bM4_TMRA2_PCONR3_PERC1                          *((volatile unsigned int*)(0x422AA91CUL))
#define bM4_TMRA2_PCONR3_FORC0                          *((volatile unsigned int*)(0x422AA920UL))
#define bM4_TMRA2_PCONR3_FORC1                          *((volatile unsigned int*)(0x422AA924UL))
#define bM4_TMRA2_PCONR3_OUTEN                          *((volatile unsigned int*)(0x422AA930UL))
#define bM4_TMRA2_PCONR4_STAC0                          *((volatile unsigned int*)(0x422AA980UL))
#define bM4_TMRA2_PCONR4_STAC1                          *((volatile unsigned int*)(0x422AA984UL))
#define bM4_TMRA2_PCONR4_STPC0                          *((volatile unsigned int*)(0x422AA988UL))
#define bM4_TMRA2_PCONR4_STPC1                          *((volatile unsigned int*)(0x422AA98CUL))
#define bM4_TMRA2_PCONR4_CMPC0                          *((volatile unsigned int*)(0x422AA990UL))
#define bM4_TMRA2_PCONR4_CMPC1                          *((volatile unsigned int*)(0x422AA994UL))
#define bM4_TMRA2_PCONR4_PERC0                          *((volatile unsigned int*)(0x422AA998UL))
#define bM4_TMRA2_PCONR4_PERC1                          *((volatile unsigned int*)(0x422AA99CUL))
#define bM4_TMRA2_PCONR4_FORC0                          *((volatile unsigned int*)(0x422AA9A0UL))
#define bM4_TMRA2_PCONR4_FORC1                          *((volatile unsigned int*)(0x422AA9A4UL))
#define bM4_TMRA2_PCONR4_OUTEN                          *((volatile unsigned int*)(0x422AA9B0UL))
#define bM4_TMRA2_PCONR5_STAC0                          *((volatile unsigned int*)(0x422AAA00UL))
#define bM4_TMRA2_PCONR5_STAC1                          *((volatile unsigned int*)(0x422AAA04UL))
#define bM4_TMRA2_PCONR5_STPC0                          *((volatile unsigned int*)(0x422AAA08UL))
#define bM4_TMRA2_PCONR5_STPC1                          *((volatile unsigned int*)(0x422AAA0CUL))
#define bM4_TMRA2_PCONR5_CMPC0                          *((volatile unsigned int*)(0x422AAA10UL))
#define bM4_TMRA2_PCONR5_CMPC1                          *((volatile unsigned int*)(0x422AAA14UL))
#define bM4_TMRA2_PCONR5_PERC0                          *((volatile unsigned int*)(0x422AAA18UL))
#define bM4_TMRA2_PCONR5_PERC1                          *((volatile unsigned int*)(0x422AAA1CUL))
#define bM4_TMRA2_PCONR5_FORC0                          *((volatile unsigned int*)(0x422AAA20UL))
#define bM4_TMRA2_PCONR5_FORC1                          *((volatile unsigned int*)(0x422AAA24UL))
#define bM4_TMRA2_PCONR5_OUTEN                          *((volatile unsigned int*)(0x422AAA30UL))
#define bM4_TMRA2_PCONR6_STAC0                          *((volatile unsigned int*)(0x422AAA80UL))
#define bM4_TMRA2_PCONR6_STAC1                          *((volatile unsigned int*)(0x422AAA84UL))
#define bM4_TMRA2_PCONR6_STPC0                          *((volatile unsigned int*)(0x422AAA88UL))
#define bM4_TMRA2_PCONR6_STPC1                          *((volatile unsigned int*)(0x422AAA8CUL))
#define bM4_TMRA2_PCONR6_CMPC0                          *((volatile unsigned int*)(0x422AAA90UL))
#define bM4_TMRA2_PCONR6_CMPC1                          *((volatile unsigned int*)(0x422AAA94UL))
#define bM4_TMRA2_PCONR6_PERC0                          *((volatile unsigned int*)(0x422AAA98UL))
#define bM4_TMRA2_PCONR6_PERC1                          *((volatile unsigned int*)(0x422AAA9CUL))
#define bM4_TMRA2_PCONR6_FORC0                          *((volatile unsigned int*)(0x422AAAA0UL))
#define bM4_TMRA2_PCONR6_FORC1                          *((volatile unsigned int*)(0x422AAAA4UL))
#define bM4_TMRA2_PCONR6_OUTEN                          *((volatile unsigned int*)(0x422AAAB0UL))
#define bM4_TMRA2_PCONR7_STAC0                          *((volatile unsigned int*)(0x422AAB00UL))
#define bM4_TMRA2_PCONR7_STAC1                          *((volatile unsigned int*)(0x422AAB04UL))
#define bM4_TMRA2_PCONR7_STPC0                          *((volatile unsigned int*)(0x422AAB08UL))
#define bM4_TMRA2_PCONR7_STPC1                          *((volatile unsigned int*)(0x422AAB0CUL))
#define bM4_TMRA2_PCONR7_CMPC0                          *((volatile unsigned int*)(0x422AAB10UL))
#define bM4_TMRA2_PCONR7_CMPC1                          *((volatile unsigned int*)(0x422AAB14UL))
#define bM4_TMRA2_PCONR7_PERC0                          *((volatile unsigned int*)(0x422AAB18UL))
#define bM4_TMRA2_PCONR7_PERC1                          *((volatile unsigned int*)(0x422AAB1CUL))
#define bM4_TMRA2_PCONR7_FORC0                          *((volatile unsigned int*)(0x422AAB20UL))
#define bM4_TMRA2_PCONR7_FORC1                          *((volatile unsigned int*)(0x422AAB24UL))
#define bM4_TMRA2_PCONR7_OUTEN                          *((volatile unsigned int*)(0x422AAB30UL))
#define bM4_TMRA2_PCONR8_STAC0                          *((volatile unsigned int*)(0x422AAB80UL))
#define bM4_TMRA2_PCONR8_STAC1                          *((volatile unsigned int*)(0x422AAB84UL))
#define bM4_TMRA2_PCONR8_STPC0                          *((volatile unsigned int*)(0x422AAB88UL))
#define bM4_TMRA2_PCONR8_STPC1                          *((volatile unsigned int*)(0x422AAB8CUL))
#define bM4_TMRA2_PCONR8_CMPC0                          *((volatile unsigned int*)(0x422AAB90UL))
#define bM4_TMRA2_PCONR8_CMPC1                          *((volatile unsigned int*)(0x422AAB94UL))
#define bM4_TMRA2_PCONR8_PERC0                          *((volatile unsigned int*)(0x422AAB98UL))
#define bM4_TMRA2_PCONR8_PERC1                          *((volatile unsigned int*)(0x422AAB9CUL))
#define bM4_TMRA2_PCONR8_FORC0                          *((volatile unsigned int*)(0x422AABA0UL))
#define bM4_TMRA2_PCONR8_FORC1                          *((volatile unsigned int*)(0x422AABA4UL))
#define bM4_TMRA2_PCONR8_OUTEN                          *((volatile unsigned int*)(0x422AABB0UL))
#define bM4_TMRA3_CNTER_CNT0                            *((volatile unsigned int*)(0x422B0000UL))
#define bM4_TMRA3_CNTER_CNT1                            *((volatile unsigned int*)(0x422B0004UL))
#define bM4_TMRA3_CNTER_CNT2                            *((volatile unsigned int*)(0x422B0008UL))
#define bM4_TMRA3_CNTER_CNT3                            *((volatile unsigned int*)(0x422B000CUL))
#define bM4_TMRA3_CNTER_CNT4                            *((volatile unsigned int*)(0x422B0010UL))
#define bM4_TMRA3_CNTER_CNT5                            *((volatile unsigned int*)(0x422B0014UL))
#define bM4_TMRA3_CNTER_CNT6                            *((volatile unsigned int*)(0x422B0018UL))
#define bM4_TMRA3_CNTER_CNT7                            *((volatile unsigned int*)(0x422B001CUL))
#define bM4_TMRA3_CNTER_CNT8                            *((volatile unsigned int*)(0x422B0020UL))
#define bM4_TMRA3_CNTER_CNT9                            *((volatile unsigned int*)(0x422B0024UL))
#define bM4_TMRA3_CNTER_CNT10                           *((volatile unsigned int*)(0x422B0028UL))
#define bM4_TMRA3_CNTER_CNT11                           *((volatile unsigned int*)(0x422B002CUL))
#define bM4_TMRA3_CNTER_CNT12                           *((volatile unsigned int*)(0x422B0030UL))
#define bM4_TMRA3_CNTER_CNT13                           *((volatile unsigned int*)(0x422B0034UL))
#define bM4_TMRA3_CNTER_CNT14                           *((volatile unsigned int*)(0x422B0038UL))
#define bM4_TMRA3_CNTER_CNT15                           *((volatile unsigned int*)(0x422B003CUL))
#define bM4_TMRA3_PERAR_PER0                            *((volatile unsigned int*)(0x422B0080UL))
#define bM4_TMRA3_PERAR_PER1                            *((volatile unsigned int*)(0x422B0084UL))
#define bM4_TMRA3_PERAR_PER2                            *((volatile unsigned int*)(0x422B0088UL))
#define bM4_TMRA3_PERAR_PER3                            *((volatile unsigned int*)(0x422B008CUL))
#define bM4_TMRA3_PERAR_PER4                            *((volatile unsigned int*)(0x422B0090UL))
#define bM4_TMRA3_PERAR_PER5                            *((volatile unsigned int*)(0x422B0094UL))
#define bM4_TMRA3_PERAR_PER6                            *((volatile unsigned int*)(0x422B0098UL))
#define bM4_TMRA3_PERAR_PER7                            *((volatile unsigned int*)(0x422B009CUL))
#define bM4_TMRA3_PERAR_PER8                            *((volatile unsigned int*)(0x422B00A0UL))
#define bM4_TMRA3_PERAR_PER9                            *((volatile unsigned int*)(0x422B00A4UL))
#define bM4_TMRA3_PERAR_PER10                           *((volatile unsigned int*)(0x422B00A8UL))
#define bM4_TMRA3_PERAR_PER11                           *((volatile unsigned int*)(0x422B00ACUL))
#define bM4_TMRA3_PERAR_PER12                           *((volatile unsigned int*)(0x422B00B0UL))
#define bM4_TMRA3_PERAR_PER13                           *((volatile unsigned int*)(0x422B00B4UL))
#define bM4_TMRA3_PERAR_PER14                           *((volatile unsigned int*)(0x422B00B8UL))
#define bM4_TMRA3_PERAR_PER15                           *((volatile unsigned int*)(0x422B00BCUL))
#define bM4_TMRA3_CMPAR1_CMP0                           *((volatile unsigned int*)(0x422B0800UL))
#define bM4_TMRA3_CMPAR1_CMP1                           *((volatile unsigned int*)(0x422B0804UL))
#define bM4_TMRA3_CMPAR1_CMP2                           *((volatile unsigned int*)(0x422B0808UL))
#define bM4_TMRA3_CMPAR1_CMP3                           *((volatile unsigned int*)(0x422B080CUL))
#define bM4_TMRA3_CMPAR1_CMP4                           *((volatile unsigned int*)(0x422B0810UL))
#define bM4_TMRA3_CMPAR1_CMP5                           *((volatile unsigned int*)(0x422B0814UL))
#define bM4_TMRA3_CMPAR1_CMP6                           *((volatile unsigned int*)(0x422B0818UL))
