CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_TMRA3_CCONR4_CAPMDA                         *((volatile unsigned int*)(0x422B2180UL))
#define bM4_TMRA3_CCONR4_HICP0                          *((volatile unsigned int*)(0x422B2190UL))
#define bM4_TMRA3_CCONR4_HICP1                          *((volatile unsigned int*)(0x422B2194UL))
#define bM4_TMRA3_CCONR4_HICP2                          *((volatile unsigned int*)(0x422B2198UL))
#define bM4_TMRA3_CCONR4_HICP3                          *((volatile unsigned int*)(0x422B21A0UL))
#define bM4_TMRA3_CCONR4_HICP4                          *((volatile unsigned int*)(0x422B21A4UL))
#define bM4_TMRA3_CCONR4_NOFIENCP                       *((volatile unsigned int*)(0x422B21B0UL))
#define bM4_TMRA3_CCONR4_NOFICKCP0                      *((volatile unsigned int*)(0x422B21B4UL))
#define bM4_TMRA3_CCONR4_NOFICKCP1                      *((volatile unsigned int*)(0x422B21B8UL))
#define bM4_TMRA3_CCONR5_CAPMDA                         *((volatile unsigned int*)(0x422B2200UL))
#define bM4_TMRA3_CCONR5_HICP0                          *((volatile unsigned int*)(0x422B2210UL))
#define bM4_TMRA3_CCONR5_HICP1                          *((volatile unsigned int*)(0x422B2214UL))
#define bM4_TMRA3_CCONR5_HICP2                          *((volatile unsigned int*)(0x422B2218UL))
#define bM4_TMRA3_CCONR5_HICP3                          *((volatile unsigned int*)(0x422B2220UL))
#define bM4_TMRA3_CCONR5_HICP4                          *((volatile unsigned int*)(0x422B2224UL))
#define bM4_TMRA3_CCONR5_NOFIENCP                       *((volatile unsigned int*)(0x422B2230UL))
#define bM4_TMRA3_CCONR5_NOFICKCP0                      *((volatile unsigned int*)(0x422B2234UL))
#define bM4_TMRA3_CCONR5_NOFICKCP1                      *((volatile unsigned int*)(0x422B2238UL))
#define bM4_TMRA3_CCONR6_CAPMDA                         *((volatile unsigned int*)(0x422B2280UL))
#define bM4_TMRA3_CCONR6_HICP0                          *((volatile unsigned int*)(0x422B2290UL))
#define bM4_TMRA3_CCONR6_HICP1                          *((volatile unsigned int*)(0x422B2294UL))
#define bM4_TMRA3_CCONR6_HICP2                          *((volatile unsigned int*)(0x422B2298UL))
#define bM4_TMRA3_CCONR6_HICP3                          *((volatile unsigned int*)(0x422B22A0UL))
#define bM4_TMRA3_CCONR6_HICP4                          *((volatile unsigned int*)(0x422B22A4UL))
#define bM4_TMRA3_CCONR6_NOFIENCP                       *((volatile unsigned int*)(0x422B22B0UL))
#define bM4_TMRA3_CCONR6_NOFICKCP0                      *((volatile unsigned int*)(0x422B22B4UL))
#define bM4_TMRA3_CCONR6_NOFICKCP1                      *((volatile unsigned int*)(0x422B22B8UL))
#define bM4_TMRA3_CCONR7_CAPMDA                         *((volatile unsigned int*)(0x422B2300UL))
#define bM4_TMRA3_CCONR7_HICP0                          *((volatile unsigned int*)(0x422B2310UL))
#define bM4_TMRA3_CCONR7_HICP1                          *((volatile unsigned int*)(0x422B2314UL))
#define bM4_TMRA3_CCONR7_HICP2                          *((volatile unsigned int*)(0x422B2318UL))
#define bM4_TMRA3_CCONR7_HICP3                          *((volatile unsigned int*)(0x422B2320UL))
#define bM4_TMRA3_CCONR7_HICP4                          *((volatile unsigned int*)(0x422B2324UL))
#define bM4_TMRA3_CCONR7_NOFIENCP                       *((volatile unsigned int*)(0x422B2330UL))
#define bM4_TMRA3_CCONR7_NOFICKCP0                      *((volatile unsigned int*)(0x422B2334UL))
#define bM4_TMRA3_CCONR7_NOFICKCP1                      *((volatile unsigned int*)(0x422B2338UL))
#define bM4_TMRA3_CCONR8_CAPMDA                         *((volatile unsigned int*)(0x422B2380UL))
#define bM4_TMRA3_CCONR8_HICP0                          *((volatile unsigned int*)(0x422B2390UL))
#define bM4_TMRA3_CCONR8_HICP1                          *((volatile unsigned int*)(0x422B2394UL))
#define bM4_TMRA3_CCONR8_HICP2                          *((volatile unsigned int*)(0x422B2398UL))
#define bM4_TMRA3_CCONR8_HICP3                          *((volatile unsigned int*)(0x422B23A0UL))
#define bM4_TMRA3_CCONR8_HICP4                          *((volatile unsigned int*)(0x422B23A4UL))
#define bM4_TMRA3_CCONR8_NOFIENCP                       *((volatile unsigned int*)(0x422B23B0UL))
#define bM4_TMRA3_CCONR8_NOFICKCP0                      *((volatile unsigned int*)(0x422B23B4UL))
#define bM4_TMRA3_CCONR8_NOFICKCP1                      *((volatile unsigned int*)(0x422B23B8UL))
#define bM4_TMRA3_PCONR1_STAC0                          *((volatile unsigned int*)(0x422B2800UL))
#define bM4_TMRA3_PCONR1_STAC1                          *((volatile unsigned int*)(0x422B2804UL))
#define bM4_TMRA3_PCONR1_STPC0                          *((volatile unsigned int*)(0x422B2808UL))
#define bM4_TMRA3_PCONR1_STPC1                          *((volatile unsigned int*)(0x422B280CUL))
#define bM4_TMRA3_PCONR1_CMPC0                          *((volatile unsigned int*)(0x422B2810UL))
#define bM4_TMRA3_PCONR1_CMPC1                          *((volatile unsigned int*)(0x422B2814UL))
#define bM4_TMRA3_PCONR1_PERC0                          *((volatile unsigned int*)(0x422B2818UL))
#define bM4_TMRA3_PCONR1_PERC1                          *((volatile unsigned int*)(0x422B281CUL))
#define bM4_TMRA3_PCONR1_FORC0                          *((volatile unsigned int*)(0x422B2820UL))
#define bM4_TMRA3_PCONR1_FORC1                          *((volatile unsigned int*)(0x422B2824UL))
#define bM4_TMRA3_PCONR1_OUTEN                          *((volatile unsigned int*)(0x422B2830UL))
#define bM4_TMRA3_PCONR2_STAC0                          *((volatile unsigned int*)(0x422B2880UL))
#define bM4_TMRA3_PCONR2_STAC1                          *((volatile unsigned int*)(0x422B2884UL))
#define bM4_TMRA3_PCONR2_STPC0                          *((volatile unsigned int*)(0x422B2888UL))
#define bM4_TMRA3_PCONR2_STPC1                          *((volatile unsigned int*)(0x422B288CUL))
#define bM4_TMRA3_PCONR2_CMPC0                          *((volatile unsigned int*)(0x422B2890UL))
#define bM4_TMRA3_PCONR2_CMPC1                          *((volatile unsigned int*)(0x422B2894UL))
#define bM4_TMRA3_PCONR2_PERC0                          *((volatile unsigned int*)(0x422B2898UL))
#define bM4_TMRA3_PCONR2_PERC1                          *((volatile unsigned int*)(0x422B289CUL))
#define bM4_TMRA3_PCONR2_FORC0                          *((volatile unsigned int*)(0x422B28A0UL))
#define bM4_TMRA3_PCONR2_FORC1                          *((volatile unsigned int*)(0x422B28A4UL))
#define bM4_TMRA3_PCONR2_OUTEN                          *((volatile unsigned int*)(0x422B28B0UL))
#define bM4_TMRA3_PCONR3_STAC0                          *((volatile unsigned int*)(0x422B2900UL))
#define bM4_TMRA3_PCONR3_STAC1                          *((volatile unsigned int*)(0x422B2904UL))
#define bM4_TMRA3_PCONR3_STPC0                          *((volatile unsigned int*)(0x422B2908UL))
#define bM4_TMRA3_PCONR3_STPC1                          *((volatile unsigned int*)(0x422B290CUL))
#define bM4_TMRA3_PCONR3_CMPC0                          *((volatile unsigned int*)(0x422B2910UL))
#define bM4_TMRA3_PCONR3_CMPC1                          *((volatile unsigned int*)(0x422B2914UL))
#define bM4_TMRA3_PCONR3_PERC0                          *((volatile unsigned int*)(0x422B2918UL))
#define bM4_TMRA3_PCONR3_PERC1                          *((volatile unsigned int*)(0x422B291CUL))
#define bM4_TMRA3_PCONR3_FORC0                          *((volatile unsigned int*)(0x422B2920UL))
#define bM4_TMRA3_PCONR3_FORC1                          *((volatile unsigned int*)(0x422B2924UL))
#define bM4_TMRA3_PCONR3_OUTEN                          *((volatile unsigned int*)(0x422B2930UL))
#define bM4_TMRA3_PCONR4_STAC0                          *((volatile unsigned int*)(0x422B2980UL))
#define bM4_TMRA3_PCONR4_STAC1                          *((volatile unsigned int*)(0x422B2984UL))
#define bM4_TMRA3_PCONR4_STPC0                          *((volatile unsigned int*)(0x422B2988UL))
#define bM4_TMRA3_PCONR4_STPC1                          *((volatile unsigned int*)(0x422B298CUL))
#define bM4_TMRA3_PCONR4_CMPC0                          *((volatile unsigned int*)(0x422B2990UL))
#define bM4_TMRA3_PCONR4_CMPC1                          *((volatile unsigned int*)(0x422B2994UL))
#define bM4_TMRA3_PCONR4_PERC0                          *((volatile unsigned int*)(0x422B2998UL))
#define bM4_TMRA3_PCONR4_PERC1                          *((volatile unsigned int*)(0x422B299CUL))
#define bM4_TMRA3_PCONR4_FORC0                          *((volatile unsigned int*)(0x422B29A0UL))
#define bM4_TMRA3_PCONR4_FORC1                          *((volatile unsigned int*)(0x422B29A4UL))
#define bM4_TMRA3_PCONR4_OUTEN                          *((volatile unsigned int*)(0x422B29B0UL))
#define bM4_TMRA3_PCONR5_STAC0                          *((volatile unsigned int*)(0x422B2A00UL))
#define bM4_TMRA3_PCONR5_STAC1                          *((volatile unsigned int*)(0x422B2A04UL))
#define bM4_TMRA3_PCONR5_STPC0                          *((volatile unsigned int*)(0x422B2A08UL))
#define bM4_TMRA3_PCONR5_STPC1                          *((volatile unsigned int*)(0x422B2A0CUL))
#define bM4_TMRA3_PCONR5_CMPC0                          *((volatile unsigned int*)(0x422B2A10UL))
#define bM4_TMRA3_PCONR5_CMPC1                          *((volatile unsigned int*)(0x422B2A14UL))
#define bM4_TMRA3_PCONR5_PERC0                          *((volatile unsigned int*)(0x422B2A18UL))
#define bM4_TMRA3_PCONR5_PERC1                          *((volatile unsigned int*)(0x422B2A1CUL))
#define bM4_TMRA3_PCONR5_FORC0                          *((volatile unsigned int*)(0x422B2A20UL))
#define bM4_TMRA3_PCONR5_FORC1                          *((volatile unsigned int*)(0x422B2A24UL))
#define bM4_TMRA3_PCONR5_OUTEN                          *((volatile unsigned int*)(0x422B2A30UL))
#define bM4_TMRA3_PCONR6_STAC0                          *((volatile unsigned int*)(0x422B2A80UL))
#define bM4_TMRA3_PCONR6_STAC1                          *((volatile unsigned int*)(0x422B2A84UL))
#define bM4_TMRA3_PCONR6_STPC0                          *((volatile unsigned int*)(0x422B2A88UL))
#define bM4_TMRA3_PCONR6_STPC1                          *((volatile unsigned int*)(0x422B2A8CUL))
#define bM4_TMRA3_PCONR6_CMPC0                          *((volatile unsigned int*)(0x422B2A90UL))
#define bM4_TMRA3_PCONR6_CMPC1                          *((volatile unsigned int*)(0x422B2A94UL))
#define bM4_TMRA3_PCONR6_PERC0                          *((volatile unsigned int*)(0x422B2A98UL))
#define bM4_TMRA3_PCONR6_PERC1                          *((volatile unsigned int*)(0x422B2A9CUL))
#define bM4_TMRA3_PCONR6_FORC0                          *((volatile unsigned int*)(0x422B2AA0UL))
#define bM4_TMRA3_PCONR6_FORC1                          *((volatile unsigned int*)(0x422B2AA4UL))
#define bM4_TMRA3_PCONR6_OUTEN                          *((volatile unsigned int*)(0x422B2AB0UL))
#define bM4_TMRA3_PCONR7_STAC0                          *((volatile unsigned int*)(0x422B2B00UL))
#define bM4_TMRA3_PCONR7_STAC1                          *((volatile unsigned int*)(0x422B2B04UL))
#define bM4_TMRA3_PCONR7_STPC0                          *((volatile unsigned int*)(0x422B2B08UL))
#define bM4_TMRA3_PCONR7_STPC1                          *((volatile unsigned int*)(0x422B2B0CUL))
#define bM4_TMRA3_PCONR7_CMPC0                          *((volatile unsigned int*)(0x422B2B10UL))
#define bM4_TMRA3_PCONR7_CMPC1                          *((volatile unsigned int*)(0x422B2B14UL))
#define bM4_TMRA3_PCONR7_PERC0                          *((volatile unsigned int*)(0x422B2B18UL))
#define bM4_TMRA3_PCONR7_PERC1                          *((volatile unsigned int*)(0x422B2B1CUL))
#define bM4_TMRA3_PCONR7_FORC0                          *((volatile unsigned int*)(0x422B2B20UL))
#define bM4_TMRA3_PCONR7_FORC1                          *((volatile unsigned int*)(0x422B2B24UL))
#define bM4_TMRA3_PCONR7_OUTEN                          *((volatile unsigned int*)(0x422B2B30UL))
#define bM4_TMRA3_PCONR8_STAC0                          *((volatile unsigned int*)(0x422B2B80UL))
#define bM4_TMRA3_PCONR8_STAC1                          *((volatile unsigned int*)(0x422B2B84UL))
#define bM4_TMRA3_PCONR8_STPC0                          *((volatile unsigned int*)(0x422B2B88UL))
#define bM4_TMRA3_PCONR8_STPC1                          *((volatile unsigned int*)(0x422B2B8CUL))
#define bM4_TMRA3_PCONR8_CMPC0                          *((volatile unsigned int*)(0x422B2B90UL))
#define bM4_TMRA3_PCONR8_CMPC1                          *((volatile unsigned int*)(0x422B2B94UL))
#define bM4_TMRA3_PCONR8_PERC0                          *((volatile unsigned int*)(0x422B2B98UL))
#define bM4_TMRA3_PCONR8_PERC1                          *((volatile unsigned int*)(0x422B2B9CUL))
#define bM4_TMRA3_PCONR8_FORC0                          *((volatile unsigned int*)(0x422B2BA0UL))
#define bM4_TMRA3_PCONR8_FORC1                          *((volatile unsigned int*)(0x422B2BA4UL))
#define bM4_TMRA3_PCONR8_OUTEN                          *((volatile unsigned int*)(0x422B2BB0UL))
#define bM4_TMRA4_CNTER_CNT0                            *((volatile unsigned int*)(0x422B8000UL))
#define bM4_TMRA4_CNTER_CNT1                            *((volatile unsigned int*)(0x422B8004UL))
#define bM4_TMRA4_CNTER_CNT2                            *((volatile unsigned int*)(0x422B8008UL))
#define bM4_TMRA4_CNTER_CNT3                            *((volatile unsigned int*)(0x422B800CUL))
#define bM4_TMRA4_CNTER_CNT4                            *((volatile unsigned int*)(0x422B8010UL))
#define bM4_TMRA4_CNTER_CNT5                            *((volatile unsigned int*)(0x422B8014UL))
#define bM4_TMRA4_CNTER_CNT6                            *((volatile unsigned int*)(0x422B8018UL))
#define bM4_TMRA4_CNTER_CNT7                            *((volatile unsigned int*)(0x422B801CUL))
#define bM4_TMRA4_CNTER_CNT8                            *((volatile unsigned int*)(0x422B8020UL))
#define bM4_TMRA4_CNTER_CNT9                            *((volatile unsigned int*)(0x422B8024UL))
#define bM4_TMRA4_CNTER_CNT10                           *((volatile unsigned int*)(0x422B8028UL))
#define bM4_TMRA4_CNTER_CNT11                           *((volatile unsigned int*)(0x422B802CUL))
#define bM4_TMRA4_CNTER_CNT12                           *((volatile unsigned int*)(0x422B8030UL))
#define bM4_TMRA4_CNTER_CNT13                           *((volatile unsigned int*)(0x422B8034UL))
#define bM4_TMRA4_CNTER_CNT14                           *((volatile unsigned int*)(0x422B8038UL))
#define bM4_TMRA4_CNTER_CNT15                           *((volatile unsigned int*)(0x422B803CUL))
#define bM4_TMRA4_PERAR_PER0                            *((volatile unsigned int*)(0x422B8080UL))
#define bM4_TMRA4_PERAR_PER1                            *((volatile unsigned int*)(0x422B8084UL))
#define bM4_TMRA4_PERAR_PER2                            *((volatile unsigned int*)(0x422B8088UL))
#define bM4_TMRA4_PERAR_PER3                            *((volatile unsigned int*)(0x422B808CUL))
#define bM4_TMRA4_PERAR_PER4                            *((volatile unsigned int*)(0x422B8090UL))
#define bM4_TMRA4_PERAR_PER5                            *((volatile unsigned int*)(0x422B8094UL))
#define bM4_TMRA4_PERAR_PER6                            *((volatile unsigned int*)(0x422B8098UL))
#define bM4_TMRA4_PERAR_PER7                            *((volatile unsigned int*)(0x422B809CUL))
#define bM4_TMRA4_PERAR_PER8                            *((volatile unsigned int*)(0x422B80A0UL))
#define bM4_TMRA4_PERAR_PER9                            *((volatile unsigned int*)(0x422B80A4UL))
#define bM4_TMRA4_PERAR_PER10                           *((volatile unsigned int*)(0x422B80A8UL))
#define bM4_TMRA4_PERAR_PER11                           *((volatile unsigned int*)(0x422B80ACUL))
#define bM4_TMRA4_PERAR_PER12                           *((volatile unsigned int*)(0x422B80B0UL))
#define bM4_TMRA4_PERAR_PER13                           *((volatile unsigned int*)(0x422B80B4UL))
#define bM4_TMRA4_PERAR_PER14                           *((volatile unsigned int*)(0x422B80B8UL))
#define bM4_TMRA4_PERAR_PER15                           *((volatile unsigned int*)(0x422B80BCUL))
#define bM4_TMRA4_CMPAR1_CMP0                           *((volatile unsigned int*)(0x422B8800UL))
#define bM4_TMRA4_CMPAR1_CMP1                           *((volatile unsigned int*)(0x422B8804UL))
#define bM4_TMRA4_CMPAR1_CMP2                           *((volatile unsigned int*)(0x422B8808UL))
#define bM4_TMRA4_CMPAR1_CMP3                           *((volatile unsigned int*)(0x422B880CUL))
#define bM4_TMRA4_CMPAR1_CMP4                           *((volatile unsigned int*)(0x422B8810UL))
#define bM4_TMRA4_CMPAR1_CMP5                           *((volatile unsigned int*)(0x422B8814UL))
#define bM4_TMRA4_CMPAR1_CMP6                           *((volatile unsigned int*)(0x422B8818UL))
#define bM4_TMRA4_CMPAR1_CMP7                           *((volatile unsigned int*)(0x422B881CUL))
#define bM4_TMRA4_CMPAR1_CMP8                           *((volatile unsigned int*)(0x422B8820UL))
#define bM4_TMRA4_CMPAR1_CMP9                           *((volatile unsigned int*)(0x422B8824UL))
#define bM4_TMRA4_CMPAR1_CMP10                          *((volatile unsigned int*)(0x422B8828UL))
#define bM4_TMRA4_CMPAR1_CMP11                          *((volatile unsigned int*)(0x422B882CUL))
#define bM4_TMRA4_CMPAR1_CMP12                          *((volatile unsigned int*)(0x422B8830UL))
#define bM4_TMRA4_CMPAR1_CMP13                          *((volatile unsigned int*)(0x422B8834UL))
#define bM4_TMRA4_CMPAR1_CMP14                          *((volatile unsigned int*)(0x422B8838UL))
#define bM4_TMRA4_CMPAR1_CMP15                          *((volatile unsigned int*)(0x422B883CUL))
#define bM4_TMRA4_CMPAR2_CMP0                           *((volatile unsigned int*)(0x422B8880UL))
#define bM4_TMRA4_CMPAR2_CMP1                           *((volatile unsigned int*)(0x422B8884UL))
#define bM4_TMRA4_CMPAR2_CMP2                           *((volatile unsigned int*)(0x422B8888UL))
#define bM4_TMRA4_CMPAR2_CMP3                           *((volatile unsigned int*)(0x422B888CUL))
#define bM4_TMRA4_CMPAR2_CMP4                           *((volatile unsigned int*)(0x422B8890UL))
#define bM4_TMRA4_CMPAR2_CMP5                           *((volatile unsigned int*)(0x422B8894UL))
#define bM4_TMRA4_CMPAR2_CMP6                           *((volatile unsigned int*)(0x422B8898UL))
#define bM4_TMRA4_CMPAR2_CMP7                           *((volatile unsigned int*)(0x422B889CUL))
#define bM4_TMRA4_CMPAR2_CMP8                           *((volatile unsigned int*)(0x422B88A0UL))
#define bM4_TMRA4_CMPAR2_CMP9                           *((volatile unsigned int*)(0x422B88A4UL))
#define bM4_TMRA4_CMPAR2_CMP10                          *((volatile unsigned int*)(0x422B88A8UL))
#define bM4_TMRA4_CMPAR2_CMP11                          *((volatile unsigned int*)(0x422B88ACUL))
#define bM4_TMRA4_CMPAR2_CMP12                          *((volatile unsigned int*)(0x422B88B0UL))
#define bM4_TMRA4_CMPAR2_CMP13                          *((volatile unsigned int*)(0x422B88B4UL))
#define bM4_TMRA4_CMPAR2_CMP14                          *((volatile unsigned int*)(0x422B88B8UL))
#define bM4_TMRA4_CMPAR2_CMP15                          *((volatile unsigned int*)(0x422B88BCUL))
#define bM4_TMRA4_CMPAR3_CMP0                           *((volatile unsigned int*)(0x422B8900UL))
#define bM4_TMRA4_CMPAR3_CMP1                           *((volatile unsigned int*)(0x422B8904UL))
#define bM4_TMRA4_CMPAR3_CMP2                           *((volatile unsigned int*)(0x422B8908UL))
#define bM4_TMRA4_CMPAR3_CMP3                           *((volatile unsigned int*)(0x422B890CUL))
#define bM4_TMRA4_CMPAR3_CMP4                           *((volatile unsigned int*)(0x422B8910UL))
#define bM4_TMRA4_CMPAR3_CMP5                           *((volatile unsigned int*)(0x422B8914UL))
#define bM4_TMRA4_CMPAR3_CMP6                           *((volatile unsigned int*)(0x422B8918UL))
#define bM4_TMRA4_CMPAR3_CMP7                           *((volatile unsigned int*)(0x422B891CUL))
#define bM4_TMRA4_CMPAR3_CMP8                           *((volatile unsigned int*)(0x422B8920UL))
#define bM4_TMRA4_CMPAR3_CMP9                           *((volatile unsigned int*)(0x422B8924UL))
#define bM4_TMRA4_CMPAR3_CMP10                          *((volatile unsigned int*)(0x422B8928UL))
#define bM4_TMRA4_CMPAR3_CMP11                          *((volatile unsigned int*)(0x422B892CUL))
#define bM4_TMRA4_CMPAR3_CMP12                          *((volatile unsigned int*)(0x422B8930UL))
#define bM4_TMRA4_CMPAR3_CMP13                          *((volatile unsigned int*)(0x422B8934UL))
#define bM4_TMRA4_CMPAR3_CMP14                          *((volatile unsigned int*)(0x422B8938UL))
#define bM4_TMRA4_CMPAR3_CMP15                          *((volatile unsigned int*)(0x422B893CUL))
#define bM4_TMRA4_CMPAR4_CMP0                           *((volatile unsigned int*)(0x422B8980UL))
#define bM4_TMRA4_CMPAR4_CMP1                           *((volatile unsigned int*)(0x422B8984UL))
#define bM4_TMRA4_CMPAR4_CMP2                           *((volatile unsigned int*)(0x422B8988UL))
#define bM4_TMRA4_CMPAR4_CMP3                           *((volatile unsigned int*)(0x422B898CUL))
#define bM4_TMRA4_CMPAR4_CMP4                           *((volatile unsigned int*)(0x422B8990UL))
#define bM4_TMRA4_CMPAR4_CMP5                           *((volatile unsigned int*)(0x422B8994UL))
#define bM4_TMRA4_CMPAR4_CMP6                           *((volatile unsigned int*)(0x422B8998UL))
#define bM4_TMRA4_CMPAR4_CMP7                           *((volatile unsigned int*)(0x422B899CUL))
#define bM4_TMRA4_CMPAR4_CMP8                           *((volatile unsigned int*)(0x422B89A0UL))
#define bM4_TMRA4_CMPAR4_CMP9                           *((volatile unsigned int*)(0x422B89A4UL))
#define bM4_TMRA4_CMPAR4_CMP10                          *((volatile unsigned int*)(0x422B89A8UL))
#define bM4_TMRA4_CMPAR4_CMP11                          *((volatile unsigned int*)(0x422B89ACUL))
#define bM4_TMRA4_CMPAR4_CMP12                          *((volatile unsigned int*)(0x422B89B0UL))
#define bM4_TMRA4_CMPAR4_CMP13                          *((volatile unsigned int*)(0x422B89B4UL))
#define bM4_TMRA4_CMPAR4_CMP14                          *((volatile unsigned int*)(0x422B89B8UL))
#define bM4_TMRA4_CMPAR4_CMP15                          *((volatile unsigned int*)(0x422B89BCUL))
#define bM4_TMRA4_CMPAR5_CMP0                           *((volatile unsigned int*)(0x422B8A00UL))
#define bM4_TMRA4_CMPAR5_CMP1                           *((volatile unsigned int*)(0x422B8A04UL))
#define bM4_TMRA4_CMPAR5_CMP2                           *((volatile unsigned int*)(0x422B8A08UL))
#define bM4_TMRA4_CMPAR5_CMP3                           *((volatile unsigned int*)(0x422B8A0CUL))
#define bM4_TMRA4_CMPAR5_CMP4                           *((volatile unsigned int*)(0x422B8A10UL))
#define bM4_TMRA4_CMPAR5_CMP5                           *((volatile unsigned int*)(0x422B8A14UL))
#define bM4_TMRA4_CMPAR5_CMP6                           *((volatile unsigned int*)(0x422B8A18UL))
#define bM4_TMRA4_CMPAR5_CMP7                           *((volatile unsigned int*)(0x422B8A1CUL))
#define bM4_TMRA4_CMPAR5_CMP8                           *((volatile unsigned int*)(0x422B8A20UL))
#define bM4_TMRA4_CMPAR5_CMP9                           *((volatile unsigned int*)(0x422B8A24UL))
#define bM4_TMRA4_CMPAR5_CMP10                          *((volatile unsigned int*)(0x422B8A28UL))
#define bM4_TMRA4_CMPAR5_CMP11                          *((volatile unsigned int*)(0x422B8A2CUL))
#define bM4_TMRA4_CMPAR5_CMP12                          *((volatile unsigned int*)(0x422B8A30UL))
#define bM4_TMRA4_CMPAR5_CMP13                          *((volatile unsigned int*)(0x422B8A34UL))
#define bM4_TMRA4_CMPAR5_CMP14                          *((volatile unsigned int*)(0x422B8A38UL))
