CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_TMRA6_BCONR4_BSE1                           *((volatile unsigned int*)(0x422C9B08UL))
#define bM4_TMRA6_CCONR1_CAPMDA                         *((volatile unsigned int*)(0x422CA000UL))
#define bM4_TMRA6_CCONR1_HICP0                          *((volatile unsigned int*)(0x422CA010UL))
#define bM4_TMRA6_CCONR1_HICP1                          *((volatile unsigned int*)(0x422CA014UL))
#define bM4_TMRA6_CCONR1_HICP2                          *((volatile unsigned int*)(0x422CA018UL))
#define bM4_TMRA6_CCONR1_HICP3                          *((volatile unsigned int*)(0x422CA020UL))
#define bM4_TMRA6_CCONR1_HICP4                          *((volatile unsigned int*)(0x422CA024UL))
#define bM4_TMRA6_CCONR1_NOFIENCP                       *((volatile unsigned int*)(0x422CA030UL))
#define bM4_TMRA6_CCONR1_NOFICKCP0                      *((volatile unsigned int*)(0x422CA034UL))
#define bM4_TMRA6_CCONR1_NOFICKCP1                      *((volatile unsigned int*)(0x422CA038UL))
#define bM4_TMRA6_CCONR2_CAPMDA                         *((volatile unsigned int*)(0x422CA080UL))
#define bM4_TMRA6_CCONR2_HICP0                          *((volatile unsigned int*)(0x422CA090UL))
#define bM4_TMRA6_CCONR2_HICP1                          *((volatile unsigned int*)(0x422CA094UL))
#define bM4_TMRA6_CCONR2_HICP2                          *((volatile unsigned int*)(0x422CA098UL))
#define bM4_TMRA6_CCONR2_HICP3                          *((volatile unsigned int*)(0x422CA0A0UL))
#define bM4_TMRA6_CCONR2_HICP4                          *((volatile unsigned int*)(0x422CA0A4UL))
#define bM4_TMRA6_CCONR2_NOFIENCP                       *((volatile unsigned int*)(0x422CA0B0UL))
#define bM4_TMRA6_CCONR2_NOFICKCP0                      *((volatile unsigned int*)(0x422CA0B4UL))
#define bM4_TMRA6_CCONR2_NOFICKCP1                      *((volatile unsigned int*)(0x422CA0B8UL))
#define bM4_TMRA6_CCONR3_CAPMDA                         *((volatile unsigned int*)(0x422CA100UL))
#define bM4_TMRA6_CCONR3_HICP0                          *((volatile unsigned int*)(0x422CA110UL))
#define bM4_TMRA6_CCONR3_HICP1                          *((volatile unsigned int*)(0x422CA114UL))
#define bM4_TMRA6_CCONR3_HICP2                          *((volatile unsigned int*)(0x422CA118UL))
#define bM4_TMRA6_CCONR3_HICP3                          *((volatile unsigned int*)(0x422CA120UL))
#define bM4_TMRA6_CCONR3_HICP4                          *((volatile unsigned int*)(0x422CA124UL))
#define bM4_TMRA6_CCONR3_NOFIENCP                       *((volatile unsigned int*)(0x422CA130UL))
#define bM4_TMRA6_CCONR3_NOFICKCP0                      *((volatile unsigned int*)(0x422CA134UL))
#define bM4_TMRA6_CCONR3_NOFICKCP1                      *((volatile unsigned int*)(0x422CA138UL))
#define bM4_TMRA6_CCONR4_CAPMDA                         *((volatile unsigned int*)(0x422CA180UL))
#define bM4_TMRA6_CCONR4_HICP0                          *((volatile unsigned int*)(0x422CA190UL))
#define bM4_TMRA6_CCONR4_HICP1                          *((volatile unsigned int*)(0x422CA194UL))
#define bM4_TMRA6_CCONR4_HICP2                          *((volatile unsigned int*)(0x422CA198UL))
#define bM4_TMRA6_CCONR4_HICP3                          *((volatile unsigned int*)(0x422CA1A0UL))
#define bM4_TMRA6_CCONR4_HICP4                          *((volatile unsigned int*)(0x422CA1A4UL))
#define bM4_TMRA6_CCONR4_NOFIENCP                       *((volatile unsigned int*)(0x422CA1B0UL))
#define bM4_TMRA6_CCONR4_NOFICKCP0                      *((volatile unsigned int*)(0x422CA1B4UL))
#define bM4_TMRA6_CCONR4_NOFICKCP1                      *((volatile unsigned int*)(0x422CA1B8UL))
#define bM4_TMRA6_CCONR5_CAPMDA                         *((volatile unsigned int*)(0x422CA200UL))
#define bM4_TMRA6_CCONR5_HICP0                          *((volatile unsigned int*)(0x422CA210UL))
#define bM4_TMRA6_CCONR5_HICP1                          *((volatile unsigned int*)(0x422CA214UL))
#define bM4_TMRA6_CCONR5_HICP2                          *((volatile unsigned int*)(0x422CA218UL))
#define bM4_TMRA6_CCONR5_HICP3                          *((volatile unsigned int*)(0x422CA220UL))
#define bM4_TMRA6_CCONR5_HICP4                          *((volatile unsigned int*)(0x422CA224UL))
#define bM4_TMRA6_CCONR5_NOFIENCP                       *((volatile unsigned int*)(0x422CA230UL))
#define bM4_TMRA6_CCONR5_NOFICKCP0                      *((volatile unsigned int*)(0x422CA234UL))
#define bM4_TMRA6_CCONR5_NOFICKCP1                      *((volatile unsigned int*)(0x422CA238UL))
#define bM4_TMRA6_CCONR6_CAPMDA                         *((volatile unsigned int*)(0x422CA280UL))
#define bM4_TMRA6_CCONR6_HICP0                          *((volatile unsigned int*)(0x422CA290UL))
#define bM4_TMRA6_CCONR6_HICP1                          *((volatile unsigned int*)(0x422CA294UL))
#define bM4_TMRA6_CCONR6_HICP2                          *((volatile unsigned int*)(0x422CA298UL))
#define bM4_TMRA6_CCONR6_HICP3                          *((volatile unsigned int*)(0x422CA2A0UL))
#define bM4_TMRA6_CCONR6_HICP4                          *((volatile unsigned int*)(0x422CA2A4UL))
#define bM4_TMRA6_CCONR6_NOFIENCP                       *((volatile unsigned int*)(0x422CA2B0UL))
#define bM4_TMRA6_CCONR6_NOFICKCP0                      *((volatile unsigned int*)(0x422CA2B4UL))
#define bM4_TMRA6_CCONR6_NOFICKCP1                      *((volatile unsigned int*)(0x422CA2B8UL))
#define bM4_TMRA6_CCONR7_CAPMDA                         *((volatile unsigned int*)(0x422CA300UL))
#define bM4_TMRA6_CCONR7_HICP0                          *((volatile unsigned int*)(0x422CA310UL))
#define bM4_TMRA6_CCONR7_HICP1                          *((volatile unsigned int*)(0x422CA314UL))
#define bM4_TMRA6_CCONR7_HICP2                          *((volatile unsigned int*)(0x422CA318UL))
#define bM4_TMRA6_CCONR7_HICP3                          *((volatile unsigned int*)(0x422CA320UL))
#define bM4_TMRA6_CCONR7_HICP4                          *((volatile unsigned int*)(0x422CA324UL))
#define bM4_TMRA6_CCONR7_NOFIENCP                       *((volatile unsigned int*)(0x422CA330UL))
#define bM4_TMRA6_CCONR7_NOFICKCP0                      *((volatile unsigned int*)(0x422CA334UL))
#define bM4_TMRA6_CCONR7_NOFICKCP1                      *((volatile unsigned int*)(0x422CA338UL))
#define bM4_TMRA6_CCONR8_CAPMDA                         *((volatile unsigned int*)(0x422CA380UL))
#define bM4_TMRA6_CCONR8_HICP0                          *((volatile unsigned int*)(0x422CA390UL))
#define bM4_TMRA6_CCONR8_HICP1                          *((volatile unsigned int*)(0x422CA394UL))
#define bM4_TMRA6_CCONR8_HICP2                          *((volatile unsigned int*)(0x422CA398UL))
#define bM4_TMRA6_CCONR8_HICP3                          *((volatile unsigned int*)(0x422CA3A0UL))
#define bM4_TMRA6_CCONR8_HICP4                          *((volatile unsigned int*)(0x422CA3A4UL))
#define bM4_TMRA6_CCONR8_NOFIENCP                       *((volatile unsigned int*)(0x422CA3B0UL))
#define bM4_TMRA6_CCONR8_NOFICKCP0                      *((volatile unsigned int*)(0x422CA3B4UL))
#define bM4_TMRA6_CCONR8_NOFICKCP1                      *((volatile unsigned int*)(0x422CA3B8UL))
#define bM4_TMRA6_PCONR1_STAC0                          *((volatile unsigned int*)(0x422CA800UL))
#define bM4_TMRA6_PCONR1_STAC1                          *((volatile unsigned int*)(0x422CA804UL))
#define bM4_TMRA6_PCONR1_STPC0                          *((volatile unsigned int*)(0x422CA808UL))
#define bM4_TMRA6_PCONR1_STPC1                          *((volatile unsigned int*)(0x422CA80CUL))
#define bM4_TMRA6_PCONR1_CMPC0                          *((volatile unsigned int*)(0x422CA810UL))
#define bM4_TMRA6_PCONR1_CMPC1                          *((volatile unsigned int*)(0x422CA814UL))
#define bM4_TMRA6_PCONR1_PERC0                          *((volatile unsigned int*)(0x422CA818UL))
#define bM4_TMRA6_PCONR1_PERC1                          *((volatile unsigned int*)(0x422CA81CUL))
#define bM4_TMRA6_PCONR1_FORC0                          *((volatile unsigned int*)(0x422CA820UL))
#define bM4_TMRA6_PCONR1_FORC1                          *((volatile unsigned int*)(0x422CA824UL))
#define bM4_TMRA6_PCONR1_OUTEN                          *((volatile unsigned int*)(0x422CA830UL))
#define bM4_TMRA6_PCONR2_STAC0                          *((volatile unsigned int*)(0x422CA880UL))
#define bM4_TMRA6_PCONR2_STAC1                          *((volatile unsigned int*)(0x422CA884UL))
#define bM4_TMRA6_PCONR2_STPC0                          *((volatile unsigned int*)(0x422CA888UL))
#define bM4_TMRA6_PCONR2_STPC1                          *((volatile unsigned int*)(0x422CA88CUL))
#define bM4_TMRA6_PCONR2_CMPC0                          *((volatile unsigned int*)(0x422CA890UL))
#define bM4_TMRA6_PCONR2_CMPC1                          *((volatile unsigned int*)(0x422CA894UL))
#define bM4_TMRA6_PCONR2_PERC0                          *((volatile unsigned int*)(0x422CA898UL))
#define bM4_TMRA6_PCONR2_PERC1                          *((volatile unsigned int*)(0x422CA89CUL))
#define bM4_TMRA6_PCONR2_FORC0                          *((volatile unsigned int*)(0x422CA8A0UL))
#define bM4_TMRA6_PCONR2_FORC1                          *((volatile unsigned int*)(0x422CA8A4UL))
#define bM4_TMRA6_PCONR2_OUTEN                          *((volatile unsigned int*)(0x422CA8B0UL))
#define bM4_TMRA6_PCONR3_STAC0                          *((volatile unsigned int*)(0x422CA900UL))
#define bM4_TMRA6_PCONR3_STAC1                          *((volatile unsigned int*)(0x422CA904UL))
#define bM4_TMRA6_PCONR3_STPC0                          *((volatile unsigned int*)(0x422CA908UL))
#define bM4_TMRA6_PCONR3_STPC1                          *((volatile unsigned int*)(0x422CA90CUL))
#define bM4_TMRA6_PCONR3_CMPC0                          *((volatile unsigned int*)(0x422CA910UL))
#define bM4_TMRA6_PCONR3_CMPC1                          *((volatile unsigned int*)(0x422CA914UL))
#define bM4_TMRA6_PCONR3_PERC0                          *((volatile unsigned int*)(0x422CA918UL))
#define bM4_TMRA6_PCONR3_PERC1                          *((volatile unsigned int*)(0x422CA91CUL))
#define bM4_TMRA6_PCONR3_FORC0                          *((volatile unsigned int*)(0x422CA920UL))
#define bM4_TMRA6_PCONR3_FORC1                          *((volatile unsigned int*)(0x422CA924UL))
#define bM4_TMRA6_PCONR3_OUTEN                          *((volatile unsigned int*)(0x422CA930UL))
#define bM4_TMRA6_PCONR4_STAC0                          *((volatile unsigned int*)(0x422CA980UL))
#define bM4_TMRA6_PCONR4_STAC1                          *((volatile unsigned int*)(0x422CA984UL))
#define bM4_TMRA6_PCONR4_STPC0                          *((volatile unsigned int*)(0x422CA988UL))
#define bM4_TMRA6_PCONR4_STPC1                          *((volatile unsigned int*)(0x422CA98CUL))
#define bM4_TMRA6_PCONR4_CMPC0                          *((volatile unsigned int*)(0x422CA990UL))
#define bM4_TMRA6_PCONR4_CMPC1                          *((volatile unsigned int*)(0x422CA994UL))
#define bM4_TMRA6_PCONR4_PERC0                          *((volatile unsigned int*)(0x422CA998UL))
#define bM4_TMRA6_PCONR4_PERC1                          *((volatile unsigned int*)(0x422CA99CUL))
#define bM4_TMRA6_PCONR4_FORC0                          *((volatile unsigned int*)(0x422CA9A0UL))
#define bM4_TMRA6_PCONR4_FORC1                          *((volatile unsigned int*)(0x422CA9A4UL))
#define bM4_TMRA6_PCONR4_OUTEN                          *((volatile unsigned int*)(0x422CA9B0UL))
#define bM4_TMRA6_PCONR5_STAC0                          *((volatile unsigned int*)(0x422CAA00UL))
#define bM4_TMRA6_PCONR5_STAC1                          *((volatile unsigned int*)(0x422CAA04UL))
#define bM4_TMRA6_PCONR5_STPC0                          *((volatile unsigned int*)(0x422CAA08UL))
#define bM4_TMRA6_PCONR5_STPC1                          *((volatile unsigned int*)(0x422CAA0CUL))
#define bM4_TMRA6_PCONR5_CMPC0                          *((volatile unsigned int*)(0x422CAA10UL))
#define bM4_TMRA6_PCONR5_CMPC1                          *((volatile unsigned int*)(0x422CAA14UL))
#define bM4_TMRA6_PCONR5_PERC0                          *((volatile unsigned int*)(0x422CAA18UL))
#define bM4_TMRA6_PCONR5_PERC1                          *((volatile unsigned int*)(0x422CAA1CUL))
#define bM4_TMRA6_PCONR5_FORC0                          *((volatile unsigned int*)(0x422CAA20UL))
#define bM4_TMRA6_PCONR5_FORC1                          *((volatile unsigned int*)(0x422CAA24UL))
#define bM4_TMRA6_PCONR5_OUTEN                          *((volatile unsigned int*)(0x422CAA30UL))
#define bM4_TMRA6_PCONR6_STAC0                          *((volatile unsigned int*)(0x422CAA80UL))
#define bM4_TMRA6_PCONR6_STAC1                          *((volatile unsigned int*)(0x422CAA84UL))
#define bM4_TMRA6_PCONR6_STPC0                          *((volatile unsigned int*)(0x422CAA88UL))
#define bM4_TMRA6_PCONR6_STPC1                          *((volatile unsigned int*)(0x422CAA8CUL))
#define bM4_TMRA6_PCONR6_CMPC0                          *((volatile unsigned int*)(0x422CAA90UL))
#define bM4_TMRA6_PCONR6_CMPC1                          *((volatile unsigned int*)(0x422CAA94UL))
#define bM4_TMRA6_PCONR6_PERC0                          *((volatile unsigned int*)(0x422CAA98UL))
#define bM4_TMRA6_PCONR6_PERC1                          *((volatile unsigned int*)(0x422CAA9CUL))
#define bM4_TMRA6_PCONR6_FORC0                          *((volatile unsigned int*)(0x422CAAA0UL))
#define bM4_TMRA6_PCONR6_FORC1                          *((volatile unsigned int*)(0x422CAAA4UL))
#define bM4_TMRA6_PCONR6_OUTEN                          *((volatile unsigned int*)(0x422CAAB0UL))
#define bM4_TMRA6_PCONR7_STAC0                          *((volatile unsigned int*)(0x422CAB00UL))
#define bM4_TMRA6_PCONR7_STAC1                          *((volatile unsigned int*)(0x422CAB04UL))
#define bM4_TMRA6_PCONR7_STPC0                          *((volatile unsigned int*)(0x422CAB08UL))
#define bM4_TMRA6_PCONR7_STPC1                          *((volatile unsigned int*)(0x422CAB0CUL))
#define bM4_TMRA6_PCONR7_CMPC0                          *((volatile unsigned int*)(0x422CAB10UL))
#define bM4_TMRA6_PCONR7_CMPC1                          *((volatile unsigned int*)(0x422CAB14UL))
#define bM4_TMRA6_PCONR7_PERC0                          *((volatile unsigned int*)(0x422CAB18UL))
#define bM4_TMRA6_PCONR7_PERC1                          *((volatile unsigned int*)(0x422CAB1CUL))
#define bM4_TMRA6_PCONR7_FORC0                          *((volatile unsigned int*)(0x422CAB20UL))
#define bM4_TMRA6_PCONR7_FORC1                          *((volatile unsigned int*)(0x422CAB24UL))
#define bM4_TMRA6_PCONR7_OUTEN                          *((volatile unsigned int*)(0x422CAB30UL))
#define bM4_TMRA6_PCONR8_STAC0                          *((volatile unsigned int*)(0x422CAB80UL))
#define bM4_TMRA6_PCONR8_STAC1                          *((volatile unsigned int*)(0x422CAB84UL))
#define bM4_TMRA6_PCONR8_STPC0                          *((volatile unsigned int*)(0x422CAB88UL))
#define bM4_TMRA6_PCONR8_STPC1                          *((volatile unsigned int*)(0x422CAB8CUL))
#define bM4_TMRA6_PCONR8_CMPC0                          *((volatile unsigned int*)(0x422CAB90UL))
#define bM4_TMRA6_PCONR8_CMPC1                          *((volatile unsigned int*)(0x422CAB94UL))
#define bM4_TMRA6_PCONR8_PERC0                          *((volatile unsigned int*)(0x422CAB98UL))
#define bM4_TMRA6_PCONR8_PERC1                          *((volatile unsigned int*)(0x422CAB9CUL))
#define bM4_TMRA6_PCONR8_FORC0                          *((volatile unsigned int*)(0x422CABA0UL))
#define bM4_TMRA6_PCONR8_FORC1                          *((volatile unsigned int*)(0x422CABA4UL))
#define bM4_TMRA6_PCONR8_OUTEN                          *((volatile unsigned int*)(0x422CABB0UL))
#define bM4_TRNG_CR_EN                                  *((volatile unsigned int*)(0x42820000UL))
#define bM4_TRNG_CR_RUN                                 *((volatile unsigned int*)(0x42820004UL))
#define bM4_TRNG_MR_LOAD                                *((volatile unsigned int*)(0x42820080UL))
#define bM4_TRNG_MR_CNT0                                *((volatile unsigned int*)(0x42820088UL))
#define bM4_TRNG_MR_CNT1                                *((volatile unsigned int*)(0x4282008CUL))
#define bM4_TRNG_MR_CNT2                                *((volatile unsigned int*)(0x42820090UL))
#define bM4_USART1_SR_PE                                *((volatile unsigned int*)(0x423A0000UL))
#define bM4_USART1_SR_FE                                *((volatile unsigned int*)(0x423A0004UL))
#define bM4_USART1_SR_ORE                               *((volatile unsigned int*)(0x423A000CUL))
#define bM4_USART1_SR_RXNE                              *((volatile unsigned int*)(0x423A0014UL))
#define bM4_USART1_SR_TC                                *((volatile unsigned int*)(0x423A0018UL))
#define bM4_USART1_SR_TXE                               *((volatile unsigned int*)(0x423A001CUL))
#define bM4_USART1_SR_RTOF                              *((volatile unsigned int*)(0x423A0020UL))
#define bM4_USART1_SR_MPB                               *((volatile unsigned int*)(0x423A0040UL))
#define bM4_USART1_DR_TDR0                              *((volatile unsigned int*)(0x423A0080UL))
#define bM4_USART1_DR_TDR1                              *((volatile unsigned int*)(0x423A0084UL))
#define bM4_USART1_DR_TDR2                              *((volatile unsigned int*)(0x423A0088UL))
#define bM4_USART1_DR_TDR3                              *((volatile unsigned int*)(0x423A008CUL))
#define bM4_USART1_DR_TDR4                              *((volatile unsigned int*)(0x423A0090UL))
#define bM4_USART1_DR_TDR5                              *((volatile unsigned int*)(0x423A0094UL))
#define bM4_USART1_DR_TDR6                              *((volatile unsigned int*)(0x423A0098UL))
#define bM4_USART1_DR_TDR7                              *((volatile unsigned int*)(0x423A009CUL))
#define bM4_USART1_DR_TDR8                              *((volatile unsigned int*)(0x423A00A0UL))
#define bM4_USART1_DR_MPID                              *((volatile unsigned int*)(0x423A00A4UL))
#define bM4_USART1_DR_RDR0                              *((volatile unsigned int*)(0x423A00C0UL))
#define bM4_USART1_DR_RDR1                              *((volatile unsigned int*)(0x423A00C4UL))
#define bM4_USART1_DR_RDR2                              *((volatile unsigned int*)(0x423A00C8UL))
#define bM4_USART1_DR_RDR3                              *((volatile unsigned int*)(0x423A00CCUL))
#define bM4_USART1_DR_RDR4                              *((volatile unsigned int*)(0x423A00D0UL))
#define bM4_USART1_DR_RDR5                              *((volatile unsigned int*)(0x423A00D4UL))
#define bM4_USART1_DR_RDR6                              *((volatile unsigned int*)(0x423A00D8UL))
#define bM4_USART1_DR_RDR7                              *((volatile unsigned int*)(0x423A00DCUL))
#define bM4_USART1_DR_RDR8                              *((volatile unsigned int*)(0x423A00E0UL))
#define bM4_USART1_BRR_DIV_FRACTION0                    *((volatile unsigned int*)(0x423A0100UL))
#define bM4_USART1_BRR_DIV_FRACTION1                    *((volatile unsigned int*)(0x423A0104UL))
#define bM4_USART1_BRR_DIV_FRACTION2                    *((volatile unsigned int*)(0x423A0108UL))
#define bM4_USART1_BRR_DIV_FRACTION3                    *((volatile unsigned int*)(0x423A010CUL))
#define bM4_USART1_BRR_DIV_FRACTION4                    *((volatile unsigned int*)(0x423A0110UL))
#define bM4_USART1_BRR_DIV_FRACTION5                    *((volatile unsigned int*)(0x423A0114UL))
#define bM4_USART1_BRR_DIV_FRACTION6                    *((volatile unsigned int*)(0x423A0118UL))
#define bM4_USART1_BRR_DIV_INTEGER0                     *((volatile unsigned int*)(0x423A0120UL))
#define bM4_USART1_BRR_DIV_INTEGER1                     *((volatile unsigned int*)(0x423A0124UL))
#define bM4_USART1_BRR_DIV_INTEGER2                     *((volatile unsigned int*)(0x423A0128UL))
#define bM4_USART1_BRR_DIV_INTEGER3                     *((volatile unsigned int*)(0x423A012CUL))
#define bM4_USART1_BRR_DIV_INTEGER4                     *((volatile unsigned int*)(0x423A0130UL))
#define bM4_USART1_BRR_DIV_INTEGER5                     *((volatile unsigned int*)(0x423A0134UL))
#define bM4_USART1_BRR_DIV_INTEGER6                     *((volatile unsigned int*)(0x423A0138UL))
#define bM4_USART1_BRR_DIV_INTEGER7                     *((volatile unsigned int*)(0x423A013CUL))
#define bM4_USART1_CR1_RTOE                             *((volatile unsigned int*)(0x423A0180UL))
#define bM4_USART1_CR1_RTOIE                            *((volatile unsigned int*)(0x423A0184UL))
#define bM4_USART1_CR1_RE                               *((volatile unsigned int*)(0x423A0188UL))
#define bM4_USART1_CR1_TE                               *((volatile unsigned int*)(0x423A018CUL))
#define bM4_USART1_CR1_SLME                             *((volatile unsigned int*)(0x423A0190UL))
#define bM4_USART1_CR1_RIE                              *((volatile unsigned int*)(0x423A0194UL))
#define bM4_USART1_CR1_TCIE                             *((volatile unsigned int*)(0x423A0198UL))
#define bM4_USART1_CR1_TXEIE                            *((volatile unsigned int*)(0x423A019CUL))
#define bM4_USART1_CR1_PS                               *((volatile unsigned int*)(0x423A01A4UL))
#define bM4_USART1_CR1_PCE                              *((volatile unsigned int*)(0x423A01A8UL))
#define bM4_USART1_CR1_M                                *((volatile unsigned int*)(0x423A01B0UL))
#define bM4_USART1_CR1_OVER8                            *((volatile unsigned int*)(0x423A01BCUL))
#define bM4_USART1_CR1_CPE                              *((volatile unsigned int*)(0x423A01C0UL))
#define bM4_USART1_CR1_CFE                              *((volatile unsigned int*)(0x423A01C4UL))
#define bM4_USART1_CR1_CORE                             *((volatile unsigned int*)(0x423A01CCUL))
#define bM4_USART1_CR1_CRTOF                            *((volatile unsigned int*)(0x423A01D0UL))
#define bM4_USART1_CR1_MS                               *((volatile unsigned int*)(0x423A01E0UL))
#define bM4_USART1_CR1_ML                               *((volatile unsigned int*)(0x423A01F0UL))
#define bM4_USART1_CR1_FBME                             *((volatile unsigned int*)(0x423A01F4UL))
#define bM4_USART1_CR1_NFE                              *((volatile unsigned int*)(0x423A01F8UL))
#define bM4_USART1_CR1_SBS                              *((volatile unsigned int*)(0x423A01FCUL))
#define bM4_USART1_CR2_MPE                              *((volatile unsigned int*)(0x423A0200UL))
#define bM4_USART1_CR2_CLKC0                            *((volatile unsigned int*)(0x423A022CUL))
#define bM4_USART1_CR2_CLKC1                            *((volatile unsigned int*)(0x423A0230UL))
#define bM4_USART1_CR2_STOP                             *((volatile unsigned int*)(0x423A0234UL))
#define bM4_USART1_CR3_SCEN                             *((volatile unsigned int*)(0x423A0294UL))
#define bM4_USART1_CR3_CTSE                             *((volatile unsigned int*)(0x423A02A4UL))
#define bM4_USART1_CR3_BCN0                             *((volatile unsigned int*)(0x423A02D4UL))
#define bM4_USART1_CR3_BCN1                             *((volatile unsigned int*)(0x423A02D8UL))
#define bM4_USART1_CR3_BCN2                             *((volatile unsigned int*)(0x423A02DCUL))
#define bM4_USART1_PR_PSC0                              *((volatile unsigned int*)(0x423A0300UL))
#define bM4_USART1_PR_PSC1                              *((volatile unsigned int*)(0x423A0304UL))
#define bM4_USART2_SR_PE                                *((volatile unsigned int*)(0x423A8000UL))
#define bM4_USART2_SR_FE                                *((volatile unsigned int*)(0x423A8004UL))
#define bM4_USART2_SR_ORE                               *((volatile unsigned int*)(0x423A800CUL))
