CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_USBFS_GRSTCTL_TXFNUM2                       *((volatile unsigned int*)(0x43800220UL))
#define bM4_USBFS_GRSTCTL_TXFNUM3                       *((volatile unsigned int*)(0x43800224UL))
#define bM4_USBFS_GRSTCTL_TXFNUM4                       *((volatile unsigned int*)(0x43800228UL))
#define bM4_USBFS_GRSTCTL_DMAREQ                        *((volatile unsigned int*)(0x43800278UL))
#define bM4_USBFS_GRSTCTL_AHBIDL                        *((volatile unsigned int*)(0x4380027CUL))
#define bM4_USBFS_GINTSTS_CMOD                          *((volatile unsigned int*)(0x43800280UL))
#define bM4_USBFS_GINTSTS_MMIS                          *((volatile unsigned int*)(0x43800284UL))
#define bM4_USBFS_GINTSTS_SOF                           *((volatile unsigned int*)(0x4380028CUL))
#define bM4_USBFS_GINTSTS_RXFLNE                        *((volatile unsigned int*)(0x43800290UL))
#define bM4_USBFS_GINTSTS_NPTXFE                        *((volatile unsigned int*)(0x43800294UL))
#define bM4_USBFS_GINTSTS_GINAKEFF                      *((volatile unsigned int*)(0x43800298UL))
#define bM4_USBFS_GINTSTS_GOUTNAKEFF                    *((volatile unsigned int*)(0x4380029CUL))
#define bM4_USBFS_GINTSTS_ESUSP                         *((volatile unsigned int*)(0x438002A8UL))
#define bM4_USBFS_GINTSTS_USBSUSP                       *((volatile unsigned int*)(0x438002ACUL))
#define bM4_USBFS_GINTSTS_USBRST                        *((volatile unsigned int*)(0x438002B0UL))
#define bM4_USBFS_GINTSTS_ENUMDNE                       *((volatile unsigned int*)(0x438002B4UL))
#define bM4_USBFS_GINTSTS_ISOODRP                       *((volatile unsigned int*)(0x438002B8UL))
#define bM4_USBFS_GINTSTS_EOPF                          *((volatile unsigned int*)(0x438002BCUL))
#define bM4_USBFS_GINTSTS_IEPINT                        *((volatile unsigned int*)(0x438002C8UL))
#define bM4_USBFS_GINTSTS_OEPINT                        *((volatile unsigned int*)(0x438002CCUL))
#define bM4_USBFS_GINTSTS_IISOIXFR                      *((volatile unsigned int*)(0x438002D0UL))
#define bM4_USBFS_GINTSTS_IPXFR_INCOMPISO               *((volatile unsigned int*)(0x438002D4UL))
#define bM4_USBFS_GINTSTS_DATAFSUSP                     *((volatile unsigned int*)(0x438002D8UL))
#define bM4_USBFS_GINTSTS_HPRTINT                       *((volatile unsigned int*)(0x438002E0UL))
#define bM4_USBFS_GINTSTS_HCINT                         *((volatile unsigned int*)(0x438002E4UL))
#define bM4_USBFS_GINTSTS_PTXFE                         *((volatile unsigned int*)(0x438002E8UL))
#define bM4_USBFS_GINTSTS_CIDSCHG                       *((volatile unsigned int*)(0x438002F0UL))
#define bM4_USBFS_GINTSTS_DISCINT                       *((volatile unsigned int*)(0x438002F4UL))
#define bM4_USBFS_GINTSTS_VBUSVINT                      *((volatile unsigned int*)(0x438002F8UL))
#define bM4_USBFS_GINTSTS_WKUINT                        *((volatile unsigned int*)(0x438002FCUL))
#define bM4_USBFS_GINTMSK_MMISM                         *((volatile unsigned int*)(0x43800304UL))
#define bM4_USBFS_GINTMSK_SOFM                          *((volatile unsigned int*)(0x4380030CUL))
#define bM4_USBFS_GINTMSK_RXFNEM                        *((volatile unsigned int*)(0x43800310UL))
#define bM4_USBFS_GINTMSK_NPTXFEM                       *((volatile unsigned int*)(0x43800314UL))
#define bM4_USBFS_GINTMSK_GINAKEFFM                     *((volatile unsigned int*)(0x43800318UL))
#define bM4_USBFS_GINTMSK_GOUTNAKEFFM                   *((volatile unsigned int*)(0x4380031CUL))
#define bM4_USBFS_GINTMSK_ESUSPM                        *((volatile unsigned int*)(0x43800328UL))
#define bM4_USBFS_GINTMSK_USBSUSPM                      *((volatile unsigned int*)(0x4380032CUL))
#define bM4_USBFS_GINTMSK_USBRSTM                       *((volatile unsigned int*)(0x43800330UL))
#define bM4_USBFS_GINTMSK_ENUMDNEM                      *((volatile unsigned int*)(0x43800334UL))
#define bM4_USBFS_GINTMSK_ISOODRPM                      *((volatile unsigned int*)(0x43800338UL))
#define bM4_USBFS_GINTMSK_EOPFM                         *((volatile unsigned int*)(0x4380033CUL))
#define bM4_USBFS_GINTMSK_IEPIM                         *((volatile unsigned int*)(0x43800348UL))
#define bM4_USBFS_GINTMSK_OEPIM                         *((volatile unsigned int*)(0x4380034CUL))
#define bM4_USBFS_GINTMSK_IISOIXFRM                     *((volatile unsigned int*)(0x43800350UL))
#define bM4_USBFS_GINTMSK_IPXFRM_INCOMPISOOUTM          *((volatile unsigned int*)(0x43800354UL))
#define bM4_USBFS_GINTMSK_DATAFSUSPM                    *((volatile unsigned int*)(0x43800358UL))
#define bM4_USBFS_GINTMSK_HPRTIM                        *((volatile unsigned int*)(0x43800360UL))
#define bM4_USBFS_GINTMSK_HCIM                          *((volatile unsigned int*)(0x43800364UL))
#define bM4_USBFS_GINTMSK_PTXFEM                        *((volatile unsigned int*)(0x43800368UL))
#define bM4_USBFS_GINTMSK_CIDSCHGM                      *((volatile unsigned int*)(0x43800370UL))
#define bM4_USBFS_GINTMSK_DISCIM                        *((volatile unsigned int*)(0x43800374UL))
#define bM4_USBFS_GINTMSK_VBUSVIM                       *((volatile unsigned int*)(0x43800378UL))
#define bM4_USBFS_GINTMSK_WKUIM                         *((volatile unsigned int*)(0x4380037CUL))
#define bM4_USBFS_GRXSTSR_CHNUM_EPNUM0                  *((volatile unsigned int*)(0x43800380UL))
#define bM4_USBFS_GRXSTSR_CHNUM_EPNUM1                  *((volatile unsigned int*)(0x43800384UL))
#define bM4_USBFS_GRXSTSR_CHNUM_EPNUM2                  *((volatile unsigned int*)(0x43800388UL))
#define bM4_USBFS_GRXSTSR_CHNUM_EPNUM3                  *((volatile unsigned int*)(0x4380038CUL))
#define bM4_USBFS_GRXSTSR_BCNT0                         *((volatile unsigned int*)(0x43800390UL))
#define bM4_USBFS_GRXSTSR_BCNT1                         *((volatile unsigned int*)(0x43800394UL))
#define bM4_USBFS_GRXSTSR_BCNT2                         *((volatile unsigned int*)(0x43800398UL))
#define bM4_USBFS_GRXSTSR_BCNT3                         *((volatile unsigned int*)(0x4380039CUL))
#define bM4_USBFS_GRXSTSR_BCNT4                         *((volatile unsigned int*)(0x438003A0UL))
#define bM4_USBFS_GRXSTSR_BCNT5                         *((volatile unsigned int*)(0x438003A4UL))
#define bM4_USBFS_GRXSTSR_BCNT6                         *((volatile unsigned int*)(0x438003A8UL))
#define bM4_USBFS_GRXSTSR_BCNT7                         *((volatile unsigned int*)(0x438003ACUL))
#define bM4_USBFS_GRXSTSR_BCNT8                         *((volatile unsigned int*)(0x438003B0UL))
#define bM4_USBFS_GRXSTSR_BCNT9                         *((volatile unsigned int*)(0x438003B4UL))
#define bM4_USBFS_GRXSTSR_BCNT10                        *((volatile unsigned int*)(0x438003B8UL))
#define bM4_USBFS_GRXSTSR_DPID0                         *((volatile unsigned int*)(0x438003BCUL))
#define bM4_USBFS_GRXSTSR_DPID1                         *((volatile unsigned int*)(0x438003C0UL))
#define bM4_USBFS_GRXSTSR_PKTSTS0                       *((volatile unsigned int*)(0x438003C4UL))
#define bM4_USBFS_GRXSTSR_PKTSTS1                       *((volatile unsigned int*)(0x438003C8UL))
#define bM4_USBFS_GRXSTSR_PKTSTS2                       *((volatile unsigned int*)(0x438003CCUL))
#define bM4_USBFS_GRXSTSR_PKTSTS3                       *((volatile unsigned int*)(0x438003D0UL))
#define bM4_USBFS_GRXSTSP_CHNUM_EPNUM0                  *((volatile unsigned int*)(0x43800400UL))
#define bM4_USBFS_GRXSTSP_CHNUM_EPNUM1                  *((volatile unsigned int*)(0x43800404UL))
#define bM4_USBFS_GRXSTSP_CHNUM_EPNUM2                  *((volatile unsigned int*)(0x43800408UL))
#define bM4_USBFS_GRXSTSP_CHNUM_EPNUM3                  *((volatile unsigned int*)(0x4380040CUL))
#define bM4_USBFS_GRXSTSP_BCNT0                         *((volatile unsigned int*)(0x43800410UL))
#define bM4_USBFS_GRXSTSP_BCNT1                         *((volatile unsigned int*)(0x43800414UL))
#define bM4_USBFS_GRXSTSP_BCNT2                         *((volatile unsigned int*)(0x43800418UL))
#define bM4_USBFS_GRXSTSP_BCNT3                         *((volatile unsigned int*)(0x4380041CUL))
#define bM4_USBFS_GRXSTSP_BCNT4                         *((volatile unsigned int*)(0x43800420UL))
#define bM4_USBFS_GRXSTSP_BCNT5                         *((volatile unsigned int*)(0x43800424UL))
#define bM4_USBFS_GRXSTSP_BCNT6                         *((volatile unsigned int*)(0x43800428UL))
#define bM4_USBFS_GRXSTSP_BCNT7                         *((volatile unsigned int*)(0x4380042CUL))
#define bM4_USBFS_GRXSTSP_BCNT8                         *((volatile unsigned int*)(0x43800430UL))
#define bM4_USBFS_GRXSTSP_BCNT9                         *((volatile unsigned int*)(0x43800434UL))
#define bM4_USBFS_GRXSTSP_BCNT10                        *((volatile unsigned int*)(0x43800438UL))
#define bM4_USBFS_GRXSTSP_DPID0                         *((volatile unsigned int*)(0x4380043CUL))
#define bM4_USBFS_GRXSTSP_DPID1                         *((volatile unsigned int*)(0x43800440UL))
#define bM4_USBFS_GRXSTSP_PKTSTS0                       *((volatile unsigned int*)(0x43800444UL))
#define bM4_USBFS_GRXSTSP_PKTSTS1                       *((volatile unsigned int*)(0x43800448UL))
#define bM4_USBFS_GRXSTSP_PKTSTS2                       *((volatile unsigned int*)(0x4380044CUL))
#define bM4_USBFS_GRXSTSP_PKTSTS3                       *((volatile unsigned int*)(0x43800450UL))
#define bM4_USBFS_GRXFSIZ_RXFD0                         *((volatile unsigned int*)(0x43800480UL))
#define bM4_USBFS_GRXFSIZ_RXFD1                         *((volatile unsigned int*)(0x43800484UL))
#define bM4_USBFS_GRXFSIZ_RXFD2                         *((volatile unsigned int*)(0x43800488UL))
#define bM4_USBFS_GRXFSIZ_RXFD3                         *((volatile unsigned int*)(0x4380048CUL))
#define bM4_USBFS_GRXFSIZ_RXFD4                         *((volatile unsigned int*)(0x43800490UL))
#define bM4_USBFS_GRXFSIZ_RXFD5                         *((volatile unsigned int*)(0x43800494UL))
#define bM4_USBFS_GRXFSIZ_RXFD6                         *((volatile unsigned int*)(0x43800498UL))
#define bM4_USBFS_GRXFSIZ_RXFD7                         *((volatile unsigned int*)(0x4380049CUL))
#define bM4_USBFS_GRXFSIZ_RXFD8                         *((volatile unsigned int*)(0x438004A0UL))
#define bM4_USBFS_GRXFSIZ_RXFD9                         *((volatile unsigned int*)(0x438004A4UL))
#define bM4_USBFS_GRXFSIZ_RXFD10                        *((volatile unsigned int*)(0x438004A8UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA0                    *((volatile unsigned int*)(0x43800500UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA1                    *((volatile unsigned int*)(0x43800504UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA2                    *((volatile unsigned int*)(0x43800508UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA3                    *((volatile unsigned int*)(0x4380050CUL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA4                    *((volatile unsigned int*)(0x43800510UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA5                    *((volatile unsigned int*)(0x43800514UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA6                    *((volatile unsigned int*)(0x43800518UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA7                    *((volatile unsigned int*)(0x4380051CUL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA8                    *((volatile unsigned int*)(0x43800520UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA9                    *((volatile unsigned int*)(0x43800524UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA10                   *((volatile unsigned int*)(0x43800528UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA11                   *((volatile unsigned int*)(0x4380052CUL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA12                   *((volatile unsigned int*)(0x43800530UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA13                   *((volatile unsigned int*)(0x43800534UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA14                   *((volatile unsigned int*)(0x43800538UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFSA15                   *((volatile unsigned int*)(0x4380053CUL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD0                     *((volatile unsigned int*)(0x43800540UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD1                     *((volatile unsigned int*)(0x43800544UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD2                     *((volatile unsigned int*)(0x43800548UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD3                     *((volatile unsigned int*)(0x4380054CUL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD4                     *((volatile unsigned int*)(0x43800550UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD5                     *((volatile unsigned int*)(0x43800554UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD6                     *((volatile unsigned int*)(0x43800558UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD7                     *((volatile unsigned int*)(0x4380055CUL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD8                     *((volatile unsigned int*)(0x43800560UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD9                     *((volatile unsigned int*)(0x43800564UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD10                    *((volatile unsigned int*)(0x43800568UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD11                    *((volatile unsigned int*)(0x4380056CUL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD12                    *((volatile unsigned int*)(0x43800570UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD13                    *((volatile unsigned int*)(0x43800574UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD14                    *((volatile unsigned int*)(0x43800578UL))
#define bM4_USBFS_HNPTXFSIZ_NPTXFD15                    *((volatile unsigned int*)(0x4380057CUL))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV0                    *((volatile unsigned int*)(0x43800580UL))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV1                    *((volatile unsigned int*)(0x43800584UL))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV2                    *((volatile unsigned int*)(0x43800588UL))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV3                    *((volatile unsigned int*)(0x4380058CUL))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV4                    *((volatile unsigned int*)(0x43800590UL))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV5                    *((volatile unsigned int*)(0x43800594UL))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV6                    *((volatile unsigned int*)(0x43800598UL))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV7                    *((volatile unsigned int*)(0x4380059CUL))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV8                    *((volatile unsigned int*)(0x438005A0UL))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV9                    *((volatile unsigned int*)(0x438005A4UL))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV10                   *((volatile unsigned int*)(0x438005A8UL))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV11                   *((volatile unsigned int*)(0x438005ACUL))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV12                   *((volatile unsigned int*)(0x438005B0UL))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV13                   *((volatile unsigned int*)(0x438005B4UL))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV14                   *((volatile unsigned int*)(0x438005B8UL))
#define bM4_USBFS_HNPTXSTS_NPTXFSAV15                   *((volatile unsigned int*)(0x438005BCUL))
#define bM4_USBFS_HNPTXSTS_NPTQXSAV0                    *((volatile unsigned int*)(0x438005C0UL))
#define bM4_USBFS_HNPTXSTS_NPTQXSAV1                    *((volatile unsigned int*)(0x438005C4UL))
#define bM4_USBFS_HNPTXSTS_NPTQXSAV2                    *((volatile unsigned int*)(0x438005C8UL))
#define bM4_USBFS_HNPTXSTS_NPTQXSAV3                    *((volatile unsigned int*)(0x438005CCUL))
#define bM4_USBFS_HNPTXSTS_NPTQXSAV4                    *((volatile unsigned int*)(0x438005D0UL))
#define bM4_USBFS_HNPTXSTS_NPTQXSAV5                    *((volatile unsigned int*)(0x438005D4UL))
#define bM4_USBFS_HNPTXSTS_NPTQXSAV6                    *((volatile unsigned int*)(0x438005D8UL))
#define bM4_USBFS_HNPTXSTS_NPTQXSAV7                    *((volatile unsigned int*)(0x438005DCUL))
#define bM4_USBFS_HNPTXSTS_NPTXQTOP0                    *((volatile unsigned int*)(0x438005E0UL))
#define bM4_USBFS_HNPTXSTS_NPTXQTOP1                    *((volatile unsigned int*)(0x438005E4UL))
#define bM4_USBFS_HNPTXSTS_NPTXQTOP2                    *((volatile unsigned int*)(0x438005E8UL))
#define bM4_USBFS_HNPTXSTS_NPTXQTOP3                    *((volatile unsigned int*)(0x438005ECUL))
#define bM4_USBFS_HNPTXSTS_NPTXQTOP4                    *((volatile unsigned int*)(0x438005F0UL))
#define bM4_USBFS_HNPTXSTS_NPTXQTOP5                    *((volatile unsigned int*)(0x438005F4UL))
#define bM4_USBFS_HNPTXSTS_NPTXQTOP6                    *((volatile unsigned int*)(0x438005F8UL))
#define bM4_USBFS_HPTXFSIZ_PTXSA0                       *((volatile unsigned int*)(0x43802000UL))
#define bM4_USBFS_HPTXFSIZ_PTXSA1                       *((volatile unsigned int*)(0x43802004UL))
#define bM4_USBFS_HPTXFSIZ_PTXSA2                       *((volatile unsigned int*)(0x43802008UL))
#define bM4_USBFS_HPTXFSIZ_PTXSA3                       *((volatile unsigned int*)(0x4380200CUL))
#define bM4_USBFS_HPTXFSIZ_PTXSA4                       *((volatile unsigned int*)(0x43802010UL))
#define bM4_USBFS_HPTXFSIZ_PTXSA5                       *((volatile unsigned int*)(0x43802014UL))
#define bM4_USBFS_HPTXFSIZ_PTXSA6                       *((volatile unsigned int*)(0x43802018UL))
#define bM4_USBFS_HPTXFSIZ_PTXSA7                       *((volatile unsigned int*)(0x4380201CUL))
#define bM4_USBFS_HPTXFSIZ_PTXSA8                       *((volatile unsigned int*)(0x43802020UL))
#define bM4_USBFS_HPTXFSIZ_PTXSA9                       *((volatile unsigned int*)(0x43802024UL))
#define bM4_USBFS_HPTXFSIZ_PTXSA10                      *((volatile unsigned int*)(0x43802028UL))
#define bM4_USBFS_HPTXFSIZ_PTXSA11                      *((volatile unsigned int*)(0x4380202CUL))
#define bM4_USBFS_HPTXFSIZ_PTXFD0                       *((volatile unsigned int*)(0x43802040UL))
#define bM4_USBFS_HPTXFSIZ_PTXFD1                       *((volatile unsigned int*)(0x43802044UL))
#define bM4_USBFS_HPTXFSIZ_PTXFD2                       *((volatile unsigned int*)(0x43802048UL))
#define bM4_USBFS_HPTXFSIZ_PTXFD3                       *((volatile unsigned int*)(0x4380204CUL))
#define bM4_USBFS_HPTXFSIZ_PTXFD4                       *((volatile unsigned int*)(0x43802050UL))
#define bM4_USBFS_HPTXFSIZ_PTXFD5                       *((volatile unsigned int*)(0x43802054UL))
#define bM4_USBFS_HPTXFSIZ_PTXFD6                       *((volatile unsigned int*)(0x43802058UL))
#define bM4_USBFS_HPTXFSIZ_PTXFD7                       *((volatile unsigned int*)(0x4380205CUL))
#define bM4_USBFS_HPTXFSIZ_PTXFD8                       *((volatile unsigned int*)(0x43802060UL))
#define bM4_USBFS_HPTXFSIZ_PTXFD9                       *((volatile unsigned int*)(0x43802064UL))
#define bM4_USBFS_HPTXFSIZ_PTXFD10                      *((volatile unsigned int*)(0x43802068UL))
#define bM4_USBFS_DIEPTXF1_INEPTXSA0                    *((volatile unsigned int*)(0x43802080UL))
#define bM4_USBFS_DIEPTXF1_INEPTXSA1                    *((volatile unsigned int*)(0x43802084UL))
#define bM4_USBFS_DIEPTXF1_INEPTXSA2                    *((volatile unsigned int*)(0x43802088UL))
#define bM4_USBFS_DIEPTXF1_INEPTXSA3                    *((volatile unsigned int*)(0x4380208CUL))
#define bM4_USBFS_DIEPTXF1_INEPTXSA4                    *((volatile unsigned int*)(0x43802090UL))
#define bM4_USBFS_DIEPTXF1_INEPTXSA5                    *((volatile unsigned int*)(0x43802094UL))
#define bM4_USBFS_DIEPTXF1_INEPTXSA6                    *((volatile unsigned int*)(0x43802098UL))
#define bM4_USBFS_DIEPTXF1_INEPTXSA7                    *((volatile unsigned int*)(0x4380209CUL))
#define bM4_USBFS_DIEPTXF1_INEPTXSA8                    *((volatile unsigned int*)(0x438020A0UL))
#define bM4_USBFS_DIEPTXF1_INEPTXSA9                    *((volatile unsigned int*)(0x438020A4UL))
#define bM4_USBFS_DIEPTXF1_INEPTXSA10                   *((volatile unsigned int*)(0x438020A8UL))
#define bM4_USBFS_DIEPTXF1_INEPTXSA11                   *((volatile unsigned int*)(0x438020ACUL))
#define bM4_USBFS_DIEPTXF1_INEPTXFD0                    *((volatile unsigned int*)(0x438020C0UL))
#define bM4_USBFS_DIEPTXF1_INEPTXFD1                    *((volatile unsigned int*)(0x438020C4UL))
#define bM4_USBFS_DIEPTXF1_INEPTXFD2                    *((volatile unsigned int*)(0x438020C8UL))
#define bM4_USBFS_DIEPTXF1_INEPTXFD3                    *((volatile unsigned int*)(0x438020CCUL))
#define bM4_USBFS_DIEPTXF1_INEPTXFD4                    *((volatile unsigned int*)(0x438020D0UL))
#define bM4_USBFS_DIEPTXF1_INEPTXFD5                    *((volatile unsigned int*)(0x438020D4UL))
#define bM4_USBFS_DIEPTXF1_INEPTXFD6                    *((volatile unsigned int*)(0x438020D8UL))
#define bM4_USBFS_DIEPTXF1_INEPTXFD7                    *((volatile unsigned int*)(0x438020DCUL))
#define bM4_USBFS_DIEPTXF1_INEPTXFD8                    *((volatile unsigned int*)(0x438020E0UL))
#define bM4_USBFS_DIEPTXF1_INEPTXFD9                    *((volatile unsigned int*)(0x438020E4UL))
#define bM4_USBFS_DIEPTXF2_INEPTXSA0                    *((volatile unsigned int*)(0x43802100UL))
#define bM4_USBFS_DIEPTXF2_INEPTXSA1                    *((volatile unsigned int*)(0x43802104UL))
#define bM4_USBFS_DIEPTXF2_INEPTXSA2                    *((volatile unsigned int*)(0x43802108UL))
#define bM4_USBFS_DIEPTXF2_INEPTXSA3                    *((volatile unsigned int*)(0x4380210CUL))
#define bM4_USBFS_DIEPTXF2_INEPTXSA4                    *((volatile unsigned int*)(0x43802110UL))
#define bM4_USBFS_DIEPTXF2_INEPTXSA5                    *((volatile unsigned int*)(0x43802114UL))
#define bM4_USBFS_DIEPTXF2_INEPTXSA6                    *((volatile unsigned int*)(0x43802118UL))
#define bM4_USBFS_DIEPTXF2_INEPTXSA7                    *((volatile unsigned int*)(0x4380211CUL))
#define bM4_USBFS_DIEPTXF2_INEPTXSA8                    *((volatile unsigned int*)(0x43802120UL))
#define bM4_USBFS_DIEPTXF2_INEPTXSA9                    *((volatile unsigned int*)(0x43802124UL))
#define bM4_USBFS_DIEPTXF2_INEPTXSA10                   *((volatile unsigned int*)(0x43802128UL))
#define bM4_USBFS_DIEPTXF2_INEPTXSA11                   *((volatile unsigned int*)(0x4380212CUL))
#define bM4_USBFS_DIEPTXF2_INEPTXFD0                    *((volatile unsigned int*)(0x43802140UL))
#define bM4_USBFS_DIEPTXF2_INEPTXFD1                    *((volatile unsigned int*)(0x43802144UL))
#define bM4_USBFS_DIEPTXF2_INEPTXFD2                    *((volatile unsigned int*)(0x43802148UL))
#define bM4_USBFS_DIEPTXF2_INEPTXFD3                    *((volatile unsigned int*)(0x4380214CUL))
#define bM4_USBFS_DIEPTXF2_INEPTXFD4                    *((volatile unsigned int*)(0x43802150UL))
#define bM4_USBFS_DIEPTXF2_INEPTXFD5                    *((volatile unsigned int*)(0x43802154UL))
#define bM4_USBFS_DIEPTXF2_INEPTXFD6                    *((volatile unsigned int*)(0x43802158UL))
#define bM4_USBFS_DIEPTXF2_INEPTXFD7                    *((volatile unsigned int*)(0x4380215CUL))
#define bM4_USBFS_DIEPTXF2_INEPTXFD8                    *((volatile unsigned int*)(0x43802160UL))
#define bM4_USBFS_DIEPTXF2_INEPTXFD9                    *((volatile unsigned int*)(0x43802164UL))
#define bM4_USBFS_DIEPTXF3_INEPTXSA0                    *((volatile unsigned int*)(0x43802180UL))
#define bM4_USBFS_DIEPTXF3_INEPTXSA1                    *((volatile unsigned int*)(0x43802184UL))
#define bM4_USBFS_DIEPTXF3_INEPTXSA2                    *((volatile unsigned int*)(0x43802188UL))
#define bM4_USBFS_DIEPTXF3_INEPTXSA3                    *((volatile unsigned int*)(0x4380218CUL))
#define bM4_USBFS_DIEPTXF3_INEPTXSA4                    *((volatile unsigned int*)(0x43802190UL))
#define bM4_USBFS_DIEPTXF3_INEPTXSA5                    *((volatile unsigned int*)(0x43802194UL))
#define bM4_USBFS_DIEPTXF3_INEPTXSA6                    *((volatile unsigned int*)(0x43802198UL))
