CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_USBFS_DIEPTXF3_INEPTXSA7                    *((volatile unsigned int*)(0x4380219CUL))
#define bM4_USBFS_DIEPTXF3_INEPTXSA8                    *((volatile unsigned int*)(0x438021A0UL))
#define bM4_USBFS_DIEPTXF3_INEPTXSA9                    *((volatile unsigned int*)(0x438021A4UL))
#define bM4_USBFS_DIEPTXF3_INEPTXSA10                   *((volatile unsigned int*)(0x438021A8UL))
#define bM4_USBFS_DIEPTXF3_INEPTXSA11                   *((volatile unsigned int*)(0x438021ACUL))
#define bM4_USBFS_DIEPTXF3_INEPTXFD0                    *((volatile unsigned int*)(0x438021C0UL))
#define bM4_USBFS_DIEPTXF3_INEPTXFD1                    *((volatile unsigned int*)(0x438021C4UL))
#define bM4_USBFS_DIEPTXF3_INEPTXFD2                    *((volatile unsigned int*)(0x438021C8UL))
#define bM4_USBFS_DIEPTXF3_INEPTXFD3                    *((volatile unsigned int*)(0x438021CCUL))
#define bM4_USBFS_DIEPTXF3_INEPTXFD4                    *((volatile unsigned int*)(0x438021D0UL))
#define bM4_USBFS_DIEPTXF3_INEPTXFD5                    *((volatile unsigned int*)(0x438021D4UL))
#define bM4_USBFS_DIEPTXF3_INEPTXFD6                    *((volatile unsigned int*)(0x438021D8UL))
#define bM4_USBFS_DIEPTXF3_INEPTXFD7                    *((volatile unsigned int*)(0x438021DCUL))
#define bM4_USBFS_DIEPTXF3_INEPTXFD8                    *((volatile unsigned int*)(0x438021E0UL))
#define bM4_USBFS_DIEPTXF3_INEPTXFD9                    *((volatile unsigned int*)(0x438021E4UL))
#define bM4_USBFS_DIEPTXF4_INEPTXSA0                    *((volatile unsigned int*)(0x43802200UL))
#define bM4_USBFS_DIEPTXF4_INEPTXSA1                    *((volatile unsigned int*)(0x43802204UL))
#define bM4_USBFS_DIEPTXF4_INEPTXSA2                    *((volatile unsigned int*)(0x43802208UL))
#define bM4_USBFS_DIEPTXF4_INEPTXSA3                    *((volatile unsigned int*)(0x4380220CUL))
#define bM4_USBFS_DIEPTXF4_INEPTXSA4                    *((volatile unsigned int*)(0x43802210UL))
#define bM4_USBFS_DIEPTXF4_INEPTXSA5                    *((volatile unsigned int*)(0x43802214UL))
#define bM4_USBFS_DIEPTXF4_INEPTXSA6                    *((volatile unsigned int*)(0x43802218UL))
#define bM4_USBFS_DIEPTXF4_INEPTXSA7                    *((volatile unsigned int*)(0x4380221CUL))
#define bM4_USBFS_DIEPTXF4_INEPTXSA8                    *((volatile unsigned int*)(0x43802220UL))
#define bM4_USBFS_DIEPTXF4_INEPTXSA9                    *((volatile unsigned int*)(0x43802224UL))
#define bM4_USBFS_DIEPTXF4_INEPTXSA10                   *((volatile unsigned int*)(0x43802228UL))
#define bM4_USBFS_DIEPTXF4_INEPTXSA11                   *((volatile unsigned int*)(0x4380222CUL))
#define bM4_USBFS_DIEPTXF4_INEPTXFD0                    *((volatile unsigned int*)(0x43802240UL))
#define bM4_USBFS_DIEPTXF4_INEPTXFD1                    *((volatile unsigned int*)(0x43802244UL))
#define bM4_USBFS_DIEPTXF4_INEPTXFD2                    *((volatile unsigned int*)(0x43802248UL))
#define bM4_USBFS_DIEPTXF4_INEPTXFD3                    *((volatile unsigned int*)(0x4380224CUL))
#define bM4_USBFS_DIEPTXF4_INEPTXFD4                    *((volatile unsigned int*)(0x43802250UL))
#define bM4_USBFS_DIEPTXF4_INEPTXFD5                    *((volatile unsigned int*)(0x43802254UL))
#define bM4_USBFS_DIEPTXF4_INEPTXFD6                    *((volatile unsigned int*)(0x43802258UL))
#define bM4_USBFS_DIEPTXF4_INEPTXFD7                    *((volatile unsigned int*)(0x4380225CUL))
#define bM4_USBFS_DIEPTXF4_INEPTXFD8                    *((volatile unsigned int*)(0x43802260UL))
#define bM4_USBFS_DIEPTXF4_INEPTXFD9                    *((volatile unsigned int*)(0x43802264UL))
#define bM4_USBFS_DIEPTXF5_INEPTXSA0                    *((volatile unsigned int*)(0x43802280UL))
#define bM4_USBFS_DIEPTXF5_INEPTXSA1                    *((volatile unsigned int*)(0x43802284UL))
#define bM4_USBFS_DIEPTXF5_INEPTXSA2                    *((volatile unsigned int*)(0x43802288UL))
#define bM4_USBFS_DIEPTXF5_INEPTXSA3                    *((volatile unsigned int*)(0x4380228CUL))
#define bM4_USBFS_DIEPTXF5_INEPTXSA4                    *((volatile unsigned int*)(0x43802290UL))
#define bM4_USBFS_DIEPTXF5_INEPTXSA5                    *((volatile unsigned int*)(0x43802294UL))
#define bM4_USBFS_DIEPTXF5_INEPTXSA6                    *((volatile unsigned int*)(0x43802298UL))
#define bM4_USBFS_DIEPTXF5_INEPTXSA7                    *((volatile unsigned int*)(0x4380229CUL))
#define bM4_USBFS_DIEPTXF5_INEPTXSA8                    *((volatile unsigned int*)(0x438022A0UL))
#define bM4_USBFS_DIEPTXF5_INEPTXSA9                    *((volatile unsigned int*)(0x438022A4UL))
#define bM4_USBFS_DIEPTXF5_INEPTXSA10                   *((volatile unsigned int*)(0x438022A8UL))
#define bM4_USBFS_DIEPTXF5_INEPTXSA11                   *((volatile unsigned int*)(0x438022ACUL))
#define bM4_USBFS_DIEPTXF5_INEPTXFD0                    *((volatile unsigned int*)(0x438022C0UL))
#define bM4_USBFS_DIEPTXF5_INEPTXFD1                    *((volatile unsigned int*)(0x438022C4UL))
#define bM4_USBFS_DIEPTXF5_INEPTXFD2                    *((volatile unsigned int*)(0x438022C8UL))
#define bM4_USBFS_DIEPTXF5_INEPTXFD3                    *((volatile unsigned int*)(0x438022CCUL))
#define bM4_USBFS_DIEPTXF5_INEPTXFD4                    *((volatile unsigned int*)(0x438022D0UL))
#define bM4_USBFS_DIEPTXF5_INEPTXFD5                    *((volatile unsigned int*)(0x438022D4UL))
#define bM4_USBFS_DIEPTXF5_INEPTXFD6                    *((volatile unsigned int*)(0x438022D8UL))
#define bM4_USBFS_DIEPTXF5_INEPTXFD7                    *((volatile unsigned int*)(0x438022DCUL))
#define bM4_USBFS_DIEPTXF5_INEPTXFD8                    *((volatile unsigned int*)(0x438022E0UL))
#define bM4_USBFS_DIEPTXF5_INEPTXFD9                    *((volatile unsigned int*)(0x438022E4UL))
#define bM4_USBFS_HCFG_FSLSPCS0                         *((volatile unsigned int*)(0x43808000UL))
#define bM4_USBFS_HCFG_FSLSPCS1                         *((volatile unsigned int*)(0x43808004UL))
#define bM4_USBFS_HCFG_FSLSS                            *((volatile unsigned int*)(0x43808008UL))
#define bM4_USBFS_HFIR_FRIVL0                           *((volatile unsigned int*)(0x43808080UL))
#define bM4_USBFS_HFIR_FRIVL1                           *((volatile unsigned int*)(0x43808084UL))
#define bM4_USBFS_HFIR_FRIVL2                           *((volatile unsigned int*)(0x43808088UL))
#define bM4_USBFS_HFIR_FRIVL3                           *((volatile unsigned int*)(0x4380808CUL))
#define bM4_USBFS_HFIR_FRIVL4                           *((volatile unsigned int*)(0x43808090UL))
#define bM4_USBFS_HFIR_FRIVL5                           *((volatile unsigned int*)(0x43808094UL))
#define bM4_USBFS_HFIR_FRIVL6                           *((volatile unsigned int*)(0x43808098UL))
#define bM4_USBFS_HFIR_FRIVL7                           *((volatile unsigned int*)(0x4380809CUL))
#define bM4_USBFS_HFIR_FRIVL8                           *((volatile unsigned int*)(0x438080A0UL))
#define bM4_USBFS_HFIR_FRIVL9                           *((volatile unsigned int*)(0x438080A4UL))
#define bM4_USBFS_HFIR_FRIVL10                          *((volatile unsigned int*)(0x438080A8UL))
#define bM4_USBFS_HFIR_FRIVL11                          *((volatile unsigned int*)(0x438080ACUL))
#define bM4_USBFS_HFIR_FRIVL12                          *((volatile unsigned int*)(0x438080B0UL))
#define bM4_USBFS_HFIR_FRIVL13                          *((volatile unsigned int*)(0x438080B4UL))
#define bM4_USBFS_HFIR_FRIVL14                          *((volatile unsigned int*)(0x438080B8UL))
#define bM4_USBFS_HFIR_FRIVL15                          *((volatile unsigned int*)(0x438080BCUL))
#define bM4_USBFS_HFNUM_FRNUM0                          *((volatile unsigned int*)(0x43808100UL))
#define bM4_USBFS_HFNUM_FRNUM1                          *((volatile unsigned int*)(0x43808104UL))
#define bM4_USBFS_HFNUM_FRNUM2                          *((volatile unsigned int*)(0x43808108UL))
#define bM4_USBFS_HFNUM_FRNUM3                          *((volatile unsigned int*)(0x4380810CUL))
#define bM4_USBFS_HFNUM_FRNUM4                          *((volatile unsigned int*)(0x43808110UL))
#define bM4_USBFS_HFNUM_FRNUM5                          *((volatile unsigned int*)(0x43808114UL))
#define bM4_USBFS_HFNUM_FRNUM6                          *((volatile unsigned int*)(0x43808118UL))
#define bM4_USBFS_HFNUM_FRNUM7                          *((volatile unsigned int*)(0x4380811CUL))
#define bM4_USBFS_HFNUM_FRNUM8                          *((volatile unsigned int*)(0x43808120UL))
#define bM4_USBFS_HFNUM_FRNUM9                          *((volatile unsigned int*)(0x43808124UL))
#define bM4_USBFS_HFNUM_FRNUM10                         *((volatile unsigned int*)(0x43808128UL))
#define bM4_USBFS_HFNUM_FRNUM11                         *((volatile unsigned int*)(0x4380812CUL))
#define bM4_USBFS_HFNUM_FRNUM12                         *((volatile unsigned int*)(0x43808130UL))
#define bM4_USBFS_HFNUM_FRNUM13                         *((volatile unsigned int*)(0x43808134UL))
#define bM4_USBFS_HFNUM_FRNUM14                         *((volatile unsigned int*)(0x43808138UL))
#define bM4_USBFS_HFNUM_FRNUM15                         *((volatile unsigned int*)(0x4380813CUL))
#define bM4_USBFS_HFNUM_FTREM0                          *((volatile unsigned int*)(0x43808140UL))
#define bM4_USBFS_HFNUM_FTREM1                          *((volatile unsigned int*)(0x43808144UL))
#define bM4_USBFS_HFNUM_FTREM2                          *((volatile unsigned int*)(0x43808148UL))
#define bM4_USBFS_HFNUM_FTREM3                          *((volatile unsigned int*)(0x4380814CUL))
#define bM4_USBFS_HFNUM_FTREM4                          *((volatile unsigned int*)(0x43808150UL))
#define bM4_USBFS_HFNUM_FTREM5                          *((volatile unsigned int*)(0x43808154UL))
#define bM4_USBFS_HFNUM_FTREM6                          *((volatile unsigned int*)(0x43808158UL))
#define bM4_USBFS_HFNUM_FTREM7                          *((volatile unsigned int*)(0x4380815CUL))
#define bM4_USBFS_HFNUM_FTREM8                          *((volatile unsigned int*)(0x43808160UL))
#define bM4_USBFS_HFNUM_FTREM9                          *((volatile unsigned int*)(0x43808164UL))
#define bM4_USBFS_HFNUM_FTREM10                         *((volatile unsigned int*)(0x43808168UL))
#define bM4_USBFS_HFNUM_FTREM11                         *((volatile unsigned int*)(0x4380816CUL))
#define bM4_USBFS_HFNUM_FTREM12                         *((volatile unsigned int*)(0x43808170UL))
#define bM4_USBFS_HFNUM_FTREM13                         *((volatile unsigned int*)(0x43808174UL))
#define bM4_USBFS_HFNUM_FTREM14                         *((volatile unsigned int*)(0x43808178UL))
#define bM4_USBFS_HFNUM_FTREM15                         *((volatile unsigned int*)(0x4380817CUL))
#define bM4_USBFS_HPTXSTS_PTXFSAVL0                     *((volatile unsigned int*)(0x43808200UL))
#define bM4_USBFS_HPTXSTS_PTXFSAVL1                     *((volatile unsigned int*)(0x43808204UL))
#define bM4_USBFS_HPTXSTS_PTXFSAVL2                     *((volatile unsigned int*)(0x43808208UL))
#define bM4_USBFS_HPTXSTS_PTXFSAVL3                     *((volatile unsigned int*)(0x4380820CUL))
#define bM4_USBFS_HPTXSTS_PTXFSAVL4                     *((volatile unsigned int*)(0x43808210UL))
#define bM4_USBFS_HPTXSTS_PTXFSAVL5                     *((volatile unsigned int*)(0x43808214UL))
#define bM4_USBFS_HPTXSTS_PTXFSAVL6                     *((volatile unsigned int*)(0x43808218UL))
#define bM4_USBFS_HPTXSTS_PTXFSAVL7                     *((volatile unsigned int*)(0x4380821CUL))
#define bM4_USBFS_HPTXSTS_PTXFSAVL8                     *((volatile unsigned int*)(0x43808220UL))
#define bM4_USBFS_HPTXSTS_PTXFSAVL9                     *((volatile unsigned int*)(0x43808224UL))
#define bM4_USBFS_HPTXSTS_PTXFSAVL10                    *((volatile unsigned int*)(0x43808228UL))
#define bM4_USBFS_HPTXSTS_PTXFSAVL11                    *((volatile unsigned int*)(0x4380822CUL))
#define bM4_USBFS_HPTXSTS_PTXFSAVL12                    *((volatile unsigned int*)(0x43808230UL))
#define bM4_USBFS_HPTXSTS_PTXFSAVL13                    *((volatile unsigned int*)(0x43808234UL))
#define bM4_USBFS_HPTXSTS_PTXFSAVL14                    *((volatile unsigned int*)(0x43808238UL))
#define bM4_USBFS_HPTXSTS_PTXFSAVL15                    *((volatile unsigned int*)(0x4380823CUL))
#define bM4_USBFS_HPTXSTS_PTXQSAV0                      *((volatile unsigned int*)(0x43808240UL))
#define bM4_USBFS_HPTXSTS_PTXQSAV1                      *((volatile unsigned int*)(0x43808244UL))
#define bM4_USBFS_HPTXSTS_PTXQSAV2                      *((volatile unsigned int*)(0x43808248UL))
#define bM4_USBFS_HPTXSTS_PTXQSAV3                      *((volatile unsigned int*)(0x4380824CUL))
#define bM4_USBFS_HPTXSTS_PTXQSAV4                      *((volatile unsigned int*)(0x43808250UL))
#define bM4_USBFS_HPTXSTS_PTXQSAV5                      *((volatile unsigned int*)(0x43808254UL))
#define bM4_USBFS_HPTXSTS_PTXQSAV6                      *((volatile unsigned int*)(0x43808258UL))
#define bM4_USBFS_HPTXSTS_PTXQSAV7                      *((volatile unsigned int*)(0x4380825CUL))
#define bM4_USBFS_HPTXSTS_PTXQTOP0                      *((volatile unsigned int*)(0x43808260UL))
#define bM4_USBFS_HPTXSTS_PTXQTOP1                      *((volatile unsigned int*)(0x43808264UL))
#define bM4_USBFS_HPTXSTS_PTXQTOP2                      *((volatile unsigned int*)(0x43808268UL))
#define bM4_USBFS_HPTXSTS_PTXQTOP3                      *((volatile unsigned int*)(0x4380826CUL))
#define bM4_USBFS_HPTXSTS_PTXQTOP4                      *((volatile unsigned int*)(0x43808270UL))
#define bM4_USBFS_HPTXSTS_PTXQTOP5                      *((volatile unsigned int*)(0x43808274UL))
#define bM4_USBFS_HPTXSTS_PTXQTOP6                      *((volatile unsigned int*)(0x43808278UL))
#define bM4_USBFS_HPTXSTS_PTXQTOP7                      *((volatile unsigned int*)(0x4380827CUL))
#define bM4_USBFS_HAINT_HAINT0                          *((volatile unsigned int*)(0x43808280UL))
#define bM4_USBFS_HAINT_HAINT1                          *((volatile unsigned int*)(0x43808284UL))
#define bM4_USBFS_HAINT_HAINT2                          *((volatile unsigned int*)(0x43808288UL))
#define bM4_USBFS_HAINT_HAINT3                          *((volatile unsigned int*)(0x4380828CUL))
#define bM4_USBFS_HAINT_HAINT4                          *((volatile unsigned int*)(0x43808290UL))
#define bM4_USBFS_HAINT_HAINT5                          *((volatile unsigned int*)(0x43808294UL))
#define bM4_USBFS_HAINT_HAINT6                          *((volatile unsigned int*)(0x43808298UL))
#define bM4_USBFS_HAINT_HAINT7                          *((volatile unsigned int*)(0x4380829CUL))
#define bM4_USBFS_HAINT_HAINT8                          *((volatile unsigned int*)(0x438082A0UL))
#define bM4_USBFS_HAINT_HAINT9                          *((volatile unsigned int*)(0x438082A4UL))
#define bM4_USBFS_HAINT_HAINT10                         *((volatile unsigned int*)(0x438082A8UL))
#define bM4_USBFS_HAINT_HAINT11                         *((volatile unsigned int*)(0x438082ACUL))
#define bM4_USBFS_HAINTMSK_HAINTM0                      *((volatile unsigned int*)(0x43808300UL))
#define bM4_USBFS_HAINTMSK_HAINTM1                      *((volatile unsigned int*)(0x43808304UL))
#define bM4_USBFS_HAINTMSK_HAINTM2                      *((volatile unsigned int*)(0x43808308UL))
#define bM4_USBFS_HAINTMSK_HAINTM3                      *((volatile unsigned int*)(0x4380830CUL))
#define bM4_USBFS_HAINTMSK_HAINTM4                      *((volatile unsigned int*)(0x43808310UL))
#define bM4_USBFS_HAINTMSK_HAINTM5                      *((volatile unsigned int*)(0x43808314UL))
#define bM4_USBFS_HAINTMSK_HAINTM6                      *((volatile unsigned int*)(0x43808318UL))
#define bM4_USBFS_HAINTMSK_HAINTM7                      *((volatile unsigned int*)(0x4380831CUL))
#define bM4_USBFS_HAINTMSK_HAINTM8                      *((volatile unsigned int*)(0x43808320UL))
#define bM4_USBFS_HAINTMSK_HAINTM9                      *((volatile unsigned int*)(0x43808324UL))
#define bM4_USBFS_HAINTMSK_HAINTM10                     *((volatile unsigned int*)(0x43808328UL))
#define bM4_USBFS_HAINTMSK_HAINTM11                     *((volatile unsigned int*)(0x4380832CUL))
#define bM4_USBFS_HPRT_PCSTS                            *((volatile unsigned int*)(0x43808800UL))
#define bM4_USBFS_HPRT_PCDET                            *((volatile unsigned int*)(0x43808804UL))
#define bM4_USBFS_HPRT_PENA                             *((volatile unsigned int*)(0x43808808UL))
#define bM4_USBFS_HPRT_PENCHNG                          *((volatile unsigned int*)(0x4380880CUL))
#define bM4_USBFS_HPRT_PRES                             *((volatile unsigned int*)(0x43808818UL))
#define bM4_USBFS_HPRT_PSUSP                            *((volatile unsigned int*)(0x4380881CUL))
#define bM4_USBFS_HPRT_PRST                             *((volatile unsigned int*)(0x43808820UL))
#define bM4_USBFS_HPRT_PLSTS0                           *((volatile unsigned int*)(0x43808828UL))
#define bM4_USBFS_HPRT_PLSTS1                           *((volatile unsigned int*)(0x4380882CUL))
#define bM4_USBFS_HPRT_PWPR                             *((volatile unsigned int*)(0x43808830UL))
#define bM4_USBFS_HPRT_PSPD0                            *((volatile unsigned int*)(0x43808844UL))
#define bM4_USBFS_HPRT_PSPD1                            *((volatile unsigned int*)(0x43808848UL))
#define bM4_USBFS_HCCHAR0_MPSIZ0                        *((volatile unsigned int*)(0x4380A000UL))
#define bM4_USBFS_HCCHAR0_MPSIZ1                        *((volatile unsigned int*)(0x4380A004UL))
#define bM4_USBFS_HCCHAR0_MPSIZ2                        *((volatile unsigned int*)(0x4380A008UL))
#define bM4_USBFS_HCCHAR0_MPSIZ3                        *((volatile unsigned int*)(0x4380A00CUL))
#define bM4_USBFS_HCCHAR0_MPSIZ4                        *((volatile unsigned int*)(0x4380A010UL))
#define bM4_USBFS_HCCHAR0_MPSIZ5                        *((volatile unsigned int*)(0x4380A014UL))
#define bM4_USBFS_HCCHAR0_MPSIZ6                        *((volatile unsigned int*)(0x4380A018UL))
#define bM4_USBFS_HCCHAR0_MPSIZ7                        *((volatile unsigned int*)(0x4380A01CUL))
#define bM4_USBFS_HCCHAR0_MPSIZ8                        *((volatile unsigned int*)(0x4380A020UL))
#define bM4_USBFS_HCCHAR0_MPSIZ9                        *((volatile unsigned int*)(0x4380A024UL))
#define bM4_USBFS_HCCHAR0_MPSIZ10                       *((volatile unsigned int*)(0x4380A028UL))
#define bM4_USBFS_HCCHAR0_EPNUM0                        *((volatile unsigned int*)(0x4380A02CUL))
#define bM4_USBFS_HCCHAR0_EPNUM1                        *((volatile unsigned int*)(0x4380A030UL))
#define bM4_USBFS_HCCHAR0_EPNUM2                        *((volatile unsigned int*)(0x4380A034UL))
#define bM4_USBFS_HCCHAR0_EPNUM3                        *((volatile unsigned int*)(0x4380A038UL))
#define bM4_USBFS_HCCHAR0_EPDIR                         *((volatile unsigned int*)(0x4380A03CUL))
#define bM4_USBFS_HCCHAR0_LSDEV                         *((volatile unsigned int*)(0x4380A044UL))
#define bM4_USBFS_HCCHAR0_EPTYP0                        *((volatile unsigned int*)(0x4380A048UL))
#define bM4_USBFS_HCCHAR0_EPTYP1                        *((volatile unsigned int*)(0x4380A04CUL))
#define bM4_USBFS_HCCHAR0_DAD0                          *((volatile unsigned int*)(0x4380A058UL))
#define bM4_USBFS_HCCHAR0_DAD1                          *((volatile unsigned int*)(0x4380A05CUL))
#define bM4_USBFS_HCCHAR0_DAD2                          *((volatile unsigned int*)(0x4380A060UL))
#define bM4_USBFS_HCCHAR0_DAD3                          *((volatile unsigned int*)(0x4380A064UL))
#define bM4_USBFS_HCCHAR0_DAD4                          *((volatile unsigned int*)(0x4380A068UL))
#define bM4_USBFS_HCCHAR0_DAD5                          *((volatile unsigned int*)(0x4380A06CUL))
#define bM4_USBFS_HCCHAR0_DAD6                          *((volatile unsigned int*)(0x4380A070UL))
#define bM4_USBFS_HCCHAR0_ODDFRM                        *((volatile unsigned int*)(0x4380A074UL))
#define bM4_USBFS_HCCHAR0_CHDIS                         *((volatile unsigned int*)(0x4380A078UL))
#define bM4_USBFS_HCCHAR0_CHENA                         *((volatile unsigned int*)(0x4380A07CUL))
#define bM4_USBFS_HCINT0_XFRC                           *((volatile unsigned int*)(0x4380A100UL))
#define bM4_USBFS_HCINT0_CHH                            *((volatile unsigned int*)(0x4380A104UL))
#define bM4_USBFS_HCINT0_STALL                          *((volatile unsigned int*)(0x4380A10CUL))
#define bM4_USBFS_HCINT0_NAK                            *((volatile unsigned int*)(0x4380A110UL))
#define bM4_USBFS_HCINT0_ACK                            *((volatile unsigned int*)(0x4380A114UL))
#define bM4_USBFS_HCINT0_TXERR                          *((volatile unsigned int*)(0x4380A11CUL))
#define bM4_USBFS_HCINT0_BBERR                          *((volatile unsigned int*)(0x4380A120UL))
#define bM4_USBFS_HCINT0_FRMOR                          *((volatile unsigned int*)(0x4380A124UL))
#define bM4_USBFS_HCINT0_DTERR                          *((volatile unsigned int*)(0x4380A128UL))
#define bM4_USBFS_HCINTMSK0_XFRCM                       *((volatile unsigned int*)(0x4380A180UL))
#define bM4_USBFS_HCINTMSK0_CHHM                        *((volatile unsigned int*)(0x4380A184UL))
#define bM4_USBFS_HCINTMSK0_STALLM                      *((volatile unsigned int*)(0x4380A18CUL))
#define bM4_USBFS_HCINTMSK0_NAKM                        *((volatile unsigned int*)(0x4380A190UL))
#define bM4_USBFS_HCINTMSK0_ACKM                        *((volatile unsigned int*)(0x4380A194UL))
#define bM4_USBFS_HCINTMSK0_TXERRM                      *((volatile unsigned int*)(0x4380A19CUL))
#define bM4_USBFS_HCINTMSK0_BBERRM                      *((volatile unsigned int*)(0x4380A1A0UL))
#define bM4_USBFS_HCINTMSK0_FRMORM                      *((volatile unsigned int*)(0x4380A1A4UL))
#define bM4_USBFS_HCINTMSK0_DTERRM                      *((volatile unsigned int*)(0x4380A1A8UL))
#define bM4_USBFS_HCTSIZ0_XFRSIZ0                       *((volatile unsigned int*)(0x4380A200UL))
#define bM4_USBFS_HCTSIZ0_XFRSIZ1                       *((volatile unsigned int*)(0x4380A204UL))
#define bM4_USBFS_HCTSIZ0_XFRSIZ2                       *((volatile unsigned int*)(0x4380A208UL))
#define bM4_USBFS_HCTSIZ0_XFRSIZ3                       *((volatile unsigned int*)(0x4380A20CUL))
#define bM4_USBFS_HCTSIZ0_XFRSIZ4                       *((volatile unsigned int*)(0x4380A210UL))
#define bM4_USBFS_HCTSIZ0_XFRSIZ5                       *((volatile unsigned int*)(0x4380A214UL))
#define bM4_USBFS_HCTSIZ0_XFRSIZ6                       *((volatile unsigned int*)(0x4380A218UL))
#define bM4_USBFS_HCTSIZ0_XFRSIZ7                       *((volatile unsigned int*)(0x4380A21CUL))
#define bM4_USBFS_HCTSIZ0_XFRSIZ8                       *((volatile unsigned int*)(0x4380A220UL))
#define bM4_USBFS_HCTSIZ0_XFRSIZ9                       *((volatile unsigned int*)(0x4380A224UL))
#define bM4_USBFS_HCTSIZ0_XFRSIZ10                      *((volatile unsigned int*)(0x4380A228UL))
#define bM4_USBFS_HCTSIZ0_XFRSIZ11                      *((volatile unsigned int*)(0x4380A22CUL))
#define bM4_USBFS_HCTSIZ0_XFRSIZ12                      *((volatile unsigned int*)(0x4380A230UL))
#define bM4_USBFS_HCTSIZ0_XFRSIZ13                      *((volatile unsigned int*)(0x4380A234UL))
#define bM4_USBFS_HCTSIZ0_XFRSIZ14                      *((volatile unsigned int*)(0x4380A238UL))
#define bM4_USBFS_HCTSIZ0_XFRSIZ15                      *((volatile unsigned int*)(0x4380A23CUL))
#define bM4_USBFS_HCTSIZ0_XFRSIZ16                      *((volatile unsigned int*)(0x4380A240UL))
#define bM4_USBFS_HCTSIZ0_XFRSIZ17                      *((volatile unsigned int*)(0x4380A244UL))
#define bM4_USBFS_HCTSIZ0_XFRSIZ18                      *((volatile unsigned int*)(0x4380A248UL))
