CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_USBFS_HCTSIZ3_DPID0                         *((volatile unsigned int*)(0x4380AE74UL))
#define bM4_USBFS_HCTSIZ3_DPID1                         *((volatile unsigned int*)(0x4380AE78UL))
#define bM4_USBFS_HCCHAR4_MPSIZ0                        *((volatile unsigned int*)(0x4380B000UL))
#define bM4_USBFS_HCCHAR4_MPSIZ1                        *((volatile unsigned int*)(0x4380B004UL))
#define bM4_USBFS_HCCHAR4_MPSIZ2                        *((volatile unsigned int*)(0x4380B008UL))
#define bM4_USBFS_HCCHAR4_MPSIZ3                        *((volatile unsigned int*)(0x4380B00CUL))
#define bM4_USBFS_HCCHAR4_MPSIZ4                        *((volatile unsigned int*)(0x4380B010UL))
#define bM4_USBFS_HCCHAR4_MPSIZ5                        *((volatile unsigned int*)(0x4380B014UL))
#define bM4_USBFS_HCCHAR4_MPSIZ6                        *((volatile unsigned int*)(0x4380B018UL))
#define bM4_USBFS_HCCHAR4_MPSIZ7                        *((volatile unsigned int*)(0x4380B01CUL))
#define bM4_USBFS_HCCHAR4_MPSIZ8                        *((volatile unsigned int*)(0x4380B020UL))
#define bM4_USBFS_HCCHAR4_MPSIZ9                        *((volatile unsigned int*)(0x4380B024UL))
#define bM4_USBFS_HCCHAR4_MPSIZ10                       *((volatile unsigned int*)(0x4380B028UL))
#define bM4_USBFS_HCCHAR4_EPNUM0                        *((volatile unsigned int*)(0x4380B02CUL))
#define bM4_USBFS_HCCHAR4_EPNUM1                        *((volatile unsigned int*)(0x4380B030UL))
#define bM4_USBFS_HCCHAR4_EPNUM2                        *((volatile unsigned int*)(0x4380B034UL))
#define bM4_USBFS_HCCHAR4_EPNUM3                        *((volatile unsigned int*)(0x4380B038UL))
#define bM4_USBFS_HCCHAR4_EPDIR                         *((volatile unsigned int*)(0x4380B03CUL))
#define bM4_USBFS_HCCHAR4_LSDEV                         *((volatile unsigned int*)(0x4380B044UL))
#define bM4_USBFS_HCCHAR4_EPTYP0                        *((volatile unsigned int*)(0x4380B048UL))
#define bM4_USBFS_HCCHAR4_EPTYP1                        *((volatile unsigned int*)(0x4380B04CUL))
#define bM4_USBFS_HCCHAR4_DAD0                          *((volatile unsigned int*)(0x4380B058UL))
#define bM4_USBFS_HCCHAR4_DAD1                          *((volatile unsigned int*)(0x4380B05CUL))
#define bM4_USBFS_HCCHAR4_DAD2                          *((volatile unsigned int*)(0x4380B060UL))
#define bM4_USBFS_HCCHAR4_DAD3                          *((volatile unsigned int*)(0x4380B064UL))
#define bM4_USBFS_HCCHAR4_DAD4                          *((volatile unsigned int*)(0x4380B068UL))
#define bM4_USBFS_HCCHAR4_DAD5                          *((volatile unsigned int*)(0x4380B06CUL))
#define bM4_USBFS_HCCHAR4_DAD6                          *((volatile unsigned int*)(0x4380B070UL))
#define bM4_USBFS_HCCHAR4_ODDFRM                        *((volatile unsigned int*)(0x4380B074UL))
#define bM4_USBFS_HCCHAR4_CHDIS                         *((volatile unsigned int*)(0x4380B078UL))
#define bM4_USBFS_HCCHAR4_CHENA                         *((volatile unsigned int*)(0x4380B07CUL))
#define bM4_USBFS_HCINT4_XFRC                           *((volatile unsigned int*)(0x4380B100UL))
#define bM4_USBFS_HCINT4_CHH                            *((volatile unsigned int*)(0x4380B104UL))
#define bM4_USBFS_HCINT4_STALL                          *((volatile unsigned int*)(0x4380B10CUL))
#define bM4_USBFS_HCINT4_NAK                            *((volatile unsigned int*)(0x4380B110UL))
#define bM4_USBFS_HCINT4_ACK                            *((volatile unsigned int*)(0x4380B114UL))
#define bM4_USBFS_HCINT4_TXERR                          *((volatile unsigned int*)(0x4380B11CUL))
#define bM4_USBFS_HCINT4_BBERR                          *((volatile unsigned int*)(0x4380B120UL))
#define bM4_USBFS_HCINT4_FRMOR                          *((volatile unsigned int*)(0x4380B124UL))
#define bM4_USBFS_HCINT4_DTERR                          *((volatile unsigned int*)(0x4380B128UL))
#define bM4_USBFS_HCINTMSK4_XFRCM                       *((volatile unsigned int*)(0x4380B180UL))
#define bM4_USBFS_HCINTMSK4_CHHM                        *((volatile unsigned int*)(0x4380B184UL))
#define bM4_USBFS_HCINTMSK4_STALLM                      *((volatile unsigned int*)(0x4380B18CUL))
#define bM4_USBFS_HCINTMSK4_NAKM                        *((volatile unsigned int*)(0x4380B190UL))
#define bM4_USBFS_HCINTMSK4_ACKM                        *((volatile unsigned int*)(0x4380B194UL))
#define bM4_USBFS_HCINTMSK4_TXERRM                      *((volatile unsigned int*)(0x4380B19CUL))
#define bM4_USBFS_HCINTMSK4_BBERRM                      *((volatile unsigned int*)(0x4380B1A0UL))
#define bM4_USBFS_HCINTMSK4_FRMORM                      *((volatile unsigned int*)(0x4380B1A4UL))
#define bM4_USBFS_HCINTMSK4_DTERRM                      *((volatile unsigned int*)(0x4380B1A8UL))
#define bM4_USBFS_HCTSIZ4_XFRSIZ0                       *((volatile unsigned int*)(0x4380B200UL))
#define bM4_USBFS_HCTSIZ4_XFRSIZ1                       *((volatile unsigned int*)(0x4380B204UL))
#define bM4_USBFS_HCTSIZ4_XFRSIZ2                       *((volatile unsigned int*)(0x4380B208UL))
#define bM4_USBFS_HCTSIZ4_XFRSIZ3                       *((volatile unsigned int*)(0x4380B20CUL))
#define bM4_USBFS_HCTSIZ4_XFRSIZ4                       *((volatile unsigned int*)(0x4380B210UL))
#define bM4_USBFS_HCTSIZ4_XFRSIZ5                       *((volatile unsigned int*)(0x4380B214UL))
#define bM4_USBFS_HCTSIZ4_XFRSIZ6                       *((volatile unsigned int*)(0x4380B218UL))
#define bM4_USBFS_HCTSIZ4_XFRSIZ7                       *((volatile unsigned int*)(0x4380B21CUL))
#define bM4_USBFS_HCTSIZ4_XFRSIZ8                       *((volatile unsigned int*)(0x4380B220UL))
#define bM4_USBFS_HCTSIZ4_XFRSIZ9                       *((volatile unsigned int*)(0x4380B224UL))
#define bM4_USBFS_HCTSIZ4_XFRSIZ10                      *((volatile unsigned int*)(0x4380B228UL))
#define bM4_USBFS_HCTSIZ4_XFRSIZ11                      *((volatile unsigned int*)(0x4380B22CUL))
#define bM4_USBFS_HCTSIZ4_XFRSIZ12                      *((volatile unsigned int*)(0x4380B230UL))
#define bM4_USBFS_HCTSIZ4_XFRSIZ13                      *((volatile unsigned int*)(0x4380B234UL))
#define bM4_USBFS_HCTSIZ4_XFRSIZ14                      *((volatile unsigned int*)(0x4380B238UL))
#define bM4_USBFS_HCTSIZ4_XFRSIZ15                      *((volatile unsigned int*)(0x4380B23CUL))
#define bM4_USBFS_HCTSIZ4_XFRSIZ16                      *((volatile unsigned int*)(0x4380B240UL))
#define bM4_USBFS_HCTSIZ4_XFRSIZ17                      *((volatile unsigned int*)(0x4380B244UL))
#define bM4_USBFS_HCTSIZ4_XFRSIZ18                      *((volatile unsigned int*)(0x4380B248UL))
#define bM4_USBFS_HCTSIZ4_PKTCNT0                       *((volatile unsigned int*)(0x4380B24CUL))
#define bM4_USBFS_HCTSIZ4_PKTCNT1                       *((volatile unsigned int*)(0x4380B250UL))
#define bM4_USBFS_HCTSIZ4_PKTCNT2                       *((volatile unsigned int*)(0x4380B254UL))
#define bM4_USBFS_HCTSIZ4_PKTCNT3                       *((volatile unsigned int*)(0x4380B258UL))
#define bM4_USBFS_HCTSIZ4_PKTCNT4                       *((volatile unsigned int*)(0x4380B25CUL))
#define bM4_USBFS_HCTSIZ4_PKTCNT5                       *((volatile unsigned int*)(0x4380B260UL))
#define bM4_USBFS_HCTSIZ4_PKTCNT6                       *((volatile unsigned int*)(0x4380B264UL))
#define bM4_USBFS_HCTSIZ4_PKTCNT7                       *((volatile unsigned int*)(0x4380B268UL))
#define bM4_USBFS_HCTSIZ4_PKTCNT8                       *((volatile unsigned int*)(0x4380B26CUL))
#define bM4_USBFS_HCTSIZ4_PKTCNT9                       *((volatile unsigned int*)(0x4380B270UL))
#define bM4_USBFS_HCTSIZ4_DPID0                         *((volatile unsigned int*)(0x4380B274UL))
#define bM4_USBFS_HCTSIZ4_DPID1                         *((volatile unsigned int*)(0x4380B278UL))
#define bM4_USBFS_HCCHAR5_MPSIZ0                        *((volatile unsigned int*)(0x4380B400UL))
#define bM4_USBFS_HCCHAR5_MPSIZ1                        *((volatile unsigned int*)(0x4380B404UL))
#define bM4_USBFS_HCCHAR5_MPSIZ2                        *((volatile unsigned int*)(0x4380B408UL))
#define bM4_USBFS_HCCHAR5_MPSIZ3                        *((volatile unsigned int*)(0x4380B40CUL))
#define bM4_USBFS_HCCHAR5_MPSIZ4                        *((volatile unsigned int*)(0x4380B410UL))
#define bM4_USBFS_HCCHAR5_MPSIZ5                        *((volatile unsigned int*)(0x4380B414UL))
#define bM4_USBFS_HCCHAR5_MPSIZ6                        *((volatile unsigned int*)(0x4380B418UL))
#define bM4_USBFS_HCCHAR5_MPSIZ7                        *((volatile unsigned int*)(0x4380B41CUL))
#define bM4_USBFS_HCCHAR5_MPSIZ8                        *((volatile unsigned int*)(0x4380B420UL))
#define bM4_USBFS_HCCHAR5_MPSIZ9                        *((volatile unsigned int*)(0x4380B424UL))
#define bM4_USBFS_HCCHAR5_MPSIZ10                       *((volatile unsigned int*)(0x4380B428UL))
#define bM4_USBFS_HCCHAR5_EPNUM0                        *((volatile unsigned int*)(0x4380B42CUL))
#define bM4_USBFS_HCCHAR5_EPNUM1                        *((volatile unsigned int*)(0x4380B430UL))
#define bM4_USBFS_HCCHAR5_EPNUM2                        *((volatile unsigned int*)(0x4380B434UL))
#define bM4_USBFS_HCCHAR5_EPNUM3                        *((volatile unsigned int*)(0x4380B438UL))
#define bM4_USBFS_HCCHAR5_EPDIR                         *((volatile unsigned int*)(0x4380B43CUL))
#define bM4_USBFS_HCCHAR5_LSDEV                         *((volatile unsigned int*)(0x4380B444UL))
#define bM4_USBFS_HCCHAR5_EPTYP0                        *((volatile unsigned int*)(0x4380B448UL))
#define bM4_USBFS_HCCHAR5_EPTYP1                        *((volatile unsigned int*)(0x4380B44CUL))
#define bM4_USBFS_HCCHAR5_DAD0                          *((volatile unsigned int*)(0x4380B458UL))
#define bM4_USBFS_HCCHAR5_DAD1                          *((volatile unsigned int*)(0x4380B45CUL))
#define bM4_USBFS_HCCHAR5_DAD2                          *((volatile unsigned int*)(0x4380B460UL))
#define bM4_USBFS_HCCHAR5_DAD3                          *((volatile unsigned int*)(0x4380B464UL))
#define bM4_USBFS_HCCHAR5_DAD4                          *((volatile unsigned int*)(0x4380B468UL))
#define bM4_USBFS_HCCHAR5_DAD5                          *((volatile unsigned int*)(0x4380B46CUL))
#define bM4_USBFS_HCCHAR5_DAD6                          *((volatile unsigned int*)(0x4380B470UL))
#define bM4_USBFS_HCCHAR5_ODDFRM                        *((volatile unsigned int*)(0x4380B474UL))
#define bM4_USBFS_HCCHAR5_CHDIS                         *((volatile unsigned int*)(0x4380B478UL))
#define bM4_USBFS_HCCHAR5_CHENA                         *((volatile unsigned int*)(0x4380B47CUL))
#define bM4_USBFS_HCINT5_XFRC                           *((volatile unsigned int*)(0x4380B500UL))
#define bM4_USBFS_HCINT5_CHH                            *((volatile unsigned int*)(0x4380B504UL))
#define bM4_USBFS_HCINT5_STALL                          *((volatile unsigned int*)(0x4380B50CUL))
#define bM4_USBFS_HCINT5_NAK                            *((volatile unsigned int*)(0x4380B510UL))
#define bM4_USBFS_HCINT5_ACK                            *((volatile unsigned int*)(0x4380B514UL))
#define bM4_USBFS_HCINT5_TXERR                          *((volatile unsigned int*)(0x4380B51CUL))
#define bM4_USBFS_HCINT5_BBERR                          *((volatile unsigned int*)(0x4380B520UL))
#define bM4_USBFS_HCINT5_FRMOR                          *((volatile unsigned int*)(0x4380B524UL))
#define bM4_USBFS_HCINT5_DTERR                          *((volatile unsigned int*)(0x4380B528UL))
#define bM4_USBFS_HCINTMSK5_XFRCM                       *((volatile unsigned int*)(0x4380B580UL))
#define bM4_USBFS_HCINTMSK5_CHHM                        *((volatile unsigned int*)(0x4380B584UL))
#define bM4_USBFS_HCINTMSK5_STALLM                      *((volatile unsigned int*)(0x4380B58CUL))
#define bM4_USBFS_HCINTMSK5_NAKM                        *((volatile unsigned int*)(0x4380B590UL))
#define bM4_USBFS_HCINTMSK5_ACKM                        *((volatile unsigned int*)(0x4380B594UL))
#define bM4_USBFS_HCINTMSK5_TXERRM                      *((volatile unsigned int*)(0x4380B59CUL))
#define bM4_USBFS_HCINTMSK5_BBERRM                      *((volatile unsigned int*)(0x4380B5A0UL))
#define bM4_USBFS_HCINTMSK5_FRMORM                      *((volatile unsigned int*)(0x4380B5A4UL))
#define bM4_USBFS_HCINTMSK5_DTERRM                      *((volatile unsigned int*)(0x4380B5A8UL))
#define bM4_USBFS_HCTSIZ5_XFRSIZ0                       *((volatile unsigned int*)(0x4380B600UL))
#define bM4_USBFS_HCTSIZ5_XFRSIZ1                       *((volatile unsigned int*)(0x4380B604UL))
#define bM4_USBFS_HCTSIZ5_XFRSIZ2                       *((volatile unsigned int*)(0x4380B608UL))
#define bM4_USBFS_HCTSIZ5_XFRSIZ3                       *((volatile unsigned int*)(0x4380B60CUL))
#define bM4_USBFS_HCTSIZ5_XFRSIZ4                       *((volatile unsigned int*)(0x4380B610UL))
#define bM4_USBFS_HCTSIZ5_XFRSIZ5                       *((volatile unsigned int*)(0x4380B614UL))
#define bM4_USBFS_HCTSIZ5_XFRSIZ6                       *((volatile unsigned int*)(0x4380B618UL))
#define bM4_USBFS_HCTSIZ5_XFRSIZ7                       *((volatile unsigned int*)(0x4380B61CUL))
#define bM4_USBFS_HCTSIZ5_XFRSIZ8                       *((volatile unsigned int*)(0x4380B620UL))
#define bM4_USBFS_HCTSIZ5_XFRSIZ9                       *((volatile unsigned int*)(0x4380B624UL))
#define bM4_USBFS_HCTSIZ5_XFRSIZ10                      *((volatile unsigned int*)(0x4380B628UL))
#define bM4_USBFS_HCTSIZ5_XFRSIZ11                      *((volatile unsigned int*)(0x4380B62CUL))
#define bM4_USBFS_HCTSIZ5_XFRSIZ12                      *((volatile unsigned int*)(0x4380B630UL))
#define bM4_USBFS_HCTSIZ5_XFRSIZ13                      *((volatile unsigned int*)(0x4380B634UL))
#define bM4_USBFS_HCTSIZ5_XFRSIZ14                      *((volatile unsigned int*)(0x4380B638UL))
#define bM4_USBFS_HCTSIZ5_XFRSIZ15                      *((volatile unsigned int*)(0x4380B63CUL))
#define bM4_USBFS_HCTSIZ5_XFRSIZ16                      *((volatile unsigned int*)(0x4380B640UL))
#define bM4_USBFS_HCTSIZ5_XFRSIZ17                      *((volatile unsigned int*)(0x4380B644UL))
#define bM4_USBFS_HCTSIZ5_XFRSIZ18                      *((volatile unsigned int*)(0x4380B648UL))
#define bM4_USBFS_HCTSIZ5_PKTCNT0                       *((volatile unsigned int*)(0x4380B64CUL))
#define bM4_USBFS_HCTSIZ5_PKTCNT1                       *((volatile unsigned int*)(0x4380B650UL))
#define bM4_USBFS_HCTSIZ5_PKTCNT2                       *((volatile unsigned int*)(0x4380B654UL))
#define bM4_USBFS_HCTSIZ5_PKTCNT3                       *((volatile unsigned int*)(0x4380B658UL))
#define bM4_USBFS_HCTSIZ5_PKTCNT4                       *((volatile unsigned int*)(0x4380B65CUL))
#define bM4_USBFS_HCTSIZ5_PKTCNT5                       *((volatile unsigned int*)(0x4380B660UL))
#define bM4_USBFS_HCTSIZ5_PKTCNT6                       *((volatile unsigned int*)(0x4380B664UL))
#define bM4_USBFS_HCTSIZ5_PKTCNT7                       *((volatile unsigned int*)(0x4380B668UL))
#define bM4_USBFS_HCTSIZ5_PKTCNT8                       *((volatile unsigned int*)(0x4380B66CUL))
#define bM4_USBFS_HCTSIZ5_PKTCNT9                       *((volatile unsigned int*)(0x4380B670UL))
#define bM4_USBFS_HCTSIZ5_DPID0                         *((volatile unsigned int*)(0x4380B674UL))
#define bM4_USBFS_HCTSIZ5_DPID1                         *((volatile unsigned int*)(0x4380B678UL))
#define bM4_USBFS_HCCHAR6_MPSIZ0                        *((volatile unsigned int*)(0x4380B800UL))
#define bM4_USBFS_HCCHAR6_MPSIZ1                        *((volatile unsigned int*)(0x4380B804UL))
#define bM4_USBFS_HCCHAR6_MPSIZ2                        *((volatile unsigned int*)(0x4380B808UL))
#define bM4_USBFS_HCCHAR6_MPSIZ3                        *((volatile unsigned int*)(0x4380B80CUL))
#define bM4_USBFS_HCCHAR6_MPSIZ4                        *((volatile unsigned int*)(0x4380B810UL))
#define bM4_USBFS_HCCHAR6_MPSIZ5                        *((volatile unsigned int*)(0x4380B814UL))
#define bM4_USBFS_HCCHAR6_MPSIZ6                        *((volatile unsigned int*)(0x4380B818UL))
#define bM4_USBFS_HCCHAR6_MPSIZ7                        *((volatile unsigned int*)(0x4380B81CUL))
#define bM4_USBFS_HCCHAR6_MPSIZ8                        *((volatile unsigned int*)(0x4380B820UL))
#define bM4_USBFS_HCCHAR6_MPSIZ9                        *((volatile unsigned int*)(0x4380B824UL))
#define bM4_USBFS_HCCHAR6_MPSIZ10                       *((volatile unsigned int*)(0x4380B828UL))
#define bM4_USBFS_HCCHAR6_EPNUM0                        *((volatile unsigned int*)(0x4380B82CUL))
#define bM4_USBFS_HCCHAR6_EPNUM1                        *((volatile unsigned int*)(0x4380B830UL))
#define bM4_USBFS_HCCHAR6_EPNUM2                        *((volatile unsigned int*)(0x4380B834UL))
#define bM4_USBFS_HCCHAR6_EPNUM3                        *((volatile unsigned int*)(0x4380B838UL))
#define bM4_USBFS_HCCHAR6_EPDIR                         *((volatile unsigned int*)(0x4380B83CUL))
#define bM4_USBFS_HCCHAR6_LSDEV                         *((volatile unsigned int*)(0x4380B844UL))
#define bM4_USBFS_HCCHAR6_EPTYP0                        *((volatile unsigned int*)(0x4380B848UL))
#define bM4_USBFS_HCCHAR6_EPTYP1                        *((volatile unsigned int*)(0x4380B84CUL))
#define bM4_USBFS_HCCHAR6_DAD0                          *((volatile unsigned int*)(0x4380B858UL))
#define bM4_USBFS_HCCHAR6_DAD1                          *((volatile unsigned int*)(0x4380B85CUL))
#define bM4_USBFS_HCCHAR6_DAD2                          *((volatile unsigned int*)(0x4380B860UL))
#define bM4_USBFS_HCCHAR6_DAD3                          *((volatile unsigned int*)(0x4380B864UL))
#define bM4_USBFS_HCCHAR6_DAD4                          *((volatile unsigned int*)(0x4380B868UL))
#define bM4_USBFS_HCCHAR6_DAD5                          *((volatile unsigned int*)(0x4380B86CUL))
#define bM4_USBFS_HCCHAR6_DAD6                          *((volatile unsigned int*)(0x4380B870UL))
#define bM4_USBFS_HCCHAR6_ODDFRM                        *((volatile unsigned int*)(0x4380B874UL))
#define bM4_USBFS_HCCHAR6_CHDIS                         *((volatile unsigned int*)(0x4380B878UL))
#define bM4_USBFS_HCCHAR6_CHENA                         *((volatile unsigned int*)(0x4380B87CUL))
#define bM4_USBFS_HCINT6_XFRC                           *((volatile unsigned int*)(0x4380B900UL))
#define bM4_USBFS_HCINT6_CHH                            *((volatile unsigned int*)(0x4380B904UL))
#define bM4_USBFS_HCINT6_STALL                          *((volatile unsigned int*)(0x4380B90CUL))
#define bM4_USBFS_HCINT6_NAK                            *((volatile unsigned int*)(0x4380B910UL))
#define bM4_USBFS_HCINT6_ACK                            *((volatile unsigned int*)(0x4380B914UL))
#define bM4_USBFS_HCINT6_TXERR                          *((volatile unsigned int*)(0x4380B91CUL))
#define bM4_USBFS_HCINT6_BBERR                          *((volatile unsigned int*)(0x4380B920UL))
#define bM4_USBFS_HCINT6_FRMOR                          *((volatile unsigned int*)(0x4380B924UL))
#define bM4_USBFS_HCINT6_DTERR                          *((volatile unsigned int*)(0x4380B928UL))
#define bM4_USBFS_HCINTMSK6_XFRCM                       *((volatile unsigned int*)(0x4380B980UL))
#define bM4_USBFS_HCINTMSK6_CHHM                        *((volatile unsigned int*)(0x4380B984UL))
#define bM4_USBFS_HCINTMSK6_STALLM                      *((volatile unsigned int*)(0x4380B98CUL))
#define bM4_USBFS_HCINTMSK6_NAKM                        *((volatile unsigned int*)(0x4380B990UL))
#define bM4_USBFS_HCINTMSK6_ACKM                        *((volatile unsigned int*)(0x4380B994UL))
#define bM4_USBFS_HCINTMSK6_TXERRM                      *((volatile unsigned int*)(0x4380B99CUL))
#define bM4_USBFS_HCINTMSK6_BBERRM                      *((volatile unsigned int*)(0x4380B9A0UL))
#define bM4_USBFS_HCINTMSK6_FRMORM                      *((volatile unsigned int*)(0x4380B9A4UL))
#define bM4_USBFS_HCINTMSK6_DTERRM                      *((volatile unsigned int*)(0x4380B9A8UL))
#define bM4_USBFS_HCTSIZ6_XFRSIZ0                       *((volatile unsigned int*)(0x4380BA00UL))
#define bM4_USBFS_HCTSIZ6_XFRSIZ1                       *((volatile unsigned int*)(0x4380BA04UL))
#define bM4_USBFS_HCTSIZ6_XFRSIZ2                       *((volatile unsigned int*)(0x4380BA08UL))
#define bM4_USBFS_HCTSIZ6_XFRSIZ3                       *((volatile unsigned int*)(0x4380BA0CUL))
#define bM4_USBFS_HCTSIZ6_XFRSIZ4                       *((volatile unsigned int*)(0x4380BA10UL))
#define bM4_USBFS_HCTSIZ6_XFRSIZ5                       *((volatile unsigned int*)(0x4380BA14UL))
#define bM4_USBFS_HCTSIZ6_XFRSIZ6                       *((volatile unsigned int*)(0x4380BA18UL))
#define bM4_USBFS_HCTSIZ6_XFRSIZ7                       *((volatile unsigned int*)(0x4380BA1CUL))
#define bM4_USBFS_HCTSIZ6_XFRSIZ8                       *((volatile unsigned int*)(0x4380BA20UL))
#define bM4_USBFS_HCTSIZ6_XFRSIZ9                       *((volatile unsigned int*)(0x4380BA24UL))
#define bM4_USBFS_HCTSIZ6_XFRSIZ10                      *((volatile unsigned int*)(0x4380BA28UL))
#define bM4_USBFS_HCTSIZ6_XFRSIZ11                      *((volatile unsigned int*)(0x4380BA2CUL))
#define bM4_USBFS_HCTSIZ6_XFRSIZ12                      *((volatile unsigned int*)(0x4380BA30UL))
#define bM4_USBFS_HCTSIZ6_XFRSIZ13                      *((volatile unsigned int*)(0x4380BA34UL))
#define bM4_USBFS_HCTSIZ6_XFRSIZ14                      *((volatile unsigned int*)(0x4380BA38UL))
#define bM4_USBFS_HCTSIZ6_XFRSIZ15                      *((volatile unsigned int*)(0x4380BA3CUL))
#define bM4_USBFS_HCTSIZ6_XFRSIZ16                      *((volatile unsigned int*)(0x4380BA40UL))
#define bM4_USBFS_HCTSIZ6_XFRSIZ17                      *((volatile unsigned int*)(0x4380BA44UL))
#define bM4_USBFS_HCTSIZ6_XFRSIZ18                      *((volatile unsigned int*)(0x4380BA48UL))
#define bM4_USBFS_HCTSIZ6_PKTCNT0                       *((volatile unsigned int*)(0x4380BA4CUL))
#define bM4_USBFS_HCTSIZ6_PKTCNT1                       *((volatile unsigned int*)(0x4380BA50UL))
#define bM4_USBFS_HCTSIZ6_PKTCNT2                       *((volatile unsigned int*)(0x4380BA54UL))
#define bM4_USBFS_HCTSIZ6_PKTCNT3                       *((volatile unsigned int*)(0x4380BA58UL))
#define bM4_USBFS_HCTSIZ6_PKTCNT4                       *((volatile unsigned int*)(0x4380BA5CUL))
#define bM4_USBFS_HCTSIZ6_PKTCNT5                       *((volatile unsigned int*)(0x4380BA60UL))
#define bM4_USBFS_HCTSIZ6_PKTCNT6                       *((volatile unsigned int*)(0x4380BA64UL))
#define bM4_USBFS_HCTSIZ6_PKTCNT7                       *((volatile unsigned int*)(0x4380BA68UL))
#define bM4_USBFS_HCTSIZ6_PKTCNT8                       *((volatile unsigned int*)(0x4380BA6CUL))
#define bM4_USBFS_HCTSIZ6_PKTCNT9                       *((volatile unsigned int*)(0x4380BA70UL))
#define bM4_USBFS_HCTSIZ6_DPID0                         *((volatile unsigned int*)(0x4380BA74UL))
#define bM4_USBFS_HCTSIZ6_DPID1                         *((volatile unsigned int*)(0x4380BA78UL))
#define bM4_USBFS_HCCHAR7_MPSIZ0                        *((volatile unsigned int*)(0x4380BC00UL))
#define bM4_USBFS_HCCHAR7_MPSIZ1                        *((volatile unsigned int*)(0x4380BC04UL))
#define bM4_USBFS_HCCHAR7_MPSIZ2                        *((volatile unsigned int*)(0x4380BC08UL))
#define bM4_USBFS_HCCHAR7_MPSIZ3                        *((volatile unsigned int*)(0x4380BC0CUL))
#define bM4_USBFS_HCCHAR7_MPSIZ4                        *((volatile unsigned int*)(0x4380BC10UL))
#define bM4_USBFS_HCCHAR7_MPSIZ5                        *((volatile unsigned int*)(0x4380BC14UL))
#define bM4_USBFS_HCCHAR7_MPSIZ6                        *((volatile unsigned int*)(0x4380BC18UL))
#define bM4_USBFS_HCCHAR7_MPSIZ7                        *((volatile unsigned int*)(0x4380BC1CUL))
