CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_USBFS_HCCHAR10_EPTYP1                       *((volatile unsigned int*)(0x4380C84CUL))
#define bM4_USBFS_HCCHAR10_DAD0                         *((volatile unsigned int*)(0x4380C858UL))
#define bM4_USBFS_HCCHAR10_DAD1                         *((volatile unsigned int*)(0x4380C85CUL))
#define bM4_USBFS_HCCHAR10_DAD2                         *((volatile unsigned int*)(0x4380C860UL))
#define bM4_USBFS_HCCHAR10_DAD3                         *((volatile unsigned int*)(0x4380C864UL))
#define bM4_USBFS_HCCHAR10_DAD4                         *((volatile unsigned int*)(0x4380C868UL))
#define bM4_USBFS_HCCHAR10_DAD5                         *((volatile unsigned int*)(0x4380C86CUL))
#define bM4_USBFS_HCCHAR10_DAD6                         *((volatile unsigned int*)(0x4380C870UL))
#define bM4_USBFS_HCCHAR10_ODDFRM                       *((volatile unsigned int*)(0x4380C874UL))
#define bM4_USBFS_HCCHAR10_CHDIS                        *((volatile unsigned int*)(0x4380C878UL))
#define bM4_USBFS_HCCHAR10_CHENA                        *((volatile unsigned int*)(0x4380C87CUL))
#define bM4_USBFS_HCINT10_XFRC                          *((volatile unsigned int*)(0x4380C900UL))
#define bM4_USBFS_HCINT10_CHH                           *((volatile unsigned int*)(0x4380C904UL))
#define bM4_USBFS_HCINT10_STALL                         *((volatile unsigned int*)(0x4380C90CUL))
#define bM4_USBFS_HCINT10_NAK                           *((volatile unsigned int*)(0x4380C910UL))
#define bM4_USBFS_HCINT10_ACK                           *((volatile unsigned int*)(0x4380C914UL))
#define bM4_USBFS_HCINT10_TXERR                         *((volatile unsigned int*)(0x4380C91CUL))
#define bM4_USBFS_HCINT10_BBERR                         *((volatile unsigned int*)(0x4380C920UL))
#define bM4_USBFS_HCINT10_FRMOR                         *((volatile unsigned int*)(0x4380C924UL))
#define bM4_USBFS_HCINT10_DTERR                         *((volatile unsigned int*)(0x4380C928UL))
#define bM4_USBFS_HCINTMSK10_XFRCM                      *((volatile unsigned int*)(0x4380C980UL))
#define bM4_USBFS_HCINTMSK10_CHHM                       *((volatile unsigned int*)(0x4380C984UL))
#define bM4_USBFS_HCINTMSK10_STALLM                     *((volatile unsigned int*)(0x4380C98CUL))
#define bM4_USBFS_HCINTMSK10_NAKM                       *((volatile unsigned int*)(0x4380C990UL))
#define bM4_USBFS_HCINTMSK10_ACKM                       *((volatile unsigned int*)(0x4380C994UL))
#define bM4_USBFS_HCINTMSK10_TXERRM                     *((volatile unsigned int*)(0x4380C99CUL))
#define bM4_USBFS_HCINTMSK10_BBERRM                     *((volatile unsigned int*)(0x4380C9A0UL))
#define bM4_USBFS_HCINTMSK10_FRMORM                     *((volatile unsigned int*)(0x4380C9A4UL))
#define bM4_USBFS_HCINTMSK10_DTERRM                     *((volatile unsigned int*)(0x4380C9A8UL))
#define bM4_USBFS_HCTSIZ10_XFRSIZ0                      *((volatile unsigned int*)(0x4380CA00UL))
#define bM4_USBFS_HCTSIZ10_XFRSIZ1                      *((volatile unsigned int*)(0x4380CA04UL))
#define bM4_USBFS_HCTSIZ10_XFRSIZ2                      *((volatile unsigned int*)(0x4380CA08UL))
#define bM4_USBFS_HCTSIZ10_XFRSIZ3                      *((volatile unsigned int*)(0x4380CA0CUL))
#define bM4_USBFS_HCTSIZ10_XFRSIZ4                      *((volatile unsigned int*)(0x4380CA10UL))
#define bM4_USBFS_HCTSIZ10_XFRSIZ5                      *((volatile unsigned int*)(0x4380CA14UL))
#define bM4_USBFS_HCTSIZ10_XFRSIZ6                      *((volatile unsigned int*)(0x4380CA18UL))
#define bM4_USBFS_HCTSIZ10_XFRSIZ7                      *((volatile unsigned int*)(0x4380CA1CUL))
#define bM4_USBFS_HCTSIZ10_XFRSIZ8                      *((volatile unsigned int*)(0x4380CA20UL))
#define bM4_USBFS_HCTSIZ10_XFRSIZ9                      *((volatile unsigned int*)(0x4380CA24UL))
#define bM4_USBFS_HCTSIZ10_XFRSIZ10                     *((volatile unsigned int*)(0x4380CA28UL))
#define bM4_USBFS_HCTSIZ10_XFRSIZ11                     *((volatile unsigned int*)(0x4380CA2CUL))
#define bM4_USBFS_HCTSIZ10_XFRSIZ12                     *((volatile unsigned int*)(0x4380CA30UL))
#define bM4_USBFS_HCTSIZ10_XFRSIZ13                     *((volatile unsigned int*)(0x4380CA34UL))
#define bM4_USBFS_HCTSIZ10_XFRSIZ14                     *((volatile unsigned int*)(0x4380CA38UL))
#define bM4_USBFS_HCTSIZ10_XFRSIZ15                     *((volatile unsigned int*)(0x4380CA3CUL))
#define bM4_USBFS_HCTSIZ10_XFRSIZ16                     *((volatile unsigned int*)(0x4380CA40UL))
#define bM4_USBFS_HCTSIZ10_XFRSIZ17                     *((volatile unsigned int*)(0x4380CA44UL))
#define bM4_USBFS_HCTSIZ10_XFRSIZ18                     *((volatile unsigned int*)(0x4380CA48UL))
#define bM4_USBFS_HCTSIZ10_PKTCNT0                      *((volatile unsigned int*)(0x4380CA4CUL))
#define bM4_USBFS_HCTSIZ10_PKTCNT1                      *((volatile unsigned int*)(0x4380CA50UL))
#define bM4_USBFS_HCTSIZ10_PKTCNT2                      *((volatile unsigned int*)(0x4380CA54UL))
#define bM4_USBFS_HCTSIZ10_PKTCNT3                      *((volatile unsigned int*)(0x4380CA58UL))
#define bM4_USBFS_HCTSIZ10_PKTCNT4                      *((volatile unsigned int*)(0x4380CA5CUL))
#define bM4_USBFS_HCTSIZ10_PKTCNT5                      *((volatile unsigned int*)(0x4380CA60UL))
#define bM4_USBFS_HCTSIZ10_PKTCNT6                      *((volatile unsigned int*)(0x4380CA64UL))
#define bM4_USBFS_HCTSIZ10_PKTCNT7                      *((volatile unsigned int*)(0x4380CA68UL))
#define bM4_USBFS_HCTSIZ10_PKTCNT8                      *((volatile unsigned int*)(0x4380CA6CUL))
#define bM4_USBFS_HCTSIZ10_PKTCNT9                      *((volatile unsigned int*)(0x4380CA70UL))
#define bM4_USBFS_HCTSIZ10_DPID0                        *((volatile unsigned int*)(0x4380CA74UL))
#define bM4_USBFS_HCTSIZ10_DPID1                        *((volatile unsigned int*)(0x4380CA78UL))
#define bM4_USBFS_HCCHAR11_MPSIZ0                       *((volatile unsigned int*)(0x4380CC00UL))
#define bM4_USBFS_HCCHAR11_MPSIZ1                       *((volatile unsigned int*)(0x4380CC04UL))
#define bM4_USBFS_HCCHAR11_MPSIZ2                       *((volatile unsigned int*)(0x4380CC08UL))
#define bM4_USBFS_HCCHAR11_MPSIZ3                       *((volatile unsigned int*)(0x4380CC0CUL))
#define bM4_USBFS_HCCHAR11_MPSIZ4                       *((volatile unsigned int*)(0x4380CC10UL))
#define bM4_USBFS_HCCHAR11_MPSIZ5                       *((volatile unsigned int*)(0x4380CC14UL))
#define bM4_USBFS_HCCHAR11_MPSIZ6                       *((volatile unsigned int*)(0x4380CC18UL))
#define bM4_USBFS_HCCHAR11_MPSIZ7                       *((volatile unsigned int*)(0x4380CC1CUL))
#define bM4_USBFS_HCCHAR11_MPSIZ8                       *((volatile unsigned int*)(0x4380CC20UL))
#define bM4_USBFS_HCCHAR11_MPSIZ9                       *((volatile unsigned int*)(0x4380CC24UL))
#define bM4_USBFS_HCCHAR11_MPSIZ10                      *((volatile unsigned int*)(0x4380CC28UL))
#define bM4_USBFS_HCCHAR11_EPNUM0                       *((volatile unsigned int*)(0x4380CC2CUL))
#define bM4_USBFS_HCCHAR11_EPNUM1                       *((volatile unsigned int*)(0x4380CC30UL))
#define bM4_USBFS_HCCHAR11_EPNUM2                       *((volatile unsigned int*)(0x4380CC34UL))
#define bM4_USBFS_HCCHAR11_EPNUM3                       *((volatile unsigned int*)(0x4380CC38UL))
#define bM4_USBFS_HCCHAR11_EPDIR                        *((volatile unsigned int*)(0x4380CC3CUL))
#define bM4_USBFS_HCCHAR11_LSDEV                        *((volatile unsigned int*)(0x4380CC44UL))
#define bM4_USBFS_HCCHAR11_EPTYP0                       *((volatile unsigned int*)(0x4380CC48UL))
#define bM4_USBFS_HCCHAR11_EPTYP1                       *((volatile unsigned int*)(0x4380CC4CUL))
#define bM4_USBFS_HCCHAR11_DAD0                         *((volatile unsigned int*)(0x4380CC58UL))
#define bM4_USBFS_HCCHAR11_DAD1                         *((volatile unsigned int*)(0x4380CC5CUL))
#define bM4_USBFS_HCCHAR11_DAD2                         *((volatile unsigned int*)(0x4380CC60UL))
#define bM4_USBFS_HCCHAR11_DAD3                         *((volatile unsigned int*)(0x4380CC64UL))
#define bM4_USBFS_HCCHAR11_DAD4                         *((volatile unsigned int*)(0x4380CC68UL))
#define bM4_USBFS_HCCHAR11_DAD5                         *((volatile unsigned int*)(0x4380CC6CUL))
#define bM4_USBFS_HCCHAR11_DAD6                         *((volatile unsigned int*)(0x4380CC70UL))
#define bM4_USBFS_HCCHAR11_ODDFRM                       *((volatile unsigned int*)(0x4380CC74UL))
#define bM4_USBFS_HCCHAR11_CHDIS                        *((volatile unsigned int*)(0x4380CC78UL))
#define bM4_USBFS_HCCHAR11_CHENA                        *((volatile unsigned int*)(0x4380CC7CUL))
#define bM4_USBFS_HCINT11_XFRC                          *((volatile unsigned int*)(0x4380CD00UL))
#define bM4_USBFS_HCINT11_CHH                           *((volatile unsigned int*)(0x4380CD04UL))
#define bM4_USBFS_HCINT11_STALL                         *((volatile unsigned int*)(0x4380CD0CUL))
#define bM4_USBFS_HCINT11_NAK                           *((volatile unsigned int*)(0x4380CD10UL))
#define bM4_USBFS_HCINT11_ACK                           *((volatile unsigned int*)(0x4380CD14UL))
#define bM4_USBFS_HCINT11_TXERR                         *((volatile unsigned int*)(0x4380CD1CUL))
#define bM4_USBFS_HCINT11_BBERR                         *((volatile unsigned int*)(0x4380CD20UL))
#define bM4_USBFS_HCINT11_FRMOR                         *((volatile unsigned int*)(0x4380CD24UL))
#define bM4_USBFS_HCINT11_DTERR                         *((volatile unsigned int*)(0x4380CD28UL))
#define bM4_USBFS_HCINTMSK11_XFRCM                      *((volatile unsigned int*)(0x4380CD80UL))
#define bM4_USBFS_HCINTMSK11_CHHM                       *((volatile unsigned int*)(0x4380CD84UL))
#define bM4_USBFS_HCINTMSK11_STALLM                     *((volatile unsigned int*)(0x4380CD8CUL))
#define bM4_USBFS_HCINTMSK11_NAKM                       *((volatile unsigned int*)(0x4380CD90UL))
#define bM4_USBFS_HCINTMSK11_ACKM                       *((volatile unsigned int*)(0x4380CD94UL))
#define bM4_USBFS_HCINTMSK11_TXERRM                     *((volatile unsigned int*)(0x4380CD9CUL))
#define bM4_USBFS_HCINTMSK11_BBERRM                     *((volatile unsigned int*)(0x4380CDA0UL))
#define bM4_USBFS_HCINTMSK11_FRMORM                     *((volatile unsigned int*)(0x4380CDA4UL))
#define bM4_USBFS_HCINTMSK11_DTERRM                     *((volatile unsigned int*)(0x4380CDA8UL))
#define bM4_USBFS_HCTSIZ11_XFRSIZ0                      *((volatile unsigned int*)(0x4380CE00UL))
#define bM4_USBFS_HCTSIZ11_XFRSIZ1                      *((volatile unsigned int*)(0x4380CE04UL))
#define bM4_USBFS_HCTSIZ11_XFRSIZ2                      *((volatile unsigned int*)(0x4380CE08UL))
#define bM4_USBFS_HCTSIZ11_XFRSIZ3                      *((volatile unsigned int*)(0x4380CE0CUL))
#define bM4_USBFS_HCTSIZ11_XFRSIZ4                      *((volatile unsigned int*)(0x4380CE10UL))
#define bM4_USBFS_HCTSIZ11_XFRSIZ5                      *((volatile unsigned int*)(0x4380CE14UL))
#define bM4_USBFS_HCTSIZ11_XFRSIZ6                      *((volatile unsigned int*)(0x4380CE18UL))
#define bM4_USBFS_HCTSIZ11_XFRSIZ7                      *((volatile unsigned int*)(0x4380CE1CUL))
#define bM4_USBFS_HCTSIZ11_XFRSIZ8                      *((volatile unsigned int*)(0x4380CE20UL))
#define bM4_USBFS_HCTSIZ11_XFRSIZ9                      *((volatile unsigned int*)(0x4380CE24UL))
#define bM4_USBFS_HCTSIZ11_XFRSIZ10                     *((volatile unsigned int*)(0x4380CE28UL))
#define bM4_USBFS_HCTSIZ11_XFRSIZ11                     *((volatile unsigned int*)(0x4380CE2CUL))
#define bM4_USBFS_HCTSIZ11_XFRSIZ12                     *((volatile unsigned int*)(0x4380CE30UL))
#define bM4_USBFS_HCTSIZ11_XFRSIZ13                     *((volatile unsigned int*)(0x4380CE34UL))
#define bM4_USBFS_HCTSIZ11_XFRSIZ14                     *((volatile unsigned int*)(0x4380CE38UL))
#define bM4_USBFS_HCTSIZ11_XFRSIZ15                     *((volatile unsigned int*)(0x4380CE3CUL))
#define bM4_USBFS_HCTSIZ11_XFRSIZ16                     *((volatile unsigned int*)(0x4380CE40UL))
#define bM4_USBFS_HCTSIZ11_XFRSIZ17                     *((volatile unsigned int*)(0x4380CE44UL))
#define bM4_USBFS_HCTSIZ11_XFRSIZ18                     *((volatile unsigned int*)(0x4380CE48UL))
#define bM4_USBFS_HCTSIZ11_PKTCNT0                      *((volatile unsigned int*)(0x4380CE4CUL))
#define bM4_USBFS_HCTSIZ11_PKTCNT1                      *((volatile unsigned int*)(0x4380CE50UL))
#define bM4_USBFS_HCTSIZ11_PKTCNT2                      *((volatile unsigned int*)(0x4380CE54UL))
#define bM4_USBFS_HCTSIZ11_PKTCNT3                      *((volatile unsigned int*)(0x4380CE58UL))
#define bM4_USBFS_HCTSIZ11_PKTCNT4                      *((volatile unsigned int*)(0x4380CE5CUL))
#define bM4_USBFS_HCTSIZ11_PKTCNT5                      *((volatile unsigned int*)(0x4380CE60UL))
#define bM4_USBFS_HCTSIZ11_PKTCNT6                      *((volatile unsigned int*)(0x4380CE64UL))
#define bM4_USBFS_HCTSIZ11_PKTCNT7                      *((volatile unsigned int*)(0x4380CE68UL))
#define bM4_USBFS_HCTSIZ11_PKTCNT8                      *((volatile unsigned int*)(0x4380CE6CUL))
#define bM4_USBFS_HCTSIZ11_PKTCNT9                      *((volatile unsigned int*)(0x4380CE70UL))
#define bM4_USBFS_HCTSIZ11_DPID0                        *((volatile unsigned int*)(0x4380CE74UL))
#define bM4_USBFS_HCTSIZ11_DPID1                        *((volatile unsigned int*)(0x4380CE78UL))
#define bM4_USBFS_DCFG_DSPD0                            *((volatile unsigned int*)(0x43810000UL))
#define bM4_USBFS_DCFG_DSPD1                            *((volatile unsigned int*)(0x43810004UL))
#define bM4_USBFS_DCFG_NZLSOHSK                         *((volatile unsigned int*)(0x43810008UL))
#define bM4_USBFS_DCFG_DAD0                             *((volatile unsigned int*)(0x43810010UL))
#define bM4_USBFS_DCFG_DAD1                             *((volatile unsigned int*)(0x43810014UL))
#define bM4_USBFS_DCFG_DAD2                             *((volatile unsigned int*)(0x43810018UL))
#define bM4_USBFS_DCFG_DAD3                             *((volatile unsigned int*)(0x4381001CUL))
#define bM4_USBFS_DCFG_DAD4                             *((volatile unsigned int*)(0x43810020UL))
#define bM4_USBFS_DCFG_DAD5                             *((volatile unsigned int*)(0x43810024UL))
#define bM4_USBFS_DCFG_DAD6                             *((volatile unsigned int*)(0x43810028UL))
#define bM4_USBFS_DCFG_PFIVL0                           *((volatile unsigned int*)(0x4381002CUL))
#define bM4_USBFS_DCFG_PFIVL1                           *((volatile unsigned int*)(0x43810030UL))
#define bM4_USBFS_DCTL_RWUSIG                           *((volatile unsigned int*)(0x43810080UL))
#define bM4_USBFS_DCTL_SDIS                             *((volatile unsigned int*)(0x43810084UL))
#define bM4_USBFS_DCTL_GINSTS                           *((volatile unsigned int*)(0x43810088UL))
#define bM4_USBFS_DCTL_GONSTS                           *((volatile unsigned int*)(0x4381008CUL))
#define bM4_USBFS_DCTL_TCTL0                            *((volatile unsigned int*)(0x43810090UL))
#define bM4_USBFS_DCTL_TCTL1                            *((volatile unsigned int*)(0x43810094UL))
#define bM4_USBFS_DCTL_TCTL2                            *((volatile unsigned int*)(0x43810098UL))
#define bM4_USBFS_DCTL_SGINAK                           *((volatile unsigned int*)(0x4381009CUL))
#define bM4_USBFS_DCTL_CGINAK                           *((volatile unsigned int*)(0x438100A0UL))
#define bM4_USBFS_DCTL_SGONAK                           *((volatile unsigned int*)(0x438100A4UL))
#define bM4_USBFS_DCTL_CGONAK                           *((volatile unsigned int*)(0x438100A8UL))
#define bM4_USBFS_DCTL_POPRGDNE                         *((volatile unsigned int*)(0x438100ACUL))
#define bM4_USBFS_DSTS_SUSPSTS                          *((volatile unsigned int*)(0x43810100UL))
#define bM4_USBFS_DSTS_ENUMSPD0                         *((volatile unsigned int*)(0x43810104UL))
#define bM4_USBFS_DSTS_ENUMSPD1                         *((volatile unsigned int*)(0x43810108UL))
#define bM4_USBFS_DSTS_EERR                             *((volatile unsigned int*)(0x4381010CUL))
#define bM4_USBFS_DSTS_FNSOF0                           *((volatile unsigned int*)(0x43810120UL))
#define bM4_USBFS_DSTS_FNSOF1                           *((volatile unsigned int*)(0x43810124UL))
#define bM4_USBFS_DSTS_FNSOF2                           *((volatile unsigned int*)(0x43810128UL))
#define bM4_USBFS_DSTS_FNSOF3                           *((volatile unsigned int*)(0x4381012CUL))
#define bM4_USBFS_DSTS_FNSOF4                           *((volatile unsigned int*)(0x43810130UL))
#define bM4_USBFS_DSTS_FNSOF5                           *((volatile unsigned int*)(0x43810134UL))
#define bM4_USBFS_DSTS_FNSOF6                           *((volatile unsigned int*)(0x43810138UL))
#define bM4_USBFS_DSTS_FNSOF7                           *((volatile unsigned int*)(0x4381013CUL))
#define bM4_USBFS_DSTS_FNSOF8                           *((volatile unsigned int*)(0x43810140UL))
#define bM4_USBFS_DSTS_FNSOF9                           *((volatile unsigned int*)(0x43810144UL))
#define bM4_USBFS_DSTS_FNSOF10                          *((volatile unsigned int*)(0x43810148UL))
#define bM4_USBFS_DSTS_FNSOF11                          *((volatile unsigned int*)(0x4381014CUL))
#define bM4_USBFS_DSTS_FNSOF12                          *((volatile unsigned int*)(0x43810150UL))
#define bM4_USBFS_DSTS_FNSOF13                          *((volatile unsigned int*)(0x43810154UL))
#define bM4_USBFS_DIEPMSK_XFRCM                         *((volatile unsigned int*)(0x43810200UL))
#define bM4_USBFS_DIEPMSK_EPDM                          *((volatile unsigned int*)(0x43810204UL))
#define bM4_USBFS_DIEPMSK_TOM                           *((volatile unsigned int*)(0x4381020CUL))
#define bM4_USBFS_DIEPMSK_ITTXFEMSK                     *((volatile unsigned int*)(0x43810210UL))
#define bM4_USBFS_DIEPMSK_INEPNMM                       *((volatile unsigned int*)(0x43810214UL))
#define bM4_USBFS_DIEPMSK_IINEPNEM                      *((volatile unsigned int*)(0x43810218UL))
#define bM4_USBFS_DOEPMSK_XFRCM                         *((volatile unsigned int*)(0x43810280UL))
#define bM4_USBFS_DOEPMSK_EPDM                          *((volatile unsigned int*)(0x43810284UL))
#define bM4_USBFS_DOEPMSK_STUPM                         *((volatile unsigned int*)(0x4381028CUL))
#define bM4_USBFS_DOEPMSK_OTEPDM                        *((volatile unsigned int*)(0x43810290UL))
#define bM4_USBFS_DAINT_IEPINT0                         *((volatile unsigned int*)(0x43810300UL))
#define bM4_USBFS_DAINT_IEPINT1                         *((volatile unsigned int*)(0x43810304UL))
#define bM4_USBFS_DAINT_IEPINT2                         *((volatile unsigned int*)(0x43810308UL))
#define bM4_USBFS_DAINT_IEPINT3                         *((volatile unsigned int*)(0x4381030CUL))
#define bM4_USBFS_DAINT_IEPINT4                         *((volatile unsigned int*)(0x43810310UL))
#define bM4_USBFS_DAINT_IEPINT5                         *((volatile unsigned int*)(0x43810314UL))
#define bM4_USBFS_DAINT_OEPINT0                         *((volatile unsigned int*)(0x43810340UL))
#define bM4_USBFS_DAINT_OEPINT1                         *((volatile unsigned int*)(0x43810344UL))
#define bM4_USBFS_DAINT_OEPINT2                         *((volatile unsigned int*)(0x43810348UL))
#define bM4_USBFS_DAINT_OEPINT3                         *((volatile unsigned int*)(0x4381034CUL))
#define bM4_USBFS_DAINT_OEPINT4                         *((volatile unsigned int*)(0x43810350UL))
#define bM4_USBFS_DAINT_OEPINT5                         *((volatile unsigned int*)(0x43810354UL))
#define bM4_USBFS_DAINTMSK_IEPINTM0                     *((volatile unsigned int*)(0x43810380UL))
#define bM4_USBFS_DAINTMSK_IEPINTM1                     *((volatile unsigned int*)(0x43810384UL))
#define bM4_USBFS_DAINTMSK_IEPINTM2                     *((volatile unsigned int*)(0x43810388UL))
#define bM4_USBFS_DAINTMSK_IEPINTM3                     *((volatile unsigned int*)(0x4381038CUL))
#define bM4_USBFS_DAINTMSK_IEPINTM4                     *((volatile unsigned int*)(0x43810390UL))
#define bM4_USBFS_DAINTMSK_IEPINTM5                     *((volatile unsigned int*)(0x43810394UL))
#define bM4_USBFS_DAINTMSK_OEPINTM0                     *((volatile unsigned int*)(0x438103C0UL))
#define bM4_USBFS_DAINTMSK_OEPINTM1                     *((volatile unsigned int*)(0x438103C4UL))
#define bM4_USBFS_DAINTMSK_OEPINTM2                     *((volatile unsigned int*)(0x438103C8UL))
#define bM4_USBFS_DAINTMSK_OEPINTM3                     *((volatile unsigned int*)(0x438103CCUL))
#define bM4_USBFS_DAINTMSK_OEPINTM4                     *((volatile unsigned int*)(0x438103D0UL))
#define bM4_USBFS_DAINTMSK_OEPINTM5                     *((volatile unsigned int*)(0x438103D4UL))
#define bM4_USBFS_DIEPEMPMSK_INEPTXFEM0                 *((volatile unsigned int*)(0x43810680UL))
#define bM4_USBFS_DIEPEMPMSK_INEPTXFEM1                 *((volatile unsigned int*)(0x43810684UL))
#define bM4_USBFS_DIEPEMPMSK_INEPTXFEM2                 *((volatile unsigned int*)(0x43810688UL))
#define bM4_USBFS_DIEPEMPMSK_INEPTXFEM3                 *((volatile unsigned int*)(0x4381068CUL))
#define bM4_USBFS_DIEPEMPMSK_INEPTXFEM4                 *((volatile unsigned int*)(0x43810690UL))
#define bM4_USBFS_DIEPEMPMSK_INEPTXFEM5                 *((volatile unsigned int*)(0x43810694UL))
#define bM4_USBFS_DIEPCTL0_MPSIZ0                       *((volatile unsigned int*)(0x43812000UL))
#define bM4_USBFS_DIEPCTL0_MPSIZ1                       *((volatile unsigned int*)(0x43812004UL))
#define bM4_USBFS_DIEPCTL0_USBAEP                       *((volatile unsigned int*)(0x4381203CUL))
#define bM4_USBFS_DIEPCTL0_NAKSTS                       *((volatile unsigned int*)(0x43812044UL))
#define bM4_USBFS_DIEPCTL0_EPTYP0                       *((volatile unsigned int*)(0x43812048UL))
#define bM4_USBFS_DIEPCTL0_EPTYP1                       *((volatile unsigned int*)(0x4381204CUL))
#define bM4_USBFS_DIEPCTL0_STALL                        *((volatile unsigned int*)(0x43812054UL))
#define bM4_USBFS_DIEPCTL0_TXFNUM0                      *((volatile unsigned int*)(0x43812058UL))
#define bM4_USBFS_DIEPCTL0_TXFNUM1                      *((volatile unsigned int*)(0x4381205CUL))
#define bM4_USBFS_DIEPCTL0_TXFNUM2                      *((volatile unsigned int*)(0x43812060UL))
#define bM4_USBFS_DIEPCTL0_TXFNUM3                      *((volatile unsigned int*)(0x43812064UL))
#define bM4_USBFS_DIEPCTL0_CNAK                         *((volatile unsigned int*)(0x43812068UL))
#define bM4_USBFS_DIEPCTL0_SNAK                         *((volatile unsigned int*)(0x4381206CUL))
#define bM4_USBFS_DIEPCTL0_EPDIS                        *((volatile unsigned int*)(0x43812078UL))
#define bM4_USBFS_DIEPCTL0_EPENA                        *((volatile unsigned int*)(0x4381207CUL))
#define bM4_USBFS_DIEPINT0_XFRC                         *((volatile unsigned int*)(0x43812100UL))
#define bM4_USBFS_DIEPINT0_EPDISD                       *((volatile unsigned int*)(0x43812104UL))
#define bM4_USBFS_DIEPINT0_TOC                          *((volatile unsigned int*)(0x4381210CUL))
#define bM4_USBFS_DIEPINT0_TTXFE                        *((volatile unsigned int*)(0x43812110UL))
#define bM4_USBFS_DIEPINT0_NEPNE                        *((volatile unsigned int*)(0x43812118UL))
#define bM4_USBFS_DIEPINT0_TXFE                         *((volatile unsigned int*)(0x4381211CUL))
#define bM4_USBFS_DIEPTSIZ0_XFRSIZ0                     *((volatile unsigned int*)(0x43812200UL))
#define bM4_USBFS_DIEPTSIZ0_XFRSIZ1                     *((volatile unsigned int*)(0x43812204UL))
#define bM4_USBFS_DIEPTSIZ0_XFRSIZ2                     *((volatile unsigned int*)(0x43812208UL))
