CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_USBFS_DIEPTSIZ3_MC0                         *((volatile unsigned int*)(0x43812E74UL))
#define bM4_USBFS_DIEPTSIZ3_MC1                         *((volatile unsigned int*)(0x43812E78UL))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV0                   *((volatile unsigned int*)(0x43812F00UL))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV1                   *((volatile unsigned int*)(0x43812F04UL))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV2                   *((volatile unsigned int*)(0x43812F08UL))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV3                   *((volatile unsigned int*)(0x43812F0CUL))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV4                   *((volatile unsigned int*)(0x43812F10UL))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV5                   *((volatile unsigned int*)(0x43812F14UL))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV6                   *((volatile unsigned int*)(0x43812F18UL))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV7                   *((volatile unsigned int*)(0x43812F1CUL))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV8                   *((volatile unsigned int*)(0x43812F20UL))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV9                   *((volatile unsigned int*)(0x43812F24UL))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV10                  *((volatile unsigned int*)(0x43812F28UL))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV11                  *((volatile unsigned int*)(0x43812F2CUL))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV12                  *((volatile unsigned int*)(0x43812F30UL))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV13                  *((volatile unsigned int*)(0x43812F34UL))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV14                  *((volatile unsigned int*)(0x43812F38UL))
#define bM4_USBFS_DTXFSTS3_INEPTFSAV15                  *((volatile unsigned int*)(0x43812F3CUL))
#define bM4_USBFS_DIEPCTL4_MPSIZ0                       *((volatile unsigned int*)(0x43813000UL))
#define bM4_USBFS_DIEPCTL4_MPSIZ1                       *((volatile unsigned int*)(0x43813004UL))
#define bM4_USBFS_DIEPCTL4_MPSIZ2                       *((volatile unsigned int*)(0x43813008UL))
#define bM4_USBFS_DIEPCTL4_MPSIZ3                       *((volatile unsigned int*)(0x4381300CUL))
#define bM4_USBFS_DIEPCTL4_MPSIZ4                       *((volatile unsigned int*)(0x43813010UL))
#define bM4_USBFS_DIEPCTL4_MPSIZ5                       *((volatile unsigned int*)(0x43813014UL))
#define bM4_USBFS_DIEPCTL4_MPSIZ6                       *((volatile unsigned int*)(0x43813018UL))
#define bM4_USBFS_DIEPCTL4_MPSIZ7                       *((volatile unsigned int*)(0x4381301CUL))
#define bM4_USBFS_DIEPCTL4_MPSIZ8                       *((volatile unsigned int*)(0x43813020UL))
#define bM4_USBFS_DIEPCTL4_MPSIZ9                       *((volatile unsigned int*)(0x43813024UL))
#define bM4_USBFS_DIEPCTL4_MPSIZ10                      *((volatile unsigned int*)(0x43813028UL))
#define bM4_USBFS_DIEPCTL4_USBAEP                       *((volatile unsigned int*)(0x4381303CUL))
#define bM4_USBFS_DIEPCTL4_EONUM_DPID                   *((volatile unsigned int*)(0x43813040UL))
#define bM4_USBFS_DIEPCTL4_NAKSTS                       *((volatile unsigned int*)(0x43813044UL))
#define bM4_USBFS_DIEPCTL4_EPTYP0                       *((volatile unsigned int*)(0x43813048UL))
#define bM4_USBFS_DIEPCTL4_EPTYP1                       *((volatile unsigned int*)(0x4381304CUL))
#define bM4_USBFS_DIEPCTL4_STALL                        *((volatile unsigned int*)(0x43813054UL))
#define bM4_USBFS_DIEPCTL4_TXFNUM0                      *((volatile unsigned int*)(0x43813058UL))
#define bM4_USBFS_DIEPCTL4_TXFNUM1                      *((volatile unsigned int*)(0x4381305CUL))
#define bM4_USBFS_DIEPCTL4_TXFNUM2                      *((volatile unsigned int*)(0x43813060UL))
#define bM4_USBFS_DIEPCTL4_TXFNUM3                      *((volatile unsigned int*)(0x43813064UL))
#define bM4_USBFS_DIEPCTL4_CNAK                         *((volatile unsigned int*)(0x43813068UL))
#define bM4_USBFS_DIEPCTL4_SNAK                         *((volatile unsigned int*)(0x4381306CUL))
#define bM4_USBFS_DIEPCTL4_SD0PID_SEVNFRM               *((volatile unsigned int*)(0x43813070UL))
#define bM4_USBFS_DIEPCTL4_SODDFRM                      *((volatile unsigned int*)(0x43813074UL))
#define bM4_USBFS_DIEPCTL4_EPDIS                        *((volatile unsigned int*)(0x43813078UL))
#define bM4_USBFS_DIEPCTL4_EPENA                        *((volatile unsigned int*)(0x4381307CUL))
#define bM4_USBFS_DIEPINT4_XFRC                         *((volatile unsigned int*)(0x43813100UL))
#define bM4_USBFS_DIEPINT4_EPDISD                       *((volatile unsigned int*)(0x43813104UL))
#define bM4_USBFS_DIEPINT4_TOC                          *((volatile unsigned int*)(0x4381310CUL))
#define bM4_USBFS_DIEPINT4_TTXFE                        *((volatile unsigned int*)(0x43813110UL))
#define bM4_USBFS_DIEPINT4_NEPNE                        *((volatile unsigned int*)(0x43813118UL))
#define bM4_USBFS_DIEPINT4_TXFE                         *((volatile unsigned int*)(0x4381311CUL))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ0                     *((volatile unsigned int*)(0x43813200UL))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ1                     *((volatile unsigned int*)(0x43813204UL))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ2                     *((volatile unsigned int*)(0x43813208UL))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ3                     *((volatile unsigned int*)(0x4381320CUL))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ4                     *((volatile unsigned int*)(0x43813210UL))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ5                     *((volatile unsigned int*)(0x43813214UL))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ6                     *((volatile unsigned int*)(0x43813218UL))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ7                     *((volatile unsigned int*)(0x4381321CUL))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ8                     *((volatile unsigned int*)(0x43813220UL))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ9                     *((volatile unsigned int*)(0x43813224UL))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ10                    *((volatile unsigned int*)(0x43813228UL))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ11                    *((volatile unsigned int*)(0x4381322CUL))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ12                    *((volatile unsigned int*)(0x43813230UL))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ13                    *((volatile unsigned int*)(0x43813234UL))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ14                    *((volatile unsigned int*)(0x43813238UL))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ15                    *((volatile unsigned int*)(0x4381323CUL))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ16                    *((volatile unsigned int*)(0x43813240UL))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ17                    *((volatile unsigned int*)(0x43813244UL))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ18                    *((volatile unsigned int*)(0x43813248UL))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT0                     *((volatile unsigned int*)(0x4381324CUL))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT1                     *((volatile unsigned int*)(0x43813250UL))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT2                     *((volatile unsigned int*)(0x43813254UL))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT3                     *((volatile unsigned int*)(0x43813258UL))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT4                     *((volatile unsigned int*)(0x4381325CUL))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT5                     *((volatile unsigned int*)(0x43813260UL))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT6                     *((volatile unsigned int*)(0x43813264UL))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT7                     *((volatile unsigned int*)(0x43813268UL))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT8                     *((volatile unsigned int*)(0x4381326CUL))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT9                     *((volatile unsigned int*)(0x43813270UL))
#define bM4_USBFS_DIEPTSIZ4_MC0                         *((volatile unsigned int*)(0x43813274UL))
#define bM4_USBFS_DIEPTSIZ4_MC1                         *((volatile unsigned int*)(0x43813278UL))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV0                   *((volatile unsigned int*)(0x43813300UL))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV1                   *((volatile unsigned int*)(0x43813304UL))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV2                   *((volatile unsigned int*)(0x43813308UL))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV3                   *((volatile unsigned int*)(0x4381330CUL))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV4                   *((volatile unsigned int*)(0x43813310UL))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV5                   *((volatile unsigned int*)(0x43813314UL))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV6                   *((volatile unsigned int*)(0x43813318UL))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV7                   *((volatile unsigned int*)(0x4381331CUL))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV8                   *((volatile unsigned int*)(0x43813320UL))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV9                   *((volatile unsigned int*)(0x43813324UL))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV10                  *((volatile unsigned int*)(0x43813328UL))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV11                  *((volatile unsigned int*)(0x4381332CUL))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV12                  *((volatile unsigned int*)(0x43813330UL))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV13                  *((volatile unsigned int*)(0x43813334UL))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV14                  *((volatile unsigned int*)(0x43813338UL))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV15                  *((volatile unsigned int*)(0x4381333CUL))
#define bM4_USBFS_DIEPCTL5_MPSIZ0                       *((volatile unsigned int*)(0x43813400UL))
#define bM4_USBFS_DIEPCTL5_MPSIZ1                       *((volatile unsigned int*)(0x43813404UL))
#define bM4_USBFS_DIEPCTL5_MPSIZ2                       *((volatile unsigned int*)(0x43813408UL))
#define bM4_USBFS_DIEPCTL5_MPSIZ3                       *((volatile unsigned int*)(0x4381340CUL))
#define bM4_USBFS_DIEPCTL5_MPSIZ4                       *((volatile unsigned int*)(0x43813410UL))
#define bM4_USBFS_DIEPCTL5_MPSIZ5                       *((volatile unsigned int*)(0x43813414UL))
#define bM4_USBFS_DIEPCTL5_MPSIZ6                       *((volatile unsigned int*)(0x43813418UL))
#define bM4_USBFS_DIEPCTL5_MPSIZ7                       *((volatile unsigned int*)(0x4381341CUL))
#define bM4_USBFS_DIEPCTL5_MPSIZ8                       *((volatile unsigned int*)(0x43813420UL))
#define bM4_USBFS_DIEPCTL5_MPSIZ9                       *((volatile unsigned int*)(0x43813424UL))
#define bM4_USBFS_DIEPCTL5_MPSIZ10                      *((volatile unsigned int*)(0x43813428UL))
#define bM4_USBFS_DIEPCTL5_USBAEP                       *((volatile unsigned int*)(0x4381343CUL))
#define bM4_USBFS_DIEPCTL5_EONUM_DPID                   *((volatile unsigned int*)(0x43813440UL))
#define bM4_USBFS_DIEPCTL5_NAKSTS                       *((volatile unsigned int*)(0x43813444UL))
#define bM4_USBFS_DIEPCTL5_EPTYP0                       *((volatile unsigned int*)(0x43813448UL))
#define bM4_USBFS_DIEPCTL5_EPTYP1                       *((volatile unsigned int*)(0x4381344CUL))
#define bM4_USBFS_DIEPCTL5_STALL                        *((volatile unsigned int*)(0x43813454UL))
#define bM4_USBFS_DIEPCTL5_TXFNUM0                      *((volatile unsigned int*)(0x43813458UL))
#define bM4_USBFS_DIEPCTL5_TXFNUM1                      *((volatile unsigned int*)(0x4381345CUL))
#define bM4_USBFS_DIEPCTL5_TXFNUM2                      *((volatile unsigned int*)(0x43813460UL))
#define bM4_USBFS_DIEPCTL5_TXFNUM3                      *((volatile unsigned int*)(0x43813464UL))
#define bM4_USBFS_DIEPCTL5_CNAK                         *((volatile unsigned int*)(0x43813468UL))
#define bM4_USBFS_DIEPCTL5_SNAK                         *((volatile unsigned int*)(0x4381346CUL))
#define bM4_USBFS_DIEPCTL5_SD0PID_SEVNFRM               *((volatile unsigned int*)(0x43813470UL))
#define bM4_USBFS_DIEPCTL5_SODDFRM                      *((volatile unsigned int*)(0x43813474UL))
#define bM4_USBFS_DIEPCTL5_EPDIS                        *((volatile unsigned int*)(0x43813478UL))
#define bM4_USBFS_DIEPCTL5_EPENA                        *((volatile unsigned int*)(0x4381347CUL))
#define bM4_USBFS_DIEPINT5_XFRC                         *((volatile unsigned int*)(0x43813500UL))
#define bM4_USBFS_DIEPINT5_EPDISD                       *((volatile unsigned int*)(0x43813504UL))
#define bM4_USBFS_DIEPINT5_TOC                          *((volatile unsigned int*)(0x4381350CUL))
#define bM4_USBFS_DIEPINT5_TTXFE                        *((volatile unsigned int*)(0x43813510UL))
#define bM4_USBFS_DIEPINT5_NEPNE                        *((volatile unsigned int*)(0x43813518UL))
#define bM4_USBFS_DIEPINT5_TXFE                         *((volatile unsigned int*)(0x4381351CUL))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ0                     *((volatile unsigned int*)(0x43813600UL))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ1                     *((volatile unsigned int*)(0x43813604UL))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ2                     *((volatile unsigned int*)(0x43813608UL))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ3                     *((volatile unsigned int*)(0x4381360CUL))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ4                     *((volatile unsigned int*)(0x43813610UL))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ5                     *((volatile unsigned int*)(0x43813614UL))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ6                     *((volatile unsigned int*)(0x43813618UL))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ7                     *((volatile unsigned int*)(0x4381361CUL))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ8                     *((volatile unsigned int*)(0x43813620UL))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ9                     *((volatile unsigned int*)(0x43813624UL))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ10                    *((volatile unsigned int*)(0x43813628UL))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ11                    *((volatile unsigned int*)(0x4381362CUL))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ12                    *((volatile unsigned int*)(0x43813630UL))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ13                    *((volatile unsigned int*)(0x43813634UL))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ14                    *((volatile unsigned int*)(0x43813638UL))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ15                    *((volatile unsigned int*)(0x4381363CUL))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ16                    *((volatile unsigned int*)(0x43813640UL))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ17                    *((volatile unsigned int*)(0x43813644UL))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ18                    *((volatile unsigned int*)(0x43813648UL))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT0                     *((volatile unsigned int*)(0x4381364CUL))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT1                     *((volatile unsigned int*)(0x43813650UL))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT2                     *((volatile unsigned int*)(0x43813654UL))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT3                     *((volatile unsigned int*)(0x43813658UL))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT4                     *((volatile unsigned int*)(0x4381365CUL))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT5                     *((volatile unsigned int*)(0x43813660UL))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT6                     *((volatile unsigned int*)(0x43813664UL))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT7                     *((volatile unsigned int*)(0x43813668UL))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT8                     *((volatile unsigned int*)(0x4381366CUL))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT9                     *((volatile unsigned int*)(0x43813670UL))
#define bM4_USBFS_DIEPTSIZ5_MC0                         *((volatile unsigned int*)(0x43813674UL))
#define bM4_USBFS_DIEPTSIZ5_MC1                         *((volatile unsigned int*)(0x43813678UL))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV0                   *((volatile unsigned int*)(0x43813700UL))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV1                   *((volatile unsigned int*)(0x43813704UL))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV2                   *((volatile unsigned int*)(0x43813708UL))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV3                   *((volatile unsigned int*)(0x4381370CUL))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV4                   *((volatile unsigned int*)(0x43813710UL))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV5                   *((volatile unsigned int*)(0x43813714UL))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV6                   *((volatile unsigned int*)(0x43813718UL))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV7                   *((volatile unsigned int*)(0x4381371CUL))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV8                   *((volatile unsigned int*)(0x43813720UL))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV9                   *((volatile unsigned int*)(0x43813724UL))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV10                  *((volatile unsigned int*)(0x43813728UL))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV11                  *((volatile unsigned int*)(0x4381372CUL))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV12                  *((volatile unsigned int*)(0x43813730UL))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV13                  *((volatile unsigned int*)(0x43813734UL))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV14                  *((volatile unsigned int*)(0x43813738UL))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV15                  *((volatile unsigned int*)(0x4381373CUL))
#define bM4_USBFS_DOEPCTL0_MPSIZ0                       *((volatile unsigned int*)(0x43816000UL))
#define bM4_USBFS_DOEPCTL0_MPSIZ1                       *((volatile unsigned int*)(0x43816004UL))
#define bM4_USBFS_DOEPCTL0_USBAEP                       *((volatile unsigned int*)(0x4381603CUL))
#define bM4_USBFS_DOEPCTL0_NAKSTS                       *((volatile unsigned int*)(0x43816044UL))
#define bM4_USBFS_DOEPCTL0_EPTYP0                       *((volatile unsigned int*)(0x43816048UL))
#define bM4_USBFS_DOEPCTL0_EPTYP1                       *((volatile unsigned int*)(0x4381604CUL))
#define bM4_USBFS_DOEPCTL0_SNPM                         *((volatile unsigned int*)(0x43816050UL))
#define bM4_USBFS_DOEPCTL0_STALL                        *((volatile unsigned int*)(0x43816054UL))
#define bM4_USBFS_DOEPCTL0_CNAK                         *((volatile unsigned int*)(0x43816068UL))
#define bM4_USBFS_DOEPCTL0_SNAK                         *((volatile unsigned int*)(0x4381606CUL))
#define bM4_USBFS_DOEPCTL0_EPDIS                        *((volatile unsigned int*)(0x43816078UL))
#define bM4_USBFS_DOEPCTL0_EPENA                        *((volatile unsigned int*)(0x4381607CUL))
#define bM4_USBFS_DOEPINT0_XFRC                         *((volatile unsigned int*)(0x43816100UL))
#define bM4_USBFS_DOEPINT0_EPDISD                       *((volatile unsigned int*)(0x43816104UL))
#define bM4_USBFS_DOEPINT0_STUP                         *((volatile unsigned int*)(0x4381610CUL))
#define bM4_USBFS_DOEPINT0_OTEPDIS                      *((volatile unsigned int*)(0x43816110UL))
#define bM4_USBFS_DOEPINT0_B2BSTUP                      *((volatile unsigned int*)(0x43816118UL))
#define bM4_USBFS_DOEPTSIZ0_XFRSIZ0                     *((volatile unsigned int*)(0x43816200UL))
#define bM4_USBFS_DOEPTSIZ0_XFRSIZ1                     *((volatile unsigned int*)(0x43816204UL))
#define bM4_USBFS_DOEPTSIZ0_XFRSIZ2                     *((volatile unsigned int*)(0x43816208UL))
#define bM4_USBFS_DOEPTSIZ0_XFRSIZ3                     *((volatile unsigned int*)(0x4381620CUL))
#define bM4_USBFS_DOEPTSIZ0_XFRSIZ4                     *((volatile unsigned int*)(0x43816210UL))
#define bM4_USBFS_DOEPTSIZ0_XFRSIZ5                     *((volatile unsigned int*)(0x43816214UL))
#define bM4_USBFS_DOEPTSIZ0_XFRSIZ6                     *((volatile unsigned int*)(0x43816218UL))
#define bM4_USBFS_DOEPTSIZ0_PKTCNT                      *((volatile unsigned int*)(0x4381624CUL))
#define bM4_USBFS_DOEPTSIZ0_STUPCNT0                    *((volatile unsigned int*)(0x43816274UL))
#define bM4_USBFS_DOEPTSIZ0_STUPCNT1                    *((volatile unsigned int*)(0x43816278UL))
#define bM4_USBFS_DOEPCTL1_MPSIZ0                       *((volatile unsigned int*)(0x43816400UL))
#define bM4_USBFS_DOEPCTL1_MPSIZ1                       *((volatile unsigned int*)(0x43816404UL))
#define bM4_USBFS_DOEPCTL1_MPSIZ2                       *((volatile unsigned int*)(0x43816408UL))
#define bM4_USBFS_DOEPCTL1_MPSIZ3                       *((volatile unsigned int*)(0x4381640CUL))
#define bM4_USBFS_DOEPCTL1_MPSIZ4                       *((volatile unsigned int*)(0x43816410UL))
#define bM4_USBFS_DOEPCTL1_MPSIZ5                       *((volatile unsigned int*)(0x43816414UL))
#define bM4_USBFS_DOEPCTL1_MPSIZ6                       *((volatile unsigned int*)(0x43816418UL))
#define bM4_USBFS_DOEPCTL1_MPSIZ7                       *((volatile unsigned int*)(0x4381641CUL))
#define bM4_USBFS_DOEPCTL1_MPSIZ8                       *((volatile unsigned int*)(0x43816420UL))
#define bM4_USBFS_DOEPCTL1_MPSIZ9                       *((volatile unsigned int*)(0x43816424UL))
#define bM4_USBFS_DOEPCTL1_MPSIZ10                      *((volatile unsigned int*)(0x43816428UL))
#define bM4_USBFS_DOEPCTL1_USBAEP                       *((volatile unsigned int*)(0x4381643CUL))
#define bM4_USBFS_DOEPCTL1_DPID                         *((volatile unsigned int*)(0x43816440UL))
#define bM4_USBFS_DOEPCTL1_NAKSTS                       *((volatile unsigned int*)(0x43816444UL))
#define bM4_USBFS_DOEPCTL1_EPTYP0                       *((volatile unsigned int*)(0x43816448UL))
#define bM4_USBFS_DOEPCTL1_EPTYP1                       *((volatile unsigned int*)(0x4381644CUL))
#define bM4_USBFS_DOEPCTL1_SNPM                         *((volatile unsigned int*)(0x43816450UL))
#define bM4_USBFS_DOEPCTL1_STALL                        *((volatile unsigned int*)(0x43816454UL))
#define bM4_USBFS_DOEPCTL1_CNAK                         *((volatile unsigned int*)(0x43816468UL))
#define bM4_USBFS_DOEPCTL1_SNAK                         *((volatile unsigned int*)(0x4381646CUL))
#define bM4_USBFS_DOEPCTL1_SD0PID                       *((volatile unsigned int*)(0x43816470UL))
#define bM4_USBFS_DOEPCTL1_SD1PID                       *((volatile unsigned int*)(0x43816474UL))
#define bM4_USBFS_DOEPCTL1_EPDIS                        *((volatile unsigned int*)(0x43816478UL))
#define bM4_USBFS_DOEPCTL1_EPENA                        *((volatile unsigned int*)(0x4381647CUL))
#define bM4_USBFS_DOEPINT1_XFRC                         *((volatile unsigned int*)(0x43816500UL))
#define bM4_USBFS_DOEPINT1_EPDISD                       *((volatile unsigned int*)(0x43816504UL))
#define bM4_USBFS_DOEPINT1_STUP                         *((volatile unsigned int*)(0x4381650CUL))
#define bM4_USBFS_DOEPINT1_OTEPDIS                      *((volatile unsigned int*)(0x43816510UL))
#define bM4_USBFS_DOEPINT1_B2BSTUP                      *((volatile unsigned int*)(0x43816518UL))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ0                     *((volatile unsigned int*)(0x43816600UL))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ1                     *((volatile unsigned int*)(0x43816604UL))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ2                     *((volatile unsigned int*)(0x43816608UL))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ3                     *((volatile unsigned int*)(0x4381660CUL))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ4                     *((volatile unsigned int*)(0x43816610UL))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ5                     *((volatile unsigned int*)(0x43816614UL))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ6                     *((volatile unsigned int*)(0x43816618UL))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ7                     *((volatile unsigned int*)(0x4381661CUL))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ8                     *((volatile unsigned int*)(0x43816620UL))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ9                     *((volatile unsigned int*)(0x43816624UL))
