CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/hc32f460petb.h
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ10                    *((volatile unsigned int*)(0x43816628UL))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ11                    *((volatile unsigned int*)(0x4381662CUL))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ12                    *((volatile unsigned int*)(0x43816630UL))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ13                    *((volatile unsigned int*)(0x43816634UL))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ14                    *((volatile unsigned int*)(0x43816638UL))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ15                    *((volatile unsigned int*)(0x4381663CUL))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ16                    *((volatile unsigned int*)(0x43816640UL))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ17                    *((volatile unsigned int*)(0x43816644UL))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ18                    *((volatile unsigned int*)(0x43816648UL))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT0                     *((volatile unsigned int*)(0x4381664CUL))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT1                     *((volatile unsigned int*)(0x43816650UL))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT2                     *((volatile unsigned int*)(0x43816654UL))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT3                     *((volatile unsigned int*)(0x43816658UL))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT4                     *((volatile unsigned int*)(0x4381665CUL))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT5                     *((volatile unsigned int*)(0x43816660UL))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT6                     *((volatile unsigned int*)(0x43816664UL))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT7                     *((volatile unsigned int*)(0x43816668UL))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT8                     *((volatile unsigned int*)(0x4381666CUL))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT9                     *((volatile unsigned int*)(0x43816670UL))
#define bM4_USBFS_DOEPCTL2_MPSIZ0                       *((volatile unsigned int*)(0x43816800UL))
#define bM4_USBFS_DOEPCTL2_MPSIZ1                       *((volatile unsigned int*)(0x43816804UL))
#define bM4_USBFS_DOEPCTL2_MPSIZ2                       *((volatile unsigned int*)(0x43816808UL))
#define bM4_USBFS_DOEPCTL2_MPSIZ3                       *((volatile unsigned int*)(0x4381680CUL))
#define bM4_USBFS_DOEPCTL2_MPSIZ4                       *((volatile unsigned int*)(0x43816810UL))
#define bM4_USBFS_DOEPCTL2_MPSIZ5                       *((volatile unsigned int*)(0x43816814UL))
#define bM4_USBFS_DOEPCTL2_MPSIZ6                       *((volatile unsigned int*)(0x43816818UL))
#define bM4_USBFS_DOEPCTL2_MPSIZ7                       *((volatile unsigned int*)(0x4381681CUL))
#define bM4_USBFS_DOEPCTL2_MPSIZ8                       *((volatile unsigned int*)(0x43816820UL))
#define bM4_USBFS_DOEPCTL2_MPSIZ9                       *((volatile unsigned int*)(0x43816824UL))
#define bM4_USBFS_DOEPCTL2_MPSIZ10                      *((volatile unsigned int*)(0x43816828UL))
#define bM4_USBFS_DOEPCTL2_USBAEP                       *((volatile unsigned int*)(0x4381683CUL))
#define bM4_USBFS_DOEPCTL2_DPID                         *((volatile unsigned int*)(0x43816840UL))
#define bM4_USBFS_DOEPCTL2_NAKSTS                       *((volatile unsigned int*)(0x43816844UL))
#define bM4_USBFS_DOEPCTL2_EPTYP0                       *((volatile unsigned int*)(0x43816848UL))
#define bM4_USBFS_DOEPCTL2_EPTYP1                       *((volatile unsigned int*)(0x4381684CUL))
#define bM4_USBFS_DOEPCTL2_SNPM                         *((volatile unsigned int*)(0x43816850UL))
#define bM4_USBFS_DOEPCTL2_STALL                        *((volatile unsigned int*)(0x43816854UL))
#define bM4_USBFS_DOEPCTL2_CNAK                         *((volatile unsigned int*)(0x43816868UL))
#define bM4_USBFS_DOEPCTL2_SNAK                         *((volatile unsigned int*)(0x4381686CUL))
#define bM4_USBFS_DOEPCTL2_SD0PID                       *((volatile unsigned int*)(0x43816870UL))
#define bM4_USBFS_DOEPCTL2_SD1PID                       *((volatile unsigned int*)(0x43816874UL))
#define bM4_USBFS_DOEPCTL2_EPDIS                        *((volatile unsigned int*)(0x43816878UL))
#define bM4_USBFS_DOEPCTL2_EPENA                        *((volatile unsigned int*)(0x4381687CUL))
#define bM4_USBFS_DOEPINT2_XFRC                         *((volatile unsigned int*)(0x43816900UL))
#define bM4_USBFS_DOEPINT2_EPDISD                       *((volatile unsigned int*)(0x43816904UL))
#define bM4_USBFS_DOEPINT2_STUP                         *((volatile unsigned int*)(0x4381690CUL))
#define bM4_USBFS_DOEPINT2_OTEPDIS                      *((volatile unsigned int*)(0x43816910UL))
#define bM4_USBFS_DOEPINT2_B2BSTUP                      *((volatile unsigned int*)(0x43816918UL))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ0                     *((volatile unsigned int*)(0x43816A00UL))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ1                     *((volatile unsigned int*)(0x43816A04UL))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ2                     *((volatile unsigned int*)(0x43816A08UL))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ3                     *((volatile unsigned int*)(0x43816A0CUL))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ4                     *((volatile unsigned int*)(0x43816A10UL))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ5                     *((volatile unsigned int*)(0x43816A14UL))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ6                     *((volatile unsigned int*)(0x43816A18UL))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ7                     *((volatile unsigned int*)(0x43816A1CUL))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ8                     *((volatile unsigned int*)(0x43816A20UL))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ9                     *((volatile unsigned int*)(0x43816A24UL))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ10                    *((volatile unsigned int*)(0x43816A28UL))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ11                    *((volatile unsigned int*)(0x43816A2CUL))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ12                    *((volatile unsigned int*)(0x43816A30UL))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ13                    *((volatile unsigned int*)(0x43816A34UL))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ14                    *((volatile unsigned int*)(0x43816A38UL))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ15                    *((volatile unsigned int*)(0x43816A3CUL))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ16                    *((volatile unsigned int*)(0x43816A40UL))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ17                    *((volatile unsigned int*)(0x43816A44UL))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ18                    *((volatile unsigned int*)(0x43816A48UL))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT0                     *((volatile unsigned int*)(0x43816A4CUL))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT1                     *((volatile unsigned int*)(0x43816A50UL))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT2                     *((volatile unsigned int*)(0x43816A54UL))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT3                     *((volatile unsigned int*)(0x43816A58UL))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT4                     *((volatile unsigned int*)(0x43816A5CUL))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT5                     *((volatile unsigned int*)(0x43816A60UL))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT6                     *((volatile unsigned int*)(0x43816A64UL))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT7                     *((volatile unsigned int*)(0x43816A68UL))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT8                     *((volatile unsigned int*)(0x43816A6CUL))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT9                     *((volatile unsigned int*)(0x43816A70UL))
#define bM4_USBFS_DOEPCTL3_MPSIZ0                       *((volatile unsigned int*)(0x43816C00UL))
#define bM4_USBFS_DOEPCTL3_MPSIZ1                       *((volatile unsigned int*)(0x43816C04UL))
#define bM4_USBFS_DOEPCTL3_MPSIZ2                       *((volatile unsigned int*)(0x43816C08UL))
#define bM4_USBFS_DOEPCTL3_MPSIZ3                       *((volatile unsigned int*)(0x43816C0CUL))
#define bM4_USBFS_DOEPCTL3_MPSIZ4                       *((volatile unsigned int*)(0x43816C10UL))
#define bM4_USBFS_DOEPCTL3_MPSIZ5                       *((volatile unsigned int*)(0x43816C14UL))
#define bM4_USBFS_DOEPCTL3_MPSIZ6                       *((volatile unsigned int*)(0x43816C18UL))
#define bM4_USBFS_DOEPCTL3_MPSIZ7                       *((volatile unsigned int*)(0x43816C1CUL))
#define bM4_USBFS_DOEPCTL3_MPSIZ8                       *((volatile unsigned int*)(0x43816C20UL))
#define bM4_USBFS_DOEPCTL3_MPSIZ9                       *((volatile unsigned int*)(0x43816C24UL))
#define bM4_USBFS_DOEPCTL3_MPSIZ10                      *((volatile unsigned int*)(0x43816C28UL))
#define bM4_USBFS_DOEPCTL3_USBAEP                       *((volatile unsigned int*)(0x43816C3CUL))
#define bM4_USBFS_DOEPCTL3_DPID                         *((volatile unsigned int*)(0x43816C40UL))
#define bM4_USBFS_DOEPCTL3_NAKSTS                       *((volatile unsigned int*)(0x43816C44UL))
#define bM4_USBFS_DOEPCTL3_EPTYP0                       *((volatile unsigned int*)(0x43816C48UL))
#define bM4_USBFS_DOEPCTL3_EPTYP1                       *((volatile unsigned int*)(0x43816C4CUL))
#define bM4_USBFS_DOEPCTL3_SNPM                         *((volatile unsigned int*)(0x43816C50UL))
#define bM4_USBFS_DOEPCTL3_STALL                        *((volatile unsigned int*)(0x43816C54UL))
#define bM4_USBFS_DOEPCTL3_CNAK                         *((volatile unsigned int*)(0x43816C68UL))
#define bM4_USBFS_DOEPCTL3_SNAK                         *((volatile unsigned int*)(0x43816C6CUL))
#define bM4_USBFS_DOEPCTL3_SD0PID                       *((volatile unsigned int*)(0x43816C70UL))
#define bM4_USBFS_DOEPCTL3_SD1PID                       *((volatile unsigned int*)(0x43816C74UL))
#define bM4_USBFS_DOEPCTL3_EPDIS                        *((volatile unsigned int*)(0x43816C78UL))
#define bM4_USBFS_DOEPCTL3_EPENA                        *((volatile unsigned int*)(0x43816C7CUL))
#define bM4_USBFS_DOEPINT3_XFRC                         *((volatile unsigned int*)(0x43816D00UL))
#define bM4_USBFS_DOEPINT3_EPDISD                       *((volatile unsigned int*)(0x43816D04UL))
#define bM4_USBFS_DOEPINT3_STUP                         *((volatile unsigned int*)(0x43816D0CUL))
#define bM4_USBFS_DOEPINT3_OTEPDIS                      *((volatile unsigned int*)(0x43816D10UL))
#define bM4_USBFS_DOEPINT3_B2BSTUP                      *((volatile unsigned int*)(0x43816D18UL))
#define bM4_USBFS_DOEPTSIZ3_XFRSIZ0                     *((volatile unsigned int*)(0x43816E00UL))
#define bM4_USBFS_DOEPTSIZ3_XFRSIZ1                     *((volatile unsigned int*)(0x43816E04UL))
#define bM4_USBFS_DOEPTSIZ3_XFRSIZ2                     *((volatile unsigned int*)(0x43816E08UL))
#define bM4_USBFS_DOEPTSIZ3_XFRSIZ3                     *((volatile unsigned int*)(0x43816E0CUL))
#define bM4_USBFS_DOEPTSIZ3_XFRSIZ4                     *((volatile unsigned int*)(0x43816E10UL))
#define bM4_USBFS_DOEPTSIZ3_XFRSIZ5                     *((volatile unsigned int*)(0x43816E14UL))
#define bM4_USBFS_DOEPTSIZ3_XFRSIZ6                     *((volatile unsigned int*)(0x43816E18UL))
#define bM4_USBFS_DOEPTSIZ3_XFRSIZ7                     *((volatile unsigned int*)(0x43816E1CUL))
#define bM4_USBFS_DOEPTSIZ3_XFRSIZ8                     *((volatile unsigned int*)(0x43816E20UL))
#define bM4_USBFS_DOEPTSIZ3_XFRSIZ9                     *((volatile unsigned int*)(0x43816E24UL))
#define bM4_USBFS_DOEPTSIZ3_XFRSIZ10                    *((volatile unsigned int*)(0x43816E28UL))
#define bM4_USBFS_DOEPTSIZ3_XFRSIZ11                    *((volatile unsigned int*)(0x43816E2CUL))
#define bM4_USBFS_DOEPTSIZ3_XFRSIZ12                    *((volatile unsigned int*)(0x43816E30UL))
#define bM4_USBFS_DOEPTSIZ3_XFRSIZ13                    *((volatile unsigned int*)(0x43816E34UL))
#define bM4_USBFS_DOEPTSIZ3_XFRSIZ14                    *((volatile unsigned int*)(0x43816E38UL))
#define bM4_USBFS_DOEPTSIZ3_XFRSIZ15                    *((volatile unsigned int*)(0x43816E3CUL))
#define bM4_USBFS_DOEPTSIZ3_XFRSIZ16                    *((volatile unsigned int*)(0x43816E40UL))
#define bM4_USBFS_DOEPTSIZ3_XFRSIZ17                    *((volatile unsigned int*)(0x43816E44UL))
#define bM4_USBFS_DOEPTSIZ3_XFRSIZ18                    *((volatile unsigned int*)(0x43816E48UL))
#define bM4_USBFS_DOEPTSIZ3_PKTCNT0                     *((volatile unsigned int*)(0x43816E4CUL))
#define bM4_USBFS_DOEPTSIZ3_PKTCNT1                     *((volatile unsigned int*)(0x43816E50UL))
#define bM4_USBFS_DOEPTSIZ3_PKTCNT2                     *((volatile unsigned int*)(0x43816E54UL))
#define bM4_USBFS_DOEPTSIZ3_PKTCNT3                     *((volatile unsigned int*)(0x43816E58UL))
#define bM4_USBFS_DOEPTSIZ3_PKTCNT4                     *((volatile unsigned int*)(0x43816E5CUL))
#define bM4_USBFS_DOEPTSIZ3_PKTCNT5                     *((volatile unsigned int*)(0x43816E60UL))
#define bM4_USBFS_DOEPTSIZ3_PKTCNT6                     *((volatile unsigned int*)(0x43816E64UL))
#define bM4_USBFS_DOEPTSIZ3_PKTCNT7                     *((volatile unsigned int*)(0x43816E68UL))
#define bM4_USBFS_DOEPTSIZ3_PKTCNT8                     *((volatile unsigned int*)(0x43816E6CUL))
#define bM4_USBFS_DOEPTSIZ3_PKTCNT9                     *((volatile unsigned int*)(0x43816E70UL))
#define bM4_USBFS_DOEPCTL4_MPSIZ0                       *((volatile unsigned int*)(0x43817000UL))
#define bM4_USBFS_DOEPCTL4_MPSIZ1                       *((volatile unsigned int*)(0x43817004UL))
#define bM4_USBFS_DOEPCTL4_MPSIZ2                       *((volatile unsigned int*)(0x43817008UL))
#define bM4_USBFS_DOEPCTL4_MPSIZ3                       *((volatile unsigned int*)(0x4381700CUL))
#define bM4_USBFS_DOEPCTL4_MPSIZ4                       *((volatile unsigned int*)(0x43817010UL))
#define bM4_USBFS_DOEPCTL4_MPSIZ5                       *((volatile unsigned int*)(0x43817014UL))
#define bM4_USBFS_DOEPCTL4_MPSIZ6                       *((volatile unsigned int*)(0x43817018UL))
#define bM4_USBFS_DOEPCTL4_MPSIZ7                       *((volatile unsigned int*)(0x4381701CUL))
#define bM4_USBFS_DOEPCTL4_MPSIZ8                       *((volatile unsigned int*)(0x43817020UL))
#define bM4_USBFS_DOEPCTL4_MPSIZ9                       *((volatile unsigned int*)(0x43817024UL))
#define bM4_USBFS_DOEPCTL4_MPSIZ10                      *((volatile unsigned int*)(0x43817028UL))
#define bM4_USBFS_DOEPCTL4_USBAEP                       *((volatile unsigned int*)(0x4381703CUL))
#define bM4_USBFS_DOEPCTL4_DPID                         *((volatile unsigned int*)(0x43817040UL))
#define bM4_USBFS_DOEPCTL4_NAKSTS                       *((volatile unsigned int*)(0x43817044UL))
#define bM4_USBFS_DOEPCTL4_EPTYP0                       *((volatile unsigned int*)(0x43817048UL))
#define bM4_USBFS_DOEPCTL4_EPTYP1                       *((volatile unsigned int*)(0x4381704CUL))
#define bM4_USBFS_DOEPCTL4_SNPM                         *((volatile unsigned int*)(0x43817050UL))
#define bM4_USBFS_DOEPCTL4_STALL                        *((volatile unsigned int*)(0x43817054UL))
#define bM4_USBFS_DOEPCTL4_CNAK                         *((volatile unsigned int*)(0x43817068UL))
#define bM4_USBFS_DOEPCTL4_SNAK                         *((volatile unsigned int*)(0x4381706CUL))
#define bM4_USBFS_DOEPCTL4_SD0PID                       *((volatile unsigned int*)(0x43817070UL))
#define bM4_USBFS_DOEPCTL4_SD1PID                       *((volatile unsigned int*)(0x43817074UL))
#define bM4_USBFS_DOEPCTL4_EPDIS                        *((volatile unsigned int*)(0x43817078UL))
#define bM4_USBFS_DOEPCTL4_EPENA                        *((volatile unsigned int*)(0x4381707CUL))
#define bM4_USBFS_DOEPINT4_XFRC                         *((volatile unsigned int*)(0x43817100UL))
#define bM4_USBFS_DOEPINT4_EPDISD                       *((volatile unsigned int*)(0x43817104UL))
#define bM4_USBFS_DOEPINT4_STUP                         *((volatile unsigned int*)(0x4381710CUL))
#define bM4_USBFS_DOEPINT4_OTEPDIS                      *((volatile unsigned int*)(0x43817110UL))
#define bM4_USBFS_DOEPINT4_B2BSTUP                      *((volatile unsigned int*)(0x43817118UL))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ0                     *((volatile unsigned int*)(0x43817200UL))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ1                     *((volatile unsigned int*)(0x43817204UL))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ2                     *((volatile unsigned int*)(0x43817208UL))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ3                     *((volatile unsigned int*)(0x4381720CUL))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ4                     *((volatile unsigned int*)(0x43817210UL))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ5                     *((volatile unsigned int*)(0x43817214UL))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ6                     *((volatile unsigned int*)(0x43817218UL))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ7                     *((volatile unsigned int*)(0x4381721CUL))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ8                     *((volatile unsigned int*)(0x43817220UL))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ9                     *((volatile unsigned int*)(0x43817224UL))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ10                    *((volatile unsigned int*)(0x43817228UL))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ11                    *((volatile unsigned int*)(0x4381722CUL))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ12                    *((volatile unsigned int*)(0x43817230UL))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ13                    *((volatile unsigned int*)(0x43817234UL))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ14                    *((volatile unsigned int*)(0x43817238UL))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ15                    *((volatile unsigned int*)(0x4381723CUL))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ16                    *((volatile unsigned int*)(0x43817240UL))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ17                    *((volatile unsigned int*)(0x43817244UL))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ18                    *((volatile unsigned int*)(0x43817248UL))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT0                     *((volatile unsigned int*)(0x4381724CUL))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT1                     *((volatile unsigned int*)(0x43817250UL))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT2                     *((volatile unsigned int*)(0x43817254UL))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT3                     *((volatile unsigned int*)(0x43817258UL))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT4                     *((volatile unsigned int*)(0x4381725CUL))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT5                     *((volatile unsigned int*)(0x43817260UL))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT6                     *((volatile unsigned int*)(0x43817264UL))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT7                     *((volatile unsigned int*)(0x43817268UL))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT8                     *((volatile unsigned int*)(0x4381726CUL))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT9                     *((volatile unsigned int*)(0x43817270UL))
#define bM4_USBFS_DOEPCTL5_MPSIZ0                       *((volatile unsigned int*)(0x43817400UL))
#define bM4_USBFS_DOEPCTL5_MPSIZ1                       *((volatile unsigned int*)(0x43817404UL))
#define bM4_USBFS_DOEPCTL5_MPSIZ2                       *((volatile unsigned int*)(0x43817408UL))
#define bM4_USBFS_DOEPCTL5_MPSIZ3                       *((volatile unsigned int*)(0x4381740CUL))
#define bM4_USBFS_DOEPCTL5_MPSIZ4                       *((volatile unsigned int*)(0x43817410UL))
#define bM4_USBFS_DOEPCTL5_MPSIZ5                       *((volatile unsigned int*)(0x43817414UL))
#define bM4_USBFS_DOEPCTL5_MPSIZ6                       *((volatile unsigned int*)(0x43817418UL))
#define bM4_USBFS_DOEPCTL5_MPSIZ7                       *((volatile unsigned int*)(0x4381741CUL))
#define bM4_USBFS_DOEPCTL5_MPSIZ8                       *((volatile unsigned int*)(0x43817420UL))
#define bM4_USBFS_DOEPCTL5_MPSIZ9                       *((volatile unsigned int*)(0x43817424UL))
#define bM4_USBFS_DOEPCTL5_MPSIZ10                      *((volatile unsigned int*)(0x43817428UL))
#define bM4_USBFS_DOEPCTL5_USBAEP                       *((volatile unsigned int*)(0x4381743CUL))
#define bM4_USBFS_DOEPCTL5_DPID                         *((volatile unsigned int*)(0x43817440UL))
#define bM4_USBFS_DOEPCTL5_NAKSTS                       *((volatile unsigned int*)(0x43817444UL))
#define bM4_USBFS_DOEPCTL5_EPTYP0                       *((volatile unsigned int*)(0x43817448UL))
#define bM4_USBFS_DOEPCTL5_EPTYP1                       *((volatile unsigned int*)(0x4381744CUL))
#define bM4_USBFS_DOEPCTL5_SNPM                         *((volatile unsigned int*)(0x43817450UL))
#define bM4_USBFS_DOEPCTL5_STALL                        *((volatile unsigned int*)(0x43817454UL))
#define bM4_USBFS_DOEPCTL5_CNAK                         *((volatile unsigned int*)(0x43817468UL))
#define bM4_USBFS_DOEPCTL5_SNAK                         *((volatile unsigned int*)(0x4381746CUL))
#define bM4_USBFS_DOEPCTL5_SD0PID                       *((volatile unsigned int*)(0x43817470UL))
#define bM4_USBFS_DOEPCTL5_SD1PID                       *((volatile unsigned int*)(0x43817474UL))
#define bM4_USBFS_DOEPCTL5_EPDIS                        *((volatile unsigned int*)(0x43817478UL))
#define bM4_USBFS_DOEPCTL5_EPENA                        *((volatile unsigned int*)(0x4381747CUL))
#define bM4_USBFS_DOEPINT5_XFRC                         *((volatile unsigned int*)(0x43817500UL))
#define bM4_USBFS_DOEPINT5_EPDISD                       *((volatile unsigned int*)(0x43817504UL))
#define bM4_USBFS_DOEPINT5_STUP                         *((volatile unsigned int*)(0x4381750CUL))
#define bM4_USBFS_DOEPINT5_OTEPDIS                      *((volatile unsigned int*)(0x43817510UL))
#define bM4_USBFS_DOEPINT5_B2BSTUP                      *((volatile unsigned int*)(0x43817518UL))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ0                     *((volatile unsigned int*)(0x43817600UL))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ1                     *((volatile unsigned int*)(0x43817604UL))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ2                     *((volatile unsigned int*)(0x43817608UL))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ3                     *((volatile unsigned int*)(0x4381760CUL))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ4                     *((volatile unsigned int*)(0x43817610UL))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ5                     *((volatile unsigned int*)(0x43817614UL))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ6                     *((volatile unsigned int*)(0x43817618UL))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ7                     *((volatile unsigned int*)(0x4381761CUL))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ8                     *((volatile unsigned int*)(0x43817620UL))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ9                     *((volatile unsigned int*)(0x43817624UL))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ10                    *((volatile unsigned int*)(0x43817628UL))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ11                    *((volatile unsigned int*)(0x4381762CUL))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ12                    *((volatile unsigned int*)(0x43817630UL))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ13                    *((volatile unsigned int*)(0x43817634UL))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ14                    *((volatile unsigned int*)(0x43817638UL))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ15                    *((volatile unsigned int*)(0x4381763CUL))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ16                    *((volatile unsigned int*)(0x43817640UL))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ17                    *((volatile unsigned int*)(0x43817644UL))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ18                    *((volatile unsigned int*)(0x43817648UL))
#define bM4_USBFS_DOEPTSIZ5_PKTCNT0                     *((volatile unsigned int*)(0x4381764CUL))
#define bM4_USBFS_DOEPTSIZ5_PKTCNT1                     *((volatile unsigned int*)(0x43817650UL))
#define bM4_USBFS_DOEPTSIZ5_PKTCNT2                     *((volatile unsigned int*)(0x43817654UL))
